{
    "account": {
        "name": "CBSNews",
        "pfp": "https://pbs.twimg.com/profile_images/1617634745348661249/6YmPYpNd_normal.jpg",
        "accountLink": "https://twitter.com/CBSNews"
    },
    "tweets": [{
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:40:04 +0000 2024",
        "full_text": "RT @CBSEveningNews: EXCLUSIVE: Body cam video obtained by @CBSNews’ @JoLingKent captured the arrests of two men accused of soliciting sex f…",
        "id_str": "1788353203500704196"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:40:00 +0000 2024",
        "full_text": "A former quality manager who blew the whistle on Spirit AeroSystems, a troubled Boeing supplier that builds the bulk of the 737 Max, says he was pressured to downplay problems he found while inspecting the plane's fuselages. https://t.co/yDduNLPxg0",
        "id_str": "1788353189009330476"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:30:09 +0000 2024",
        "full_text": "RT @CBSEveningNews: Lisa Harloff says she is on a mission to help those in dire need of life-saving blood, which includes her 8-year-old so…",
        "id_str": "1788350707457798459"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:30:06 +0000 2024",
        "full_text": "RT @CBSEveningNews: The Biden administration announced it would withhold certain weapon shipments to Israel amid Prime Minister Benjamin Ne…",
        "id_str": "1788350695566987337"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:27:04 +0000 2024",
        "full_text": "RT @CBSEveningNews: Michigan saw reports of at least three tornadoes, prompting the state's first-ever tornado emergency. Nearly 176 homes…",
        "id_str": "1788349933063381094"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:27:02 +0000 2024",
        "full_text": "RT @CBSEveningNews: Shohei Ohtani's former interpreter has agreed to plead guilty to two federal charges for illegally transferring almost…",
        "id_str": "1788349924247019772"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:20:00 +0000 2024",
        "full_text": "Four flight attendants have been charged in connection with an alleged scheme to smuggle drug money from the U.S. to the Dominican Republic, authorities announced Wednesday.\n\n https://t.co/uVjRKlN3Ox",
        "id_str": "1788348153382523130"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:08:25 +0000 2024",
        "full_text": "RT @CBSEveningNews: A FedEx cargo plane made an emergency landing in Turkey after officials say the front landing gear of the aircraft stop…",
        "id_str": "1788345238630613067"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:08:23 +0000 2024",
        "full_text": "RT @CBSEveningNews: The man accused of murdering Georgia nursing student Laken Riley in February has been indicted by a grand jury on 10 ne…",
        "id_str": "1788345231491973460"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:08:19 +0000 2024",
        "full_text": "RT @CBSEveningNews: Manhattan District Attorney Alvin Bragg announced that $1 million in stolen goods was recovered in a retail theft fenci…",
        "id_str": "1788345215503270037"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:08:17 +0000 2024",
        "full_text": "RT @CBSEveningNews: The Georgia Court of Appeals will consider an appeal from former President Trump to disqualify Fulton County District A…",
        "id_str": "1788345206712012989"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:03:28 +0000 2024",
        "full_text": "RT @CBSEveningNews: A sprawling storm system extending from Texas to Virginia is forecasted to unleash dangerous weather conditions for mil…",
        "id_str": "1788343992255381509"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 23:00:00 +0000 2024",
        "full_text": "Hyundai and Kia's American financing arm repossessed more than two dozen vehicles leased by U.S. military service members without first getting court orders, as legally required, federal prosecutors alleged on Wednesday. https://t.co/rlm4JOOv47",
        "id_str": "1788343121329131587"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:56:29 +0000 2024",
        "full_text": "RT @CBSEveningNews: BREAKING: Democrats joined Republicans in an overwhelming vote of 359-43 to defeat a motion by Rep. Marjorie Taylor Gre…",
        "id_str": "1788342236364538346"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:52:40 +0000 2024",
        "full_text": "RT @CBSEveningNews: EXCLUSIVE: A former quality manager who blew the whistle on Spirit AeroSystems, a troubled Boeing supplier that builds…",
        "id_str": "1788341275453735070"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:40:00 +0000 2024",
        "full_text": "More than 320,000 children in the United States lost a parent to a drug overdose from 2011 to 2021, a study by the National Institute on Drug Abuse found. \n\n https://t.co/Aawl9zgWQs",
        "id_str": "1788338088319631678"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:38:55 +0000 2024",
        "full_text": "Leaders of some of the largest U.S. public school districts faced questions from a House panel about incidents of antisemitism in their schools.\n\n\"It's a crisis,\" House GOP Conference Chair Elise Stefanik tells @nikolendc. \"The hearings matter in terms of accountability.\" https://t.co/RNOoI7EBUV",
        "id_str": "1788337815878537221"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:27:37 +0000 2024",
        "full_text": "CIA Director Bill Burns met with Israeli Prime Minister Netanyahu today in a continued effort to broker a cease-fire and hostage release deal between Israel and Hamas. The meeting came after the U.S. paused a shipment of bombs to Israel due to concerns they could be dropped on… https://t.co/g3XcDwskT7",
        "id_str": "1788334972270415977"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:22:26 +0000 2024",
        "full_text": "The leaders of three of the largest U.S. public school districts said in a House hearing that the phrase \"From the river to the sea, Palestine will be free\" is antisemitic, with New York City's chancellor saying it is \"not allowed in our schools.\" https://t.co/tsSaOvNG93 https://t.co/PTeSTLnbp2",
        "id_str": "1788333668932473279"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:21:54 +0000 2024",
        "full_text": "WATCH LIVE: The Daily Report with John Dickerson spotlights reporting and interviews on the day's events https://t.co/65NDumAuVR https://t.co/xIcPNlwrkY",
        "id_str": "1788333530969514147"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:20:00 +0000 2024",
        "full_text": "Prince Harry arrived for a church service at London's St. Paul's Cathedral ahead of the Invictus Games, in a rare public appearance. King Charles was hosting the first annual garden party at Buckingham Palace, but the two will not meet up. https://t.co/9BbVqrkuNW",
        "id_str": "1788333056496935155"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:18:55 +0000 2024",
        "full_text": "Allegations of political persecution are \"deeply dangerous,\" says @majorcbs on his insights after serving as a grand juror assigned to the D.C. Superior Court.\n\n\"Someone who screams persecution better be able to prove it. And if it cannot be proven, that does not mean the law is… https://t.co/s0lJePUvOp",
        "id_str": "1788332781182808206"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:12:35 +0000 2024",
        "full_text": "RT @48hours: Two Australians and an American who went missing while on a surfing trip in Mexico were found dead at the bottom of a well on…",
        "id_str": "1788331186797895839"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:12:16 +0000 2024",
        "full_text": "Despite losing more than 30 family members in the war, Ahmed Fuad Al Katib – a Palestinian-American political analyst on the Middle East who was raised in Gaza – believes that a two-state solution \"remains the only viable option for the Palestinian ... side by side with Israel.\" https://t.co/fvCLGOPeeZ",
        "id_str": "1788331109895246326"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:08:08 +0000 2024",
        "full_text": "Rep. Jasmine Crockett (D-TX) tells @majorcbs's @TakeoutPodcast \"anything that's been important\" that the House has passed this term is \"because of Democrats.\"\n\n\"That MAGA faction has actually empowered the Democrats...You would think they would learn at this point,\" she adds. https://t.co/RqZPFdDarS",
        "id_str": "1788330069456195997"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:07:42 +0000 2024",
        "full_text": "Vice President Kamala Harris held a campaign event Wednesday in the battleground state of Pennsylvania focused on reproductive rights. @majorcbs talks with state Rep. Malcolm Kenyatta (D-PA) about how the issue of abortion access will impact voters in November. https://t.co/f85SsFohKA",
        "id_str": "1788329959347380449"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 22:06:01 +0000 2024",
        "full_text": "BREAKING: The House votes 359-43 to table Rep. Greene's motion to oust Speaker Johnson, effectively killing the effort.  https://t.co/456941En1S",
        "id_str": "1788329536796467609"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 21:57:10 +0000 2024",
        "full_text": "RT @48hours: Two Australians and an American who went missing while on a surfing trip in Mexico were found dead at the bottom of a well on…",
        "id_str": "1788327307205026005"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 21:50:00 +0000 2024",
        "full_text": "Wages for the typical U.S. worker have grown since the pandemic, but for many Americans those gains are being gobbled up by rising rent — especially in these cities. https://t.co/cSii72I6Pc",
        "id_str": "1788325504841314514"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 21:35:12 +0000 2024",
        "full_text": "BREAKING: Rep. Marjorie Taylor Greene has proceeded with her threat to try to oust Speaker Mike Johnson, calling for a vote on a motion to vacate the speaker from the House floor. https://t.co/SAjuzr6PS3",
        "id_str": "1788321780421013690"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 21:30:00 +0000 2024",
        "full_text": "Two regional grocers — Hy-Vee and Schnuck Markets — are separately recalling a variety of cream cheese spreads sold across the Midwest because the products may be contaminated with salmonella. https://t.co/AmrXXcN8Yb",
        "id_str": "1788320473010332000"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 21:10:00 +0000 2024",
        "full_text": "A thick atmosphere has been detected around a planet that's twice as big as Earth in a nearby solar system, researchers reported Wednesday. https://t.co/crg47ymTKj",
        "id_str": "1788315437056344344"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 20:57:48 +0000 2024",
        "full_text": "BREAKING: The ex-interpreter of baseball star Shohei Ohtani has agreed to plead guilty to federal bank fraud and tax charges. https://t.co/HkeZuEPC2i",
        "id_str": "1788312369291997680"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 20:50:00 +0000 2024",
        "full_text": "New York has more millionaires than any other city in the world, beating out California's Bay Area, London and other wealthy cities, according to a new report. \n\nNearly 350,00 people, or one in every 24 residents of The Big Apple, are millionaires. https://t.co/7i6y4bCv57",
        "id_str": "1788310405263011990"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 20:30:00 +0000 2024",
        "full_text": "The campaign of Robert F. Kennedy Jr., the independent running for president, confirmed Wednesday that he contracted a parasite in his brain over a decade ago. https://t.co/5gVyusoBfC",
        "id_str": "1788305373172060235"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 20:10:01 +0000 2024",
        "full_text": "The American Cancer Society is trying to find out why Black women have the highest death rate for most cancers. https://t.co/VL75Qg4zmc",
        "id_str": "1788300341382873511"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 19:50:01 +0000 2024",
        "full_text": "A cruise ship sailed into a New York City port with a 44-foot dead whale across its bow, marine authorities said. https://t.co/VYXJB5k4rq",
        "id_str": "1788295308423618734"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 19:34:50 +0000 2024",
        "full_text": "BREAKING: The Biden administration is planning to announce a new regulation as early as Thursday that is designed to allow immigration officials to deport migrants who are ineligible for U.S. asylum earlier in the process, three sources familiar with the internal plans told CBS…",
        "id_str": "1788291487735623827"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 19:34:16 +0000 2024",
        "full_text": "RT @camiloreports: NEWS — The Biden administration is planning to announce a new regulation tomorrow that is designed to allow immigration…",
        "id_str": "1788291346773479872"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 19:15:00 +0000 2024",
        "full_text": "A group of \"24 fearless women” set a skydiving record – jumping out of planes at 14,000 feet and forming a 24-way shape in the sky ☁️ https://t.co/DZGJ1z51YB",
        "id_str": "1788286496669151569"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 19:05:14 +0000 2024",
        "full_text": "The Pentagon says the U.S. military has completed construction of the floating Gaza aid pier. \n\nCBS News'@RamyInocencio takes us near an off-limits area outside of Israel's Port of Ashdod, where the pier is being held before an expected move to the Gazan coast. https://t.co/muwZaXNYFH",
        "id_str": "1788284038307835933"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 18:39:02 +0000 2024",
        "full_text": "Travis Kelce confirms he's joining new horror TV series \"Grotesquerie\" https://t.co/d9SmpgM0et",
        "id_str": "1788277446778683416"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 18:38:08 +0000 2024",
        "full_text": "The Olympic flame arrived in France aboard a 19th century tall ship to kick off a 7,500-mile journey to the Paris Summer Games. https://t.co/HUMMOBkHEr",
        "id_str": "1788277220261200044"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 18:37:26 +0000 2024",
        "full_text": "The cost to buy a home is historically high, but Congress and the administration can do much more, experts say. https://t.co/3LhcySwm9a",
        "id_str": "1788277041982292468"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 18:36:13 +0000 2024",
        "full_text": "Steve Albini, alt-rock musician and producer, founder of Chicago recording studio, dies at 61 https://t.co/BmMJenSH6M",
        "id_str": "1788276738138526019"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 18:22:15 +0000 2024",
        "full_text": "\"The potential for another January 6 is there\" if President Biden is re-elected in November, says Rep. Bennie Thompson (D-MS), who chaired the House committee that investigated the 2021 Capitol attack.\n\nThompson tells @MacFarlaneNews that the people who still promote the… https://t.co/dQThyBlyAg",
        "id_str": "1788273222376440113"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 18:00:00 +0000 2024",
        "full_text": "Jerusalem's Hand in Hand school sees Jewish and Arab kids learn together – and they're learning a lot more than just math and science.  https://t.co/FOm54g35CR",
        "id_str": "1788267623332897250"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 17:45:00 +0000 2024",
        "full_text": "Technology has allowed activist Jordyn Zimmerman, a nonspeaking autistic woman, to find her voice.  https://t.co/CWJl06fk0f",
        "id_str": "1788263847775637554"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 17:32:13 +0000 2024",
        "full_text": "The death toll from devastating floods that have ravaged southern Brazil for days reached 100, authorities said, as the search continued for dozens of people still missing.  https://t.co/PMFIJzT9Bk",
        "id_str": "1788260631767921108"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 17:15:17 +0000 2024",
        "full_text": "A horse was found stranded on a rooftop in a flooded area in Brazil's Rio Grande do Sul on Wednesday. Authorities said the death toll had risen to 90 with another four deaths being investigated, while 131 people were still unaccounted for and 155,000 were left homeless. https://t.co/nKNWLyt5XZ",
        "id_str": "1788256370187223117"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 17:00:00 +0000 2024",
        "full_text": "The White House last week paused a shipment of weapons to Israel, as Israeli leaders closed in on a decision to launch an operation in the southern Gaza city of Rafah, a senior administration official said.  https://t.co/Igrqqy8XBu",
        "id_str": "1788252524027240530"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 16:41:58 +0000 2024",
        "full_text": "New versions of the iconic Swiss Army Knife could soon be missing a key component: an actual knife.   https://t.co/CNCHk8WH2H",
        "id_str": "1788247984829796857"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 16:23:37 +0000 2024",
        "full_text": "RT @CBSEveningNews: Here's a look at what's coming up on the CBS Evening News with @NorahODonnell at 6:30 p.m. ET. https://t.co/qA7hZimIxD",
        "id_str": "1788243365982527916"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 16:20:00 +0000 2024",
        "full_text": "FTX says that nearly all of its customers will receive the money back that they are owed, two years after the cryptocurrency exchange imploded, and some will get more than that.  https://t.co/FiB8MxQcim",
        "id_str": "1788242456712032739"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 16:18:32 +0000 2024",
        "full_text": "What does it look like on January 21, 2025, if Donald Trump wins a second term?\n\n\"We'd be in serious trouble,\" Rep. Bennie Thompson (D-MS), chair of the House Jan. 6 Committee, tells @MacFarlaneNews, suggesting that Trump would \"automatically\" pardon all Capitol riot convicts and… https://t.co/TTNlEQjkiZ",
        "id_str": "1788242089311973835"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 16:00:00 +0000 2024",
        "full_text": "A new study reveals that precipitation, not temperature, will keep the Colorado River fuller than previous research found.  https://t.co/GXmb7zpiC9",
        "id_str": "1788237424004420068"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 15:45:00 +0000 2024",
        "full_text": "A former United States Army soldier has been convicted of killing a pregnant colleague in Germany more than two decades ago.  https://t.co/2GmEM19wSE",
        "id_str": "1788233650892427404"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 15:30:00 +0000 2024",
        "full_text": "A spacecraft from the European Space Agency has captured new video of the sun's surface, showing plasma swirling on the star's \"otherworldly\" surface. https://t.co/c5HFYyd7cr",
        "id_str": "1788229874852798617"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 15:15:12 +0000 2024",
        "full_text": "A Boeing cargo plane made a dramatic landing without its front landing gear at Istanbul Airport on Wednesday after it failed to deploy its wheels. There were no casualties. https://t.co/LHnbsOgje8",
        "id_str": "1788226149715181775"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 15:00:01 +0000 2024",
        "full_text": "Police in south India have arrested a couple after the woman allegedly threw their deaf and nonverbal 6-year-old son into a crocodile infested canal, leading to the child's death.  https://t.co/qY76cnnAXC",
        "id_str": "1788222327861174740"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 14:45:00 +0000 2024",
        "full_text": "Tweens obsessed with skin care are spending big on beauty products. Experts share do's and don'ts for safe skin.  https://t.co/Zq6V0l006d",
        "id_str": "1788218549036531732"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 14:33:06 +0000 2024",
        "full_text": "RT @CBSMornings: A majority of Americans turning 65 in the coming years are not financially prepared for retirement, a new study reveals.…",
        "id_str": "1788215556685902052"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 14:33:04 +0000 2024",
        "full_text": "RT @CBSMornings: Pres. Biden denounced what he called a “ferocious surge of antisemitism” in the wake of Hamas’ Oct. 7 attack while marking…",
        "id_str": "1788215546900566222"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 14:33:02 +0000 2024",
        "full_text": "RT @CBSMornings: At 18, @jordynbzim’s world opened up when she got hold of a communication app on an iPad for the first time. She is a nons…",
        "id_str": "1788215538696511846"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 14:33:00 +0000 2024",
        "full_text": "RT @CBSMornings: Portage, Michigan was hit by two tornadoes in the span of 90 minutes on Tuesday, as destructive weather swept across Midwe…",
        "id_str": "1788215530769317950"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 14:32:59 +0000 2024",
        "full_text": "RT @CBSMornings: “Movement really is medicine”: @onepeloton’s @RobinNYC says movement, and running especially, has helped her heal.\n\nShe te…",
        "id_str": "1788215526294008081"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 14:32:55 +0000 2024",
        "full_text": "RT @CBSMornings: Nowon is making a name for itself by blending classic American food with Korean flavors — something chef Jae Lee says is i…",
        "id_str": "1788215507969011753"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 14:32:52 +0000 2024",
        "full_text": "RT @CBSMornings: The ongoing rap battle between Drake and Kendrick Lamar is “a heavyweight fight,” @billboard’s Carl Lamarre (@TheRealCL24)…",
        "id_str": "1788215498481549671"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 14:30:01 +0000 2024",
        "full_text": "South Africa has won a legal claim over $43 million worth of treasure from a World War II shipwreck that was found off the country's coast by a British exploration company, the U.K. Supreme Court said.  https://t.co/mkgfbwoucs",
        "id_str": "1788214778273366518"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 14:15:00 +0000 2024",
        "full_text": "Trillions of cicadas are emerging from the ground after a years-long absence, and any one of them could be part of your next meal.  https://t.co/hVPzSrs84U",
        "id_str": "1788211001411678505"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 13:56:45 +0000 2024",
        "full_text": "BREAKING: An appeals court will review the decision to allow DA Fani Willis to stay on Donald Trump’s Georgia election case.  https://t.co/sRtZCFvKku",
        "id_str": "1788206407449227368"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 13:10:03 +0000 2024",
        "full_text": "Rescue teams searching for dozens of construction workers missing after an apartment complex collapsed in South Africa brought out more survivors Tuesday as they entered a second night of desperate work to find anyone alive in the wreckage.  https://t.co/C3F6wRUj1X",
        "id_str": "1788194657127588209"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 13:08:46 +0000 2024",
        "full_text": "After more than three decades, Ventura police have solved the murder of a 42-year-old woman who was found dead on a hillside in 1991.\n https://t.co/KLCAPgRjQ4",
        "id_str": "1788194330668089766"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 12:58:13 +0000 2024",
        "full_text": "A cruise ship worker from South Africa was arrested Tuesday in Alaska's capital city, accused of attacking a woman and two security guards with scissors on board the vessel, according to authorities. https://t.co/JUmT74Xl3e",
        "id_str": "1788191678823559449"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 12:36:08 +0000 2024",
        "full_text": "RT @CBSMornings: The Biden administration is withholding some weapons that might be used for an Israeli attack on Rafah — Gaza’s last Hamas…",
        "id_str": "1788186119307239889"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 12:36:05 +0000 2024",
        "full_text": "RT @CBSMornings: TikTok is suing the Justice Department over a new law that demands the app divest from its China-based parent company or f…",
        "id_str": "1788186109005987856"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 12:36:03 +0000 2024",
        "full_text": "RT @CBSMornings: Adult film actor Stormy Daniels was questioned in detail about an alleged sexual encounter with Donald Trump in 2006 while…",
        "id_str": "1788186099505881427"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 12:36:00 +0000 2024",
        "full_text": "RT @CBSMornings: Severe storms that brought devastating tornadoes to Oklahoma and Michigan are now moving into the mid-South.\n\n@WeatherChan…",
        "id_str": "1788186087115870427"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 12:35:58 +0000 2024",
        "full_text": "RT @CBSMornings: “It feels devastating to look at this, when you've worked your whole life”: An EF-4 tornado took out entire neighborhoods,…",
        "id_str": "1788186078785982728"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 12:30:00 +0000 2024",
        "full_text": "Leaders of some of the largest U.S. public school districts are facing questions from a House panel Wednesday about incidents of antisemitism in their schools.   https://t.co/g5sV749ihS",
        "id_str": "1788184577497784348"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 12:00:00 +0000 2024",
        "full_text": "As global temperatures continue to rise, precipitation is also expected to change – and the latter could be what saves water levels in the Colorado River. Researchers forecasted a 70% increase in precipitation for the next 25 years compared to the last 20. https://t.co/2wkxY6ZLbD https://t.co/Nk9Ms8eemj",
        "id_str": "1788177028560085452"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 11:35:23 +0000 2024",
        "full_text": "Coming up on CBS News: \n\n🔘Pentagon says it paused shipments of some missiles to Israel as U.S. expresses concerns about potential use in Rafah  \n\n🔘Reported tornadoes slam Western Michigan \n\n🔘Body of the final victim of Baltimore’s bridge collapse recovered https://t.co/GryLQthwjP",
        "id_str": "1788170832734298128"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 11:30:00 +0000 2024",
        "full_text": "A former Mayo Clinic resident accused of fatally poisoning his wife last year may have been identifying as a widower on the dating app Bumble before she even died, a new warrant reveals. https://t.co/itt6LnwSth",
        "id_str": "1788169476510269468"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 11:15:00 +0000 2024",
        "full_text": "Two siblings, ages 4 and 2, died after they were swept away in a San Bernardino County creek on Tuesday.  https://t.co/Q9TfM4gjY6",
        "id_str": "1788165700663619956"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 10:48:39 +0000 2024",
        "full_text": "The Israeli military said Wednesday that it’s reopened a key terminal for the entry of humanitarian aid into Gaza. It comes a day after an Israeli tank brigade seized the nearby Rafah crossing, which remains closed. https://t.co/HybBXB59vF",
        "id_str": "1788159070748164332"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 10:30:00 +0000 2024",
        "full_text": "Minnesota's governor has signed a ticket transparency bill cracking down on hidden costs and re-sellers. https://t.co/yYTLsladnQ",
        "id_str": "1788154377280094212"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 10:00:00 +0000 2024",
        "full_text": "The Boy Scouts of America is changing its name for the first time in its 114-year history to Scouting America. It's a significant shift as the organization emerges from bankruptcy following a flood of sexual abuse claims and seeks to focus on inclusion. https://t.co/0m1Eidw7sr https://t.co/qruwH7RPNg",
        "id_str": "1788146829600637383"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 09:00:00 +0000 2024",
        "full_text": "She was worried about what her son, who has autism, would do after high school. So, she opened a restaurant that employs people with disabilities – and helps the grow ❤️ https://t.co/2H2D1kWlbj",
        "id_str": "1788131729141625106"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 08:00:00 +0000 2024",
        "full_text": "Restaurant chain Panera said on Tuesday that it plans to stop selling its Charged Sips caffeinated beverages that are at the center of multiple lawsuits. https://t.co/aRPiH776cC https://t.co/dgcAXDTzdj",
        "id_str": "1788116630322446675"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 07:00:00 +0000 2024",
        "full_text": "Jack, who had Down syndrome, cannot contain his excitement when his older sister is coming to visit. \"These happy moments leave me grinning from ear to ear,\" his mom said. https://t.co/vP5cpty3ek",
        "id_str": "1788101530056343825"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 06:00:00 +0000 2024",
        "full_text": "Nintendo's president said Tuesday that the company will announce the new switch within its current fiscal year, which ends in March 2025. https://t.co/rWmm7NNDp0 https://t.co/OQfWiNoz8x",
        "id_str": "1788086428179554799"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 05:00:00 +0000 2024",
        "full_text": "Stormy Daniels took the stand in Donald Trump's criminal trial in New York Tuesday, telling jurors about how she met the former president and an alleged sexual encounter she had with him in 2006. https://t.co/0WK4m4UlPe https://t.co/3l0zcuf8IZ",
        "id_str": "1788071331470119316"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 04:00:00 +0000 2024",
        "full_text": "A new study is raising concerns over exposure to flame retardant chemicals used in some car seats. https://t.co/iInhc4uc1d",
        "id_str": "1788056229555630581"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 03:00:00 +0000 2024",
        "full_text": "United Launch Alliance managers have decided to haul the Atlas 5 rocket carrying Boeing's Starliner astronaut ferry ship back to its processing facility to replace a suspect valve, delaying another launch try to at least May 17, NASA said. https://t.co/QGDE74WY71",
        "id_str": "1788041131017556356"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 02:39:06 +0000 2024",
        "full_text": "RT @CBSEveningNews: Residents are assessing the aftermath of tornadoes that ripped through at least seven states in parts of the Great Plai…",
        "id_str": "1788035872807371166"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 02:30:00 +0000 2024",
        "full_text": "Migrants are growing desperate in Mexico, hoping to enter the U.S. — but along the Texas border, they’re facing miles of razor wire erected by state officials. https://t.co/vhUwkfjaeV",
        "id_str": "1788033582784532834"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 02:22:09 +0000 2024",
        "full_text": "Rep. Victoria Spartz, an Indiana Republican and the first Ukrainian-born member of Congress, won a primary challenge Tuesday for her seat, CBS News projects. https://t.co/TiFPemiH00",
        "id_str": "1788031604692041966"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 02:00:00 +0000 2024",
        "full_text": "The Boy Scouts of America is changing its name for the first time in its 114-year history and will become Scouting America. https://t.co/OSdfuiCW3g",
        "id_str": "1788026031317700826"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 01:40:00 +0000 2024",
        "full_text": "FAA investigates Boeing for falsified records on some 787 Dreamliners https://t.co/MfACjaT2HX",
        "id_str": "1788020999612494318"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 01:20:00 +0000 2024",
        "full_text": "A new \"immersive visualization\" will allow users to experience the plunging into a black hole and falling beyond the \"point of no return\" within the phenomenon, the NASA said in a news release. \n\n https://t.co/LDhp77oVNS",
        "id_str": "1788015963830383094"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 01:00:00 +0000 2024",
        "full_text": "Speaking quickly and sharing perhaps more than the judge or prosecutors bargained for, adult film star Stormy Daniels told jurors in former President Donald Trump's trial in New York on Tuesday about an alleged sexual encounter she had with Trump in 2006. https://t.co/Qtsqmhf9qx",
        "id_str": "1788010931999392063"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 00:40:00 +0000 2024",
        "full_text": "Dutch brewing company Heineken is working on \"transforming tired pubs\" across the U.K. with a nearly $50 million investment meant to ease locals as the U.K. recovers from a 41-year inflation high.   https://t.co/Cikz7SUxPH",
        "id_str": "1788005900617232474"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 00:20:00 +0000 2024",
        "full_text": "3 surfers from Australia and the U.S. were killed in Mexico's Baja California. Here's what we know. https://t.co/M0Wt7NplYG",
        "id_str": "1788000864906379666"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 08 00:00:00 +0000 2024",
        "full_text": "A security guard for the rapper Drake was injured in a shooting outside Drake's Toronto home overnight, police said Tuesday.  https://t.co/9D6LZ10YRJ",
        "id_str": "1787995832555303277"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 23:58:34 +0000 2024",
        "full_text": "“We don’t have food. We don’t have water”: Migrants are growing desperate in Mexico, hoping to enter the U.S. But along the Texas border, they’re facing miles of razor wire erected by state officials. @camiloreports traveled there for The Daily Report with John Dickerson.… https://t.co/HxcTW3n8yt",
        "id_str": "1787995473766461911"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 23:40:00 +0000 2024",
        "full_text": "More than 6 million people subscribed to Disney+ in the past three months, helping Walt Disney Co. post a surprise profit in its on-demand video streaming division, executives with the entertainment giant said Tuesday.\n\n https://t.co/2KIQszJQah",
        "id_str": "1787990801022161200"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 23:20:00 +0000 2024",
        "full_text": "Restaurant chain Panera on Tuesday said it plans to stop selling its Charged Sips caffeinated beverages that are at the center of multiple lawsuits. \n\n https://t.co/MV2cqSQHfZ",
        "id_str": "1787985765248438433"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 23:03:23 +0000 2024",
        "full_text": "RT @CBSEveningNews: Baton Rouge Police Corporal Jason Lee is being celebrated after helping a new mom deliver her baby boy, Noah, on the si…",
        "id_str": "1787981584257216525"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 23:02:40 +0000 2024",
        "full_text": "RT @CBSEveningNews: Students are speaking out over the University of Southern California’s choice in April, to cancel its main commencement…",
        "id_str": "1787981402438267309"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 23:00:00 +0000 2024",
        "full_text": "An Idaho man was sentenced last week to 30 years in prison for trying to spread HIV to dozens of victims.  https://t.co/GAMI7HsWDt",
        "id_str": "1787980734017229127"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:58:50 +0000 2024",
        "full_text": "RT @CBSEveningNews: TikTok filed a lawsuit against the Justice Department on Tuesday over a law that requires the platform to cut ties with…",
        "id_str": "1787980441430942168"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:58:47 +0000 2024",
        "full_text": "RT @CBSEveningNews: Most car seats are treated with flame-retardant chemicals due to a federal fire safety standard, but a new study sugges…",
        "id_str": "1787980426721562701"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:58:45 +0000 2024",
        "full_text": "RT @CBSEveningNews: Passengers aboard a Delta flight from Cancun that landed in Seattle had to exit the plane on the emergency chute after…",
        "id_str": "1787980417905078374"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:56:41 +0000 2024",
        "full_text": "RT @CBSEveningNews: President Biden honored the victims of the Holocaust and condemned what he called \"a ferocious surge of antisemitism in…",
        "id_str": "1787979899354878286"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:54:49 +0000 2024",
        "full_text": "RT @CBSEveningNews: Israeli tanks moved across Gaza's southern border, seizing control of the Palestinian side of the Rafah crossing on Egy…",
        "id_str": "1787979430452695122"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:54:47 +0000 2024",
        "full_text": "RT @CBSEveningNews: Severe weather that battered portions of the Central U.S. is shifting eastward. Meteorologist @TWCAlexWilson with @weat…",
        "id_str": "1787979420851949698"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:54:45 +0000 2024",
        "full_text": "RT @CBSEveningNews: Former adult film star Stormy Daniels testified Tuesday in Donald Trump's criminal trial in New York, recounting an all…",
        "id_str": "1787979410563371296"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:43:44 +0000 2024",
        "full_text": "The Biden administration in recent days put a hold on at least one shipment of U.S. ammunition to Israel, two U.S. officials tell CBS News.\n\n\"A sign...of how the dynamic between the United States and Israel is changing,\" @edokeefe reports. https://t.co/EIardW4Mt7",
        "id_str": "1787976638556238332"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:40:01 +0000 2024",
        "full_text": "The FDIC fostered a toxic workplace rife with harassment and bullying that mostly targeted women or people from underrepresented groups, according to a new report.  https://t.co/nB8rgIzqjP",
        "id_str": "1787975702450442490"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:20:00 +0000 2024",
        "full_text": "The body of the sixth and final construction worker was recovered Tuesday from the Key Bridge wreckage site, bringing an end to the weeks long recovery effort. https://t.co/4ZIBfNoTBn",
        "id_str": "1787970666844594463"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:13:52 +0000 2024",
        "full_text": "\"Because of the explosion and normalization of antisemitism and hate-fueled violence in this country, this Holocaust Remembrance Day feels very different,\" says CBS News national security contributor Sam Vinograd, whose father survived the Holocaust.\n\n\"I'm horrified he has to see… https://t.co/GFgoYV9RZP",
        "id_str": "1787969122866770203"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:12:00 +0000 2024",
        "full_text": "A federal judge has indefinitely postponed former President Trump's classified documents trial in Florida, making it unlikely to start before Election Day in November.\n\nCBS News' @MacFarlaneNews &amp; legal contributor Jessica Levinson explain what happens next: https://t.co/erCjXirYNb",
        "id_str": "1787968653436015017"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:11:11 +0000 2024",
        "full_text": "Adult film actor Stormy Daniels testified at former President Trump's criminal trial in New York on Tuesday, telling jurors about an alleged sexual encounter she had with Trump that led to a $130,000 hush money payment.\n\n@errolbarnett reports on the details from court: https://t.co/bE1tvmfvs3",
        "id_str": "1787968449190236278"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:01:35 +0000 2024",
        "full_text": "WATCH LIVE: The Daily Report with John Dickerson spotlights reporting and interviews on the day's events https://t.co/65NDumzX6j https://t.co/r29sj9cp7y",
        "id_str": "1787966030901375294"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 22:01:18 +0000 2024",
        "full_text": "WATCH LIVE: The Daily Report with John Dickerson spotlights reporting and interviews on the day's events https://t.co/65NDumzX6j https://t.co/3yYPvAHmpl",
        "id_str": "1787965961959526622"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 21:55:00 +0000 2024",
        "full_text": "Are Americans losing their taste for Starbucks? \"The whole concept got old,\" one customer said. https://t.co/tVZBs8yASR",
        "id_str": "1787964374713356319"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 21:31:56 +0000 2024",
        "full_text": "BREAKING: A federal judge in Florida indefinitely postpones the trial for Donald Trump's classified documents case. https://t.co/MIJQD7zOYw",
        "id_str": "1787958570434154652"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 21:20:00 +0000 2024",
        "full_text": "Rep. Marjorie Taylor Greene appeared to retreat from her threat to imminently trigger a vote to remove Speaker Mike Johnson as House leader after lengthy meetings with him this week. https://t.co/kbbdKiyTHG",
        "id_str": "1787955567878672877"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 21:00:06 +0000 2024",
        "full_text": "WATCH LIVE: \"America Decides\" has the latest political news, analysis and original reporting  https://t.co/N5oZfxvFs3\n\n https://t.co/TGHON1Jpp6",
        "id_str": "1787950559384715340"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 21:00:00 +0000 2024",
        "full_text": "A woman who fell from the stands to her death during a graduation ceremony at Ohio State University last weekend has been identified as a Georgia resident, authorities announced Tuesday. https://t.co/3jsDFrG6hC",
        "id_str": "1787950535733018636"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 20:40:00 +0000 2024",
        "full_text": "Rep. Victoria Spartz, an Indiana Republican and the first Ukrainian-born member of Congress, is facing a primary challenge for her seat on Tuesday. https://t.co/yEvx1KgGia",
        "id_str": "1787945500102050298"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 20:21:00 +0000 2024",
        "full_text": "Gamers who have been waiting for years for Nintendo to release a successor to its popular Switch console finally got a clue on when to expect an upgraded device. https://t.co/HQIEcnShWI",
        "id_str": "1787940720885538950"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 20:00:00 +0000 2024",
        "full_text": "A British AI startup that specializes in autonomous driving technology has raised more than $1 billion from some high-profile backers, including Microsoft and computer chip-maker Nvidia.  https://t.co/SedfJTJ7kZ",
        "id_str": "1787935433323630995"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 19:40:00 +0000 2024",
        "full_text": "The U.S. Air Force said an airman based at the Special Operations Wing at Hurlburt Field, Florida, was shot and killed during an incident involving a sheriff's deputy.  https://t.co/8D5gEcLcCR",
        "id_str": "1787930401261891723"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 19:20:00 +0000 2024",
        "full_text": "A Moscow court said it had sentenced a U.S. citizen to 10 days in detention for petty hooliganism after he stumbled drunkenly into a children's library and passed out.  https://t.co/PGkyIkUQpY",
        "id_str": "1787925369560936709"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 19:00:01 +0000 2024",
        "full_text": "More than 6 million people subscribed to Disney+ in the past three months, helping Walt Disney Co. post a surprise profit in its on-demand video streaming division, executives with the entertainment giant said.  https://t.co/BxSNrhTllk",
        "id_str": "1787920337264312372"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 18:45:00 +0000 2024",
        "full_text": "At least one person was killed and as many as two others were unaccounted for after a tornado roared through a small northeast Oklahoma city on Monday night, officials said.  https://t.co/QaGIOK0BXC",
        "id_str": "1787916560457228481"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 18:30:00 +0000 2024",
        "full_text": "The Boy Scouts of America is changing its name for the first time in its 114-year history.  https://t.co/msrNWaxECW",
        "id_str": "1787912784174309544"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 18:25:30 +0000 2024",
        "full_text": "BREAKING: Donald Trump's request for a mistrial over Stormy Daniels' testimony is denied by the judge.  https://t.co/eKV8IawR4f",
        "id_str": "1787911651292856526"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 18:15:00 +0000 2024",
        "full_text": "A Sacramento mother is accused of assaulting her 2-year-old child on a flight from Mexico to Seattle, prosecutors said.  https://t.co/skNPmYp0Ke",
        "id_str": "1787909012337390021"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 18:02:26 +0000 2024",
        "full_text": "RT @CBSEveningNews: Here's a look at what's coming up on the CBS Evening News with @NorahODonnell at 6:30 p.m. ET. https://t.co/YbZEmwQ6F9",
        "id_str": "1787905846011424969"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 18:01:23 +0000 2024",
        "full_text": "A group of House Democrats facing a tough campaign cycle has called on President Biden to take executive action on the United States' border with Mexico.  https://t.co/9hBx29IKJd",
        "id_str": "1787905585783951421"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 17:40:01 +0000 2024",
        "full_text": "Former GOP Senate candidate Tiffany Smiley officially launched her campaign to unseat central Washington Rep. Dan Newhouse, one of 10 House Republicans who voted to impeach former President Donald Trump.  https://t.co/eeYW0rt9dY",
        "id_str": "1787900204730945798"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 17:20:00 +0000 2024",
        "full_text": "FAA investigates Boeing for falsified records on some 787 Dreamliners  https://t.co/wvQcXEvIvS",
        "id_str": "1787895169829777416"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 17:00:00 +0000 2024",
        "full_text": "Rescue teams trying to find dozens of construction workers missing since a multi-story apartment complex collapsed in a coastal city in South Africa have made contact with 11 people buried alive beneath the mangled wreckage, authorities said.  https://t.co/UjFFB3AhEa",
        "id_str": "1787890137797480494"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 16:44:50 +0000 2024",
        "full_text": "BREAKING: TikTok sues to block U.S legislation that could lead to a ban of the popular social media app.   https://t.co/Jh8J6I4aKS",
        "id_str": "1787886320968253931"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 16:40:00 +0000 2024",
        "full_text": "A security guard for the rapper Drake was injured in a shooting outside Drake's Toronto home overnight, police said.  https://t.co/tUiYr5KkKP",
        "id_str": "1787885103307260399"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 16:20:00 +0000 2024",
        "full_text": "The Supreme Court is nearing the end of its term. Here are the major cases it still has to decide.  https://t.co/HAZlc5svhq",
        "id_str": "1787880071484653635"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 16:00:01 +0000 2024",
        "full_text": "An Australian woman accused of feeding poisonous mushrooms to several members of her ex-husband's family has pleaded not guilty to three murder charges and five attempted murder charges.  https://t.co/3zrpTkUAYk",
        "id_str": "1787875040874127749"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 15:57:51 +0000 2024",
        "full_text": "WATCH LIVE: President Biden addresses rise in antisemitism at Holocaust remembrance ceremony https://t.co/RChfnxT2Ir https://t.co/O2cxb6KCvE",
        "id_str": "1787874495341957589"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 15:45:00 +0000 2024",
        "full_text": "A new \"immersive visualization\" will allow users to experience the plunging into a black hole and falling beyond the \"point of no return\" within the phenomenon, the NASA said.  https://t.co/Nuk5UdTFY9",
        "id_str": "1787871260837302612"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 15:35:00 +0000 2024",
        "full_text": "Shayanna Jenkins, the fiancée of late New England Patriots tight end Aaron Hernandez, condemned jokes made at his expense during Tom Brady's roast.  https://t.co/6cl2HbQdi0",
        "id_str": "1787868744829587766"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 15:25:00 +0000 2024",
        "full_text": "Ukrainian counterintelligence investigators have foiled a Russian plot to assassinate President Volodymyr Zelenskyy and other top military and political figures, Ukraine's state security service said.  https://t.co/3HeNQO2ZjV",
        "id_str": "1787866228880499072"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 15:15:00 +0000 2024",
        "full_text": "His stepdad has been in his life since he was four years old. This is the emotional moment he asked him to officially become his dad and adopt him ❤️ https://t.co/a1iD2mVWuW",
        "id_str": "1787863713954898377"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 15:00:24 +0000 2024",
        "full_text": "President Biden is set to deliver the keynote address at the U.S. Holocaust Memorial Museum's Annual Day of Remembrance Celebration, where he's expected to condemn a rise in antisemitism in the wake of Hamas' Oct. 7 attack on Israel.  https://t.co/PQt4uZAWdD",
        "id_str": "1787860039711039997"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 14:36:23 +0000 2024",
        "full_text": "RT @CBSMornings: A familiar face was spotted at Monday night’s #MetGala — our very own @GayleKing.\n\nShe graced the red carpet, but she didn…",
        "id_str": "1787853992283828378"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 14:36:21 +0000 2024",
        "full_text": "RT @CBSMornings: In her music, Brittany Howard (@blkfootwhtfoot) holds nothing back — including on her new record, “What Now?”\n\nShe tells @…",
        "id_str": "1787853984675377631"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 14:36:18 +0000 2024",
        "full_text": "RT @CBSMornings: A group of communities around the U.S. is concerned about losing access to medical care, after Steward Health Care, one of…",
        "id_str": "1787853973686264234"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 14:36:14 +0000 2024",
        "full_text": "RT @CBSMornings: Stars were in full bloom at this year’s #MetGala.\n\n@etnow’s @RachelSmithTV breaks down fashion’s biggest night — including…",
        "id_str": "1787853957668233412"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 14:35:43 +0000 2024",
        "full_text": "BREAKING: Adult film star Stormy Daniels is called to testify in Donald Trump's New York criminal trial. https://t.co/DgHU5o4vIM",
        "id_str": "1787853824364830873"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 14:20:00 +0000 2024",
        "full_text": "Oprah Winfrey has selected \"Long Island\" by author Colm Tóibín as her newest book club pick. https://t.co/ugAAF6hUxy",
        "id_str": "1787849869463331284"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 14:05:02 +0000 2024",
        "full_text": "Stormy Daniels, who received $130,000 in 2016 in exchange for her silence about an alleged sexual encounter with former Pres. Donald Trump, expects to be called to the stand to testify Tuesday in Trump’s historic criminal trial, sources say. https://t.co/f0uJtqDvsq https://t.co/EAqkLe3Qpe",
        "id_str": "1787846103724933415"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 14:00:01 +0000 2024",
        "full_text": "Three surfers from Australia and the U.S. were killed in Mexico's Baja California. Here's what we know.  https://t.co/bzvhBnTVZ9",
        "id_str": "1787844841096765463"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 13:45:00 +0000 2024",
        "full_text": "Heineken is working on \"transforming tired pubs\" across the U.K. with a nearly $50 million investment meant to ease locals as the U.K. recovers from a 41-year inflation high. https://t.co/xAwD4d38ES",
        "id_str": "1787841063773692107"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 13:30:00 +0000 2024",
        "full_text": "The 2024 Met Gala saw hundreds of celebrities dressed in their best outfits for fashion's biggest night.  https://t.co/E7Y8wA88fw",
        "id_str": "1787837288233263374"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 13:24:22 +0000 2024",
        "full_text": "RT @CBSMornings: After years of delays, Boeing has delayed the scheduled launch of its Starliner spacecraft.\n\nIt was meant to make its firs…",
        "id_str": "1787835870625579314"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 13:24:08 +0000 2024",
        "full_text": "RT @CBSMornings: Former Pres. Donald Trump, arguing he should be able to speak out, has suggested he is ready to go to jail for repeatedly…",
        "id_str": "1787835812849008682"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 13:24:06 +0000 2024",
        "full_text": "RT @CBSMornings: OPRAH’S BOOK CLUB: Colm Tóibín’s “Long Island,” the sequel to “Brooklyn,” is the latest @oprahsbookclub pick.\n\n@Oprah and…",
        "id_str": "1787835804036854213"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 13:24:03 +0000 2024",
        "full_text": "RT @CBSMornings: In the last 24 hours, Israeli tanks rolled into eastern Rafah in Gaza’s south, seizing the Palestinian side of a key borde…",
        "id_str": "1787835790095004031"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 13:24:01 +0000 2024",
        "full_text": "RT @CBSMornings: There’s new concern about toxic chemicals coming from the seats inside cars. Most are treated with flame-retardant chemica…",
        "id_str": "1787835780225782215"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 13:16:22 +0000 2024",
        "full_text": "Ukrainian double European champion weightlifter Oleksandr Pielieshenko was killed in the war against Russia, the Ukrainian weightlifting federation announced Monday.  https://t.co/6w8y2v6E7L",
        "id_str": "1787833857426825325"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 13:00:46 +0000 2024",
        "full_text": "BREAKING: Stormy Daniels is expecting to take the stand today at Donald Trump's New York criminal trial, sources say.  https://t.co/CUX7GHHGep",
        "id_str": "1787829931767963912"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 13:00:00 +0000 2024",
        "full_text": "A 75-year-old man said he killed his hospitalized wife because he couldn't afford her care, court documents say. \n https://t.co/QZwxyCAJVR",
        "id_str": "1787829739794661440"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 12:30:00 +0000 2024",
        "full_text": "A U.S. citizen was sentenced to 10 days in detention in Russia for petty hooliganism, a Moscow court said Tuesday, after he stumbled drunkenly into a children’s library and passed out. There was no immediate confirmation of the arrest from U.S. authorities https://t.co/reoocn7TPv https://t.co/vhbHUqoJFN",
        "id_str": "1787822188004868441"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 12:16:40 +0000 2024",
        "full_text": "RT @RamyInocencio: Our latest on the Israel-Hamas war from Tel Aviv. Israel now warns Gazans in eastern Rafah to evacuate to the coast. Pos…",
        "id_str": "1787818834319056953"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 12:16:29 +0000 2024",
        "full_text": "RT @CBSMornings: Severe weather that brought destructive tornados to Oklahoma is now moving through the Midwest.\n\n@WeatherChannel’s @Stepha…",
        "id_str": "1787818786914980191"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 12:16:24 +0000 2024",
        "full_text": "RT @CBSMornings: At least one person was killed in Barnsdall, Oklahoma, as a relentless string of powerful tornados swept across the state,…",
        "id_str": "1787818767499559416"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 12:16:23 +0000 2024",
        "full_text": "RT @CBSMornings: U.S. Army Staff Sergeant Gordon Black is in jail in far eastern Russia, after being arrested on “charges of criminal misco…",
        "id_str": "1787818761338097905"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 12:11:03 +0000 2024",
        "full_text": "Kendrick Lamar and Drake beef explained https://t.co/Zn6bDCVqYG",
        "id_str": "1787817418296795144"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 12:00:00 +0000 2024",
        "full_text": "Police said more than two dozen people were arrested on Monday as pro-Palestinian protesters marched from Hunter College toward the Met Gala with chants of “shut it down.” https://t.co/q1f1faNbvU",
        "id_str": "1787814637334847615"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 11:52:04 +0000 2024",
        "full_text": "Coming up on CBS News: \n\n🚀First crewed launch of Boeing Starliner capsule scrubbed after company finds issue with oxygen relief valve\n\n🌪️Tornado wreaks havoc in Oklahoma town\n\n🌼Stars blossom in florals at 2024 Met Gala https://t.co/sypc2Hz77O",
        "id_str": "1787812643484438580"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 11:30:00 +0000 2024",
        "full_text": "Human skeletons were found at Hitler's former headquarters in Poland — but the cause of death remains a mystery. https://t.co/5j5WPzG0O9",
        "id_str": "1787807088615235735"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 11:00:00 +0000 2024",
        "full_text": "Donald Trump's criminal trial resumes Tuesday, the day after jurors were given a deep look at accounting inside the former president's company and the judge warned Trump he's at risk of being jailed.  https://t.co/UJxv2alMci",
        "id_str": "1787799540864581985"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 10:40:01 +0000 2024",
        "full_text": "A tornado roared through a small northeast Oklahoma city, destroying homes and toppling trees and power lines. https://t.co/RJyPPNxOVq",
        "id_str": "1787794508207321116"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 10:21:36 +0000 2024",
        "full_text": "An Israeli tank brigade has taken control of the Gaza Strip side of the Rafah border crossing with Egypt, authorities said, taking what may be the first step in an offensive in the city even as cease-fire negotiations with Hamas remain at a critical stage. https://t.co/19QArDZidV",
        "id_str": "1787789874851881257"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 10:00:00 +0000 2024",
        "full_text": "Social Security projected to cut benefits in 2035 barring a fix https://t.co/bxLXgJ8XQs",
        "id_str": "1787784440132853941"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 09:00:01 +0000 2024",
        "full_text": "An Atlas 5 rocket carrying astronauts for the first time was fueled for blastoff - but trouble with a valve in the rocket's upper stage forced mission managers to order a scrub just two hours before launch. https://t.co/GV9ZAHDwNo https://t.co/6GBKdK9mhQ",
        "id_str": "1787769342802670039"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 08:00:00 +0000 2024",
        "full_text": "What will happen to home prices if mortgage rates stay high? Experts weigh in https://t.co/yJPQJndITc",
        "id_str": "1787754240372342998"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 07:00:00 +0000 2024",
        "full_text": "Two high school seniors in New Orleans proved a mathematical puzzle that was thought to be impossible for 2,000 years. https://t.co/kVOpMkJTfc https://t.co/4CoUaJsJZx",
        "id_str": "1787739141939114372"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 06:00:00 +0000 2024",
        "full_text": "White-coated candy recalled nationwide over salmonella risk https://t.co/jmBrNokQcG",
        "id_str": "1787724041148629444"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 05:00:00 +0000 2024",
        "full_text": "The Metropolitan Museum of Art's fundraiser is reserved for the biggest names in fashion, film and art - Florals took centerstage on the green carpet as the stars arrived. https://t.co/vSIOotI3Ec https://t.co/crVcp7wd8M",
        "id_str": "1787708944183394490"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 04:00:00 +0000 2024",
        "full_text": "Tornadoes spotted in Oklahoma as dangerous storms move across Great Plains https://t.co/1BT3WLYI5h",
        "id_str": "1787693842688279031"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 03:35:00 +0000 2024",
        "full_text": "More than 70 years after an American teenager vanished while fighting in the Korean War, modern forensics finally allowed the military to identify his remains. https://t.co/C8oUhpyKUL",
        "id_str": "1787687551429431371"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 03:05:00 +0000 2024",
        "full_text": "Senator Bernie Sanders said he'll be seek reelection in November. https://t.co/GLwg9c8XRj",
        "id_str": "1787680000642015645"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 02:35:00 +0000 2024",
        "full_text": "Madonna's biggest concert brings estimated 1.6 million to Rio's Copacabana beach. https://t.co/RlcyEsfSeo",
        "id_str": "1787672453562392825"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 01:48:55 +0000 2024",
        "full_text": "Equinox introduced a membership that, for a hefty $36,000 a year, includes more than 100 tests aimed at enhancing health and extending people's longevity. https://t.co/zt3B69Xq02",
        "id_str": "1787660852788703470"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 01:20:00 +0000 2024",
        "full_text": "How to protect yourself from skin cancer after survey finds increased number of people at risk. https://t.co/eZDPf35BA4",
        "id_str": "1787653578313666569"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 01:05:52 +0000 2024",
        "full_text": "In 1942, 85-year-old Holocaust survivor Chana Broder and her parents escaped from a ghetto in Poland and spent almost two years hiding in a farmer's underground bunker. She remembers hiding in the darkness and learning not to cry to avoid being found and deported by the Nazis. https://t.co/bPy7lNCo6I",
        "id_str": "1787650020881183192"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 01:00:00 +0000 2024",
        "full_text": "How two high school students solved a 2,000-year-old math puzzle. https://t.co/aD1GydncJE",
        "id_str": "1787648546235097446"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 00:55:36 +0000 2024",
        "full_text": "UPDATE: Boeing calls off its planned launch of the Starliner spacecraft less than two hours before liftoff. https://t.co/l4Zxk9OOGx",
        "id_str": "1787647436866863265"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 00:40:00 +0000 2024",
        "full_text": "Teens come up with trigonometry proof for Pythagorean Theorem, a problem that stumped math world for centuries.\n https://t.co/QStKxoVuTB",
        "id_str": "1787643509974999491"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 00:33:28 +0000 2024",
        "full_text": "The 2024 Met Gala dress code is \"The Garden of Time\" and the stars brought their best and boldest outfits. https://t.co/oK3gjrdHi1 https://t.co/ejmTM6z2OZ",
        "id_str": "1787641864973123613"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 00:20:00 +0000 2024",
        "full_text": "A boy gave his only dollar to someone he mistook as homeless. In exchange, the businessman rewarded him for his generosity. https://t.co/bDj4vTWGu7",
        "id_str": "1787638478651507105"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue May 07 00:00:00 +0000 2024",
        "full_text": "Ingenuity, NASA's \"little 'copter that could\" (and did!) https://t.co/rKlvMl96Fp",
        "id_str": "1787633446468157612"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:42:44 +0000 2024",
        "full_text": "A range of white confectionary candy sold nationwide is being recalled because the treats could be contaminated with salmonella. https://t.co/7yqJV692mt",
        "id_str": "1787629099961213134"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:40:00 +0000 2024",
        "full_text": "Drive-thru food pantry in Southern California food desert provides consistent source of groceries for thousands: \"It's a labor of love\" https://t.co/b6KPDcmgSb",
        "id_str": "1787628411524977078"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:29:23 +0000 2024",
        "full_text": "RT @CBSEveningNews: As Mother's Day nears, meet these five daughters who have each chosen to follow in their mothers' footsteps by becoming…",
        "id_str": "1787625738029470188"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:24:04 +0000 2024",
        "full_text": "RT @CBSEveningNews: Churchgoers in Pennsylvania tackled a 26-year-old man who allegedly attempted to shoot a pastor mid-service, but his gu…",
        "id_str": "1787624401271218604"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:23:59 +0000 2024",
        "full_text": "RT @CBSEveningNews: At least three people were killed and more than 500 others rescued from catastrophic flooding across the state of Texas…",
        "id_str": "1787624382665261114"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:20:01 +0000 2024",
        "full_text": "Man stopped at Miami International Airport with snakes in his pants. https://t.co/EN7bd63XJ5",
        "id_str": "1787623380503380219"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:16:59 +0000 2024",
        "full_text": "RT @CBSEveningNews: An Atlas 5 rocket carrying astronauts for the first time was primed for blastoff Monday night to boost Boeing's long-de…",
        "id_str": "1787622621057536159"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:16:55 +0000 2024",
        "full_text": "RT @CBSEveningNews: Hamas says it agreed to a proposal for a cease-fire plan, but in response, Israeli Prime Minister Benjamin Netanyahu's…",
        "id_str": "1787622601289797865"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:09:40 +0000 2024",
        "full_text": "RT @CBSEveningNews: An American soldier has been arrested in Russia — accused of stealing from a woman. Officials say Staff Sgt. Gordon D.…",
        "id_str": "1787620776998232226"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:04:46 +0000 2024",
        "full_text": "RT @CBSEveningNews: Steward Health Care's bankruptcy filing on Monday sparks concerns in certain communities over the potential loss of med…",
        "id_str": "1787619544334307778"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:02:41 +0000 2024",
        "full_text": "RT @CBSEveningNews: The judge presiding over Donald Trump’s criminal trial in New York has found the former president in contempt of court…",
        "id_str": "1787619018569912458"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:01:40 +0000 2024",
        "full_text": "RT @CBSEveningNews: Columbia University in New York City has called off its primary graduation ceremony following weeks of ongoing protests…",
        "id_str": "1787618763136725359"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 23:00:00 +0000 2024",
        "full_text": "29 iconic Met Gala looks from the best-dressed guests since 1973. https://t.co/owWEE1YxTA",
        "id_str": "1787618344889176133"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 22:56:00 +0000 2024",
        "full_text": "RT @CBSEveningNews: Millions of people across Oklahoma and Kansas are bracing for high-risk weather conditions including violent thundersto…",
        "id_str": "1787617339191575006"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 22:40:00 +0000 2024",
        "full_text": "All the past Met Gala themes over the years up to 2024. https://t.co/w9FmA4EvEE",
        "id_str": "1787613313569787985"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 22:26:36 +0000 2024",
        "full_text": "Vice President Kamala Harris is visiting two battleground states this week that will be crucial to President Biden's reelection effort this year, @NidiaCavazosTV reports: https://t.co/eHlKiE3vcr",
        "id_str": "1787609938438639834"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 22:21:00 +0000 2024",
        "full_text": "How do Columbia University's student protests over the war in Gaza compare to the school's demonstrations against the Vietnam War in 1968?\n\nHistorian Rick Perlstein looks at what we can learn from the events 56 years ago. https://t.co/xFTXIl4CEr",
        "id_str": "1787608530595225687"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 22:20:00 +0000 2024",
        "full_text": "Without a major change, Social Security may be forced to cut benefits in 2035, a year later than previously forecast. https://t.co/iSTA51ujR2",
        "id_str": "1787608278110789794"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 22:15:54 +0000 2024",
        "full_text": "CBS News polling finds key battleground states are essentially even between Pres. Biden and Donald Trump, as many voters are locked in to their 2020 picks. Which voters may change their minds — if any?\n@SalvantoCBS breaks down why the race could come down to a small set of… https://t.co/2fkkLoFgUv",
        "id_str": "1787607246492291241"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 22:13:23 +0000 2024",
        "full_text": "GOP Rep. @TomColeOK04 says it's not likely that Speaker Mike Johnson will be ousted by Rep. Marjorie Taylor Greene's motion to vacate, believing that all Democrats would not join eight Republicans in supporting it: \"The Democrats have clearly signaled they don't want to plunge… https://t.co/LTtYKofKG9",
        "id_str": "1787606612712001848"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 22:12:25 +0000 2024",
        "full_text": "The judge in Donald Trump's New York criminal case is threatening the former president with jail time after finding him in contempt of court again for violating his gag order. But what would that even look like with Secret Service protection?\n\n\"No state or federal prison system… https://t.co/kgmYNw9Eu0",
        "id_str": "1787606370277040597"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 22:02:46 +0000 2024",
        "full_text": "College endowments, usually a sleepy part of a university's operations, are now front and center at the campus protests that are spreading across the nation. But divestment often is neither a simple nor a quick process. https://t.co/O57SifGCX9",
        "id_str": "1787603941909242273"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 22:00:04 +0000 2024",
        "full_text": "WATCH LIVE: The Daily Report with John Dickerson spotlights reporting and interviews on the day's events https://t.co/0MGCIhM13t https://t.co/bpP1YgCXOH",
        "id_str": "1787603263543537783"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 21:44:15 +0000 2024",
        "full_text": "Tensions are growing as Israel says it will continue its operation in Rafah to pressure Hamas into releasing hostages, while Hamas says it will accept a cease-fire deal proposal.\n\n@edokeefe reports on what the two sides are saying, as the White House had a day of diplomacy: https://t.co/0LJ5AME7qe",
        "id_str": "1787599281148309747"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 21:19:32 +0000 2024",
        "full_text": "Luxury fitness chain Equinox is putting a price on the ultimate luxury: longer life. \n\nThe company on Monday introduced a membership that, for a hefty $36,000 a year, includes more than 100 tests aimed at enhancing health and extending people's longevity. https://t.co/rQLXLmkm8V",
        "id_str": "1787593060152390011"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 21:01:04 +0000 2024",
        "full_text": "WATCH LIVE: \"America Decides\" has the latest political news, analysis and original reporting. https://t.co/dxwBD9Kvo0",
        "id_str": "1787588415195656657"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 20:45:13 +0000 2024",
        "full_text": "On \"Face The Nation,\" South Dakota Gov. Kristi Noem, who has been facing criticism ever since she revealed in her new book that she once shot and killed her own dog, suggested that President Biden's dog Commander should meet the same fate. https://t.co/MMhT1vEL7K https://t.co/96lR9bGpuS",
        "id_str": "1787584424642490766"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 20:41:06 +0000 2024",
        "full_text": "More than 70 years after an American teenager vanished while fighting overseas in the Korean War, modern forensics finally allowed the United States military to identify his remains. https://t.co/7985flkA9D",
        "id_str": "1787583388678799534"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 20:11:07 +0000 2024",
        "full_text": "Noelia Voigt, who was crowned Miss USA in 2023, unexpectedly stepped down on Monday and posted a message to social media urging people to prioritize their mental health. https://t.co/gcsTrzLbui",
        "id_str": "1787575843570516021"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 19:52:19 +0000 2024",
        "full_text": "U.S. Army Staff Sgt. Gordon D. Black, who was stationed in Korea, has been detained in Russia and accused of stealing from a woman, two Pentagon officials said Monday.\n\nCBS News' David Martin reports that Black was arrested on May 2 in Vladivostock. It is unclear how he got there… https://t.co/RcXhFhioBY",
        "id_str": "1787571111128920158"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 19:51:09 +0000 2024",
        "full_text": "Rep. Troy Nehls (R-TX) on Monday posted photographs of documents which appear to show two separate Bronze Star medal citations, saying it was proof that Defense Department records showing he received only one Bronze Star medal from his time in the U.S. Army is incorrect.…",
        "id_str": "1787570818802651455"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 19:22:23 +0000 2024",
        "full_text": "BREAKING: Russia has detained a U.S. soldier, an official confirmed Monday. https://t.co/pQEJEVE00D",
        "id_str": "1787563581287825422"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 19:21:31 +0000 2024",
        "full_text": "Hamas says that it approves of a cease-fire proposal presented by Egypt and Qatar, according to a statement on a Palestinian news site. https://t.co/1PrUEeTBcM",
        "id_str": "1787563360608833953"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 18:55:00 +0000 2024",
        "full_text": "Calcea Johnson and Ne'Kiya Jackson surprised the math world when, as seniors in high school, they produced innovative solutions to a 2,000-year-old puzzle.\n https://t.co/ZcxViRE0YQ",
        "id_str": "1787556690935574677"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 18:35:00 +0000 2024",
        "full_text": "Skin cancer is one of the most preventable types of cancer, yet it remains one of the most common — and a recent survey finds not enough people are taking the right precautions, raising their risk.  https://t.co/Y81xmotz8m",
        "id_str": "1787551655036174554"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 18:14:37 +0000 2024",
        "full_text": "A Starbucks barista in Little Rock, Arkansas, had a memorable shift last month thanks to her cheerful demeanor and the kindness of a customer. https://t.co/JqZSpOVXiZ",
        "id_str": "1787546527700803751"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 17:45:00 +0000 2024",
        "full_text": "An Atlas 5 rocket carrying astronauts was primed for blastoff Monday night to boost Boeing's long-delayed Starliner crew ferry ship into orbit for its first piloted test flight to the International Space Station. \n https://t.co/kTQXWy3xl7",
        "id_str": "1787539072308724007"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 17:30:00 +0000 2024",
        "full_text": "South Dakota Gov. Kristi Noem on Monday defended controversial passages in her forthcoming book as she faces scrutiny over a number of anecdotes, including a false claim about a meeting with Kim Jong Un.  https://t.co/GybQCkomNc",
        "id_str": "1787535296675918182"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 17:00:02 +0000 2024",
        "full_text": "A bear is believed to have dragged the body of a western Massachusetts crash victim out of his car, state police say.  https://t.co/UI5PDqWEbR",
        "id_str": "1787527755006963796"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 16:45:07 +0000 2024",
        "full_text": "Zakia Wardak, Afghanistan's top diplomat in India, announced her resignation after reportedly being stopped at an airport with the gold cache.\n https://t.co/F2aDUzXDtJ",
        "id_str": "1787524002677772573"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 16:30:00 +0000 2024",
        "full_text": "Kendrick Lamar and Drake have each released several ruthless diss tracks against each other over the past week, taking jabs at height and style and making allegations about each others' children and other disturbing accusations.  https://t.co/eLCUnrnXFW",
        "id_str": "1787520200176263563"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 16:24:09 +0000 2024",
        "full_text": "RT @LindseyReiser: I'm thrilled to be joining the @CBSNews team and can't wait to get started! Stream CBS News 24/7 on the home page or the…",
        "id_str": "1787518725547086238"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 16:23:18 +0000 2024",
        "full_text": "RT @CBSNewsPress: Just Announced: CBS News And Stations Welcomes Lindsey Reiser as Anchor and Correspondent for CBS News 24/7. More here: h…",
        "id_str": "1787518513881534498"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 16:23:04 +0000 2024",
        "full_text": "RT @CBSEveningNews: Here's a look at what's coming up on the CBS Evening News with @NorahODonnell at 6:30 p.m. ET. https://t.co/ttWYKegwpt",
        "id_str": "1787518451784864132"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 16:15:00 +0000 2024",
        "full_text": "The judge overseeing Donald Trump's criminal trial in New York held him in contempt of court for violating a gag order for the 10th time, warning that future infractions could bring jail time.  https://t.co/Db55RQmEwy",
        "id_str": "1787516424396628119"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 16:05:00 +0000 2024",
        "full_text": "Man sitting on side of Oklahoma interstate confesses to woman's cold case murder, police say https://t.co/QYmCp1evsQ",
        "id_str": "1787513908401516735"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 16:00:03 +0000 2024",
        "full_text": "The Condé Nast union said it has reached a tentative labor agreement with the publisher's management just hours ahead of the Met Gala.\n https://t.co/OMbBKIssz3",
        "id_str": "1787512659673223380"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 15:50:00 +0000 2024",
        "full_text": "Hormel Foods is recalling two Planters products — peanuts and mixed nuts — shipped to Dollar Tree and Publix warehouses in five states because they may be tainted with listeria.  https://t.co/j6Wo3xmvqG",
        "id_str": "1787510132714197111"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 15:40:00 +0000 2024",
        "full_text": "South Dakota Gov. Kristi Noem, facing criticism for a story in her new book about killing her dog, suggested that President Biden should do the same with his former dog, Commander. \n https://t.co/Dl0nRB6xqW",
        "id_str": "1787507617482301934"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 15:35:45 +0000 2024",
        "full_text": "Sen. Bernie Sanders says he will seek reelection in November. \n https://t.co/DEgYf3Pd22",
        "id_str": "1787506547758690600"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 15:25:00 +0000 2024",
        "full_text": "Russia said it plans to hold drills simulating the use of battlefield nuclear weapons, amid rising tension following comments by senior Western officials about the possibility of deeper involvement in the war in Ukraine.  https://t.co/Pgm5Vh2NbA",
        "id_str": "1787503839936966933"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 15:09:45 +0000 2024",
        "full_text": "A newborn giraffe named Tino gallops just days after being born at the Houston Zoo. Zookeepers knew his mom was pregnant, but didn't know her due date – until she gave birth to 160-pound 6-foot-tall Tino ❤️ https://t.co/8mavjxXXNx",
        "id_str": "1787500001318387917"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 15:05:02 +0000 2024",
        "full_text": "The 2024 Met Gala theme is \"The Garden of Time\" — to go along with the spring exhibition, titled \"Sleeping Beauties: Reawakening Fashion.\" These are the past themes leading up to today's gala.\nhttps://t.co/hHq5CncwWh https://t.co/CjmPs2wSrS",
        "id_str": "1787498816616247599"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 14:51:14 +0000 2024",
        "full_text": "RT @DavidBegnaud: Here’s the debut of ‘Dear David’. It’s a new segment we created based on story ideas sent by viewers, like you. Enjoy our…",
        "id_str": "1787495344021831855"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 14:45:44 +0000 2024",
        "full_text": "Here's what happens inside the Met Gala after the red carpet   https://t.co/569DSPDbw2",
        "id_str": "1787493958932648105"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 14:40:32 +0000 2024",
        "full_text": "RT @CBSMornings: “I’m firstly fighting for trying to get back to winning a championship”: @LewisHamilton says he’s ready for a comeback wit…",
        "id_str": "1787492650553127420"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 14:40:30 +0000 2024",
        "full_text": "RT @CBSMornings: Some excerpts from @GovKristiNoem’s book, “No Going Back,” have drawn criticism, including one in which she describes shoo…",
        "id_str": "1787492642944631156"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 14:40:08 +0000 2024",
        "full_text": "RT @CBSMornings: This Arkansas barista was finally able to buy an urn for her mom’s remains — thanks to a gift from a stranger: “The $200 y…",
        "id_str": "1787492551345197226"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 14:40:06 +0000 2024",
        "full_text": "RT @CBSMornings: Tom Selleck writes about his six decades in Hollywood, including why it took him a year to accept a starring role in “Magn…",
        "id_str": "1787492541270487368"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 14:40:03 +0000 2024",
        "full_text": "RT @CBSMornings: The season 6 finale of @TheNeighborhood airs tonight on @CBS and @paramountplus— and @CedEntertainer reveals the episode’s…",
        "id_str": "1787492530663104637"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 14:18:48 +0000 2024",
        "full_text": "Decades ago, peregrine falcons were largely absent from California and much of the U.S. amid widespread use of pesticides. But now, a pair of the fastest birds in the world are nesting on Alcatraz Island. https://t.co/13wO9xHsqH",
        "id_str": "1787487182178943142"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 13:48:27 +0000 2024",
        "full_text": "Judge Juan Merchan imposed another $1,000 fine for another violation of Donald Trump's gag order, which limits what Trump can say about witnesses and others involved in the case. Merchan said he could impose stiffer penalties in the future. https://t.co/IwRKveBfZl",
        "id_str": "1787479544779202602"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 13:45:00 +0000 2024",
        "full_text": "Columbia University said it is canceling its main commencement ceremony after weeks of protests and turmoil on campus.   https://t.co/ebKxEinC42",
        "id_str": "1787478676574970274"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 13:40:12 +0000 2024",
        "full_text": "Dashcam video captured a powerful tornado with 158 mph winds ripping apart a building in Lincoln, Nebraska last month during a deadly, multi-state outbreak of severe storms. https://t.co/CNrQehaS3H",
        "id_str": "1787477465801031757"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 13:35:00 +0000 2024",
        "full_text": "The fourth week of Donald Trump's criminal trial in New York begins today as prosecutors look to build on emotional testimony from an ex-aide to the former president.  https://t.co/x6hS3Z2ayW",
        "id_str": "1787476156960137563"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 13:34:47 +0000 2024",
        "full_text": "RT @CBSMornings: Former Trump aide Hope Hicks had emotional testimony as a witness at the former president’s criminal trial.\n\nFor prosecuto…",
        "id_str": "1787476105437266256"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 13:34:45 +0000 2024",
        "full_text": "RT @CBSMornings: Three surfers, an American and two Australian brothers, were found dead in Baja California, Mexico on Friday.\n\nThree suspe…",
        "id_str": "1787476093697442107"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 13:20:00 +0000 2024",
        "full_text": "Steward Health Care, the struggling hospital group that owns nine hospitals in Massachusetts, announced Monday that it is filing for bankruptcy.  https://t.co/LDO1HwAZn7",
        "id_str": "1787472385014153450"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 13:01:46 +0000 2024",
        "full_text": "Brazil floods death toll nears 90 as rescue efforts continue amid skyscrapers of Porto Alegre.  https://t.co/kq0FyaX7ia",
        "id_str": "1787467794096750592"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 13:00:00 +0000 2024",
        "full_text": "Police are searching for an abducted 10-month-old girl whose mother was one of two women found dead at a park near Clovis, New Mexico. Authorities said a 5-year-old girl was also found critically injured. https://t.co/muIIIeh7rb",
        "id_str": "1787467349404041492"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 12:54:28 +0000 2024",
        "full_text": "RT @CBSMornings: Israel has issued a warning to many of the more than 1 million Palestinians sheltering in Rafah in Gaza’s south to get out…",
        "id_str": "1787465959655022626"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 12:54:26 +0000 2024",
        "full_text": "RT @CBSMornings: After years of delays, Boeing is ready to launch its new Starliner spaceship with a crew for the first time.\n\nThe aerospac…",
        "id_str": "1787465951211868604"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 12:54:24 +0000 2024",
        "full_text": "RT @CBSMornings: Police cleared an encampment at the University of Southern California over the weekend, where people protesting against th…",
        "id_str": "1787465940247925045"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 12:54:22 +0000 2024",
        "full_text": "RT @CBSMornings: As parts of Texas deal with dangerous flooding, the state could see a tornado outbreak today, winds over 70 mph and baseba…",
        "id_str": "1787465932614320136"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 12:54:19 +0000 2024",
        "full_text": "RT @CBSMornings: Hundreds of people had to be rescued across southeast Texas over the weekend, after nearly two feet of torrential rain fel…",
        "id_str": "1787465919351959614"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 12:30:00 +0000 2024",
        "full_text": "How much does a Met Gala ticket cost? Here's a look at the price of entry for fashion's biggest night. https://t.co/SOaXAFb37h",
        "id_str": "1787459801946931357"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 12:00:00 +0000 2024",
        "full_text": "A person fell from the stands to their death Sunday during the graduation ceremony for Ohio State University.  https://t.co/qPjqIBuGq5",
        "id_str": "1787452249620271491"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 11:34:42 +0000 2024",
        "full_text": "Here are the climate stories to start your week: \n\n🛢️Bombshell report reveals how major oil companies misled the public about their role in causing the climate crisis \n\n🏭G7 countries agree to phase out coal power plants by 2035\n\n🎬New study finds that movies aren’t interested in… https://t.co/eozUhlIKge",
        "id_str": "1787445882071183538"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 11:30:00 +0000 2024",
        "full_text": "The fourth week of Donald Trump's criminal trial in New York begins Monday as prosecutors look to build on emotional testimony from an ex-aide to the former president.  https://t.co/bgvWeMiFs4",
        "id_str": "1787444702117040233"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 11:15:00 +0000 2024",
        "full_text": "Israel’s military ordered Palestinians in the eastern part of the Gaza Strip city of Rafah to evacuate Monday ahead of a ground offensive that’s expected to come despite last-ditch efforts led by the U.S., Qatar and Egypt to broker a new cease-fire deal. https://t.co/V9UFsbMoRT",
        "id_str": "1787440927960629690"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 11:14:32 +0000 2024",
        "full_text": "Coming up on CBS News: \n\n🔘Bodies found of three surfers who went missing in Mexico\n\n🚀Boeing to launch first crewed mission to International Space Station\n\n✨The stars will line the red carpet at the Met Gala tonight in NYC https://t.co/SLvfSi5BGl",
        "id_str": "1787440807588286592"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 11:00:00 +0000 2024",
        "full_text": "Tom Brady got roasted by comedians, former teammates and his longtime coach Sunday night during a made-for-streaming comedy live event on Netflix. \n\n\"This is what a locker room has been like for me for all these years,\" Brady said before the event. https://t.co/CNngWz2zdM",
        "id_str": "1787437151665230073"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 10:30:00 +0000 2024",
        "full_text": "A church service in North Braddock, Pennsylvania was upended Sunday when a man pulled a gun on the pastor in the middle of his sermon.  https://t.co/fgm4cgCQwh",
        "id_str": "1787429603570520152"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 10:00:00 +0000 2024",
        "full_text": "Gov. Kristi Noem says \"I want the truth to be out there\" after viral stories of killing her dog, false Kim Jong Un claim https://t.co/eELthU9pFy",
        "id_str": "1787422052418256979"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 09:00:00 +0000 2024",
        "full_text": "Boeing's Starliner capsule is finally poised for its first piloted launch Monday, a critical test flight carrying two veteran astronauts to the International Space Station. https://t.co/GI3wcuV4Ki https://t.co/UiuwnS4bmL",
        "id_str": "1787406951447429329"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 08:00:02 +0000 2024",
        "full_text": "Bodies of missing surfers from Australia, U.S. found with bullet wounds, Mexican officials say https://t.co/1tAfMLR32e",
        "id_str": "1787391859213410371"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 07:00:00 +0000 2024",
        "full_text": "The last Neanderthals mysteriously died out around 40,000 years ago, just a few thousand years after humans arrived. The latest discovery is thought to be the best preserved Neanderthal find this century. https://t.co/tkf440uDxg https://t.co/UuICrsN7w7",
        "id_str": "1787376752861266060"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 06:00:01 +0000 2024",
        "full_text": "Massachusetts detective's affair exposed during investigation into his wife's shooting death https://t.co/CHkLwFuvo0",
        "id_str": "1787361656697160178"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 05:00:01 +0000 2024",
        "full_text": "Two high school seniors in New Orleans proved a mathematical puzzle that was thought to be impossible for 2,000 years. https://t.co/kVOpMkJTfc https://t.co/6yAzs9RQ8e",
        "id_str": "1787346556556861769"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 04:00:00 +0000 2024",
        "full_text": "House Minority Leader Hakeem Jeffries says Democrats \"effectively have been governing as if we were in the majority\" https://t.co/QCwWW7d1GW",
        "id_str": "1787331456831824002"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 03:02:51 +0000 2024",
        "full_text": "A boy gave his only dollar to someone he mistook as homeless. In exchange, the businessman rewarded him for his generosity. https://t.co/MTkV80JLLC",
        "id_str": "1787317074429190367"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 02:35:00 +0000 2024",
        "full_text": "More than a decade after a stroke, Randy Travis is singing again, courtesy of AI. https://t.co/76kBx7Pb7u",
        "id_str": "1787310062605680937"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 02:31:00 +0000 2024",
        "full_text": "RT @CBSNewsPress: ICYMI from @CBSNews:\n\n🔹@NorahODonnell’s @60Minutes interview with House Minority Leader Hakeem Jeffries\n\n🔹 @MargBrennan’s…",
        "id_str": "1787309057667191243"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 02:05:00 +0000 2024",
        "full_text": "Bernard Hill's career began in 1974, but he was perhaps best known for playing Captain Smith in \"Titanic.\" https://t.co/2YrVGsNhxp https://t.co/eheXnkVMKW",
        "id_str": "1787302515341414655"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 01:49:23 +0000 2024",
        "full_text": "RT @CBSEveningNews: High school senior David Kozyrkov fled the war in Ukraine to come to Philadelphia – in the fall, he’s heading to the Be…",
        "id_str": "1787298584540348638"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 01:49:20 +0000 2024",
        "full_text": "RT @CBSEveningNews: Actor Bernard Hill, who played memorable roles in “Titanic” and the “Lord of the Rings” series, has died. He was 79. ht…",
        "id_str": "1787298571357770136"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 01:49:17 +0000 2024",
        "full_text": "RT @CBSEveningNews: An Atlas Five rocket rolled out to its launch pad this weekend, ahead of carrying Boeing’s Starliner spacecraft into sp…",
        "id_str": "1787298559315866080"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 01:49:14 +0000 2024",
        "full_text": "RT @CBSEveningNews: While Democrats are rallying behind President Biden’s response to the pro-Palestinian student protests, former presiden…",
        "id_str": "1787298547915735178"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 01:49:11 +0000 2024",
        "full_text": "RT @CBSEveningNews: As cease-fire talks appeared to sizzle, Hamas militants attacked Israel’s Kerem Shalom crossing, disrupting aid shipmen…",
        "id_str": "1787298533265043709"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 01:49:08 +0000 2024",
        "full_text": "RT @CBSEveningNews: Police in riot gear cleared a pro-Palestinian encampment at the University of Southern California Sunday morning. Tensi…",
        "id_str": "1787298521428680944"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 01:49:06 +0000 2024",
        "full_text": "RT @CBSEveningNews: Thunderstorms swamped Texas this weekend, leading to hundreds of evacuations and rescues. https://t.co/Yusj2gI8Vw",
        "id_str": "1787298511039443444"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 01:40:00 +0000 2024",
        "full_text": "House Democratic Leader Hakeem Jeffries said the US must continue supporting Ukraine to prevent a broader war, and he blamed the delay in aid on a \"pro-Putin faction\" within the Republican Party.  https://t.co/4l9WxXXcEO",
        "id_str": "1787296224183304439"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 01:35:00 +0000 2024",
        "full_text": "Officials at Miami International Airport say a man was trying to board a flight with snakes in his pants. https://t.co/8NQ5mzehmZ",
        "id_str": "1787294964352762089"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 01:20:00 +0000 2024",
        "full_text": "Here's how two high school students solved a 2,000-year-old math puzzle. https://t.co/OZdswCMnje",
        "id_str": "1787291189160407186"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 01:05:00 +0000 2024",
        "full_text": "Madonna put on a free concert in Brazil that drew 1.6 million people. https://t.co/FAJtpOuxlS",
        "id_str": "1787287413317873726"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 00:57:41 +0000 2024",
        "full_text": "House Minority Leader Hakeem Jeffries says Democrats \"effectively have been governing as if we were in the majority\" https://t.co/e71SgHnmrh",
        "id_str": "1787285573087997979"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 00:20:00 +0000 2024",
        "full_text": "Three bodies located in Mexico near where three surfers — two Australians and an American — went missing last weekend were found with gunshot wounds, prosecutors said. https://t.co/Q5TY1JceBG",
        "id_str": "1787276091201147259"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 00:05:00 +0000 2024",
        "full_text": "Years behind schedule and more than a billion dollars over budget, Boeing's Starliner spacecraft is finally poised for its first piloted launch Monday. https://t.co/L7e7R2RlGR",
        "id_str": "1787272315706777669"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 00:02:07 +0000 2024",
        "full_text": "RT @60Minutes: “The horrific events of 10/7 – a brutal terrorist attack by Hamas” put Israel “in a position where of course it had to respo…",
        "id_str": "1787271591069393354"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 00:01:46 +0000 2024",
        "full_text": "RT @60Minutes: Calcea Johnson and Ne’Kiya Jackson explain their groundbreaking work to 60 Minutes. \n\n“You've been beyond me since the begin…",
        "id_str": "1787271500854153510"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 00:01:42 +0000 2024",
        "full_text": "RT @60Minutes: Employees react to the news that they are now part owners in their company. https://t.co/0VOy3yIbYG https://t.co/pvqcWAJYN4",
        "id_str": "1787271485783941513"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon May 06 00:01:36 +0000 2024",
        "full_text": "RT @60Minutes: “If Roe v. Wade can fall, anything can fall. Social Security can fall. Medicare can fall. Voting rights can fall. And God he…",
        "id_str": "1787271458172916065"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 23:56:34 +0000 2024",
        "full_text": "RT @60Minutes: When the business sold, the employee-owners received big payouts. Brad and Crystal Edwards said the money was life changing.…",
        "id_str": "1787270191061115187"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 23:35:00 +0000 2024",
        "full_text": "Australian police shot and killed a 16-year-old boy armed with a knife after he stabbed a man in an attack that had the \"hallmarks\" of terror, officials said. https://t.co/D2nFVNG0uX",
        "id_str": "1787264764298613065"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 23:05:00 +0000 2024",
        "full_text": "A storm chaser saved a Texas family of 4 after a tornado destroyed their home. https://t.co/hGTixk0d1s",
        "id_str": "1787257217202176442"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 22:44:54 +0000 2024",
        "full_text": "Black men in Georgia were crucial to Biden's 2020 victory. Can he keep the momentum in 2024? https://t.co/4j2OYZaGZ4",
        "id_str": "1787252156929658931"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 22:35:00 +0000 2024",
        "full_text": "After a series of busts of poachers fishing for out-of-season striped bass in New York, the state's Department of Environmental Conservation has changed fishing regulations for the species. https://t.co/D5LE0Gv9Wq",
        "id_str": "1787249665684963401"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 22:05:01 +0000 2024",
        "full_text": "Archaeologists working in England found a \"mysterious lump\" of a purple substance that in Roman times would have been worth more than gold. https://t.co/jpc3BOr0ts",
        "id_str": "1787242118727016541"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 21:35:00 +0000 2024",
        "full_text": "Walgreens is limiting Gummy Mango candy sales to one bag per customer after they went viral on TikTok. https://t.co/KPIrXwFXA1",
        "id_str": "1787234568019288212"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 21:31:31 +0000 2024",
        "full_text": "The Trump campaign told donors at a private GOP retreat in Palm Beach, Florida, that $76 million was raised in April. https://t.co/3VOrwUZDro",
        "id_str": "1787233690013085958"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 21:15:00 +0000 2024",
        "full_text": "Get ready for one of the best meteor showers of the year: the Eta Aquariids will peak overnight on Sunday into Monday. https://t.co/Jm1k7FHj7H",
        "id_str": "1787229532241469749"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 21:05:00 +0000 2024",
        "full_text": "South Dakota Gov. Kristi Noem said she's \"not retracting anything\" after facing backlash for stories about killing her young dog and a false claim about meeting with Kim Jong Un. https://t.co/8fJcS2exYV",
        "id_str": "1787227016363655514"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 20:35:00 +0000 2024",
        "full_text": "A former government employee with ties to intelligence agencies was arrested and accused of sending fake tips to the FBI falsely accusing  coworkers of taking part in the Jan. 6 Capitol breach. https://t.co/u7ySfwofL0",
        "id_str": "1787219465358147929"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 20:00:00 +0000 2024",
        "full_text": "Palestinians and others in the Middle East see the U.S. as an \"enabler\" of Israel in its war with Hamas, Queen Rania al Abdullah of Jordan said Sunday on @FaceTheNation.  https://t.co/TjFbL54D0T",
        "id_str": "1787210658611662962"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 19:40:00 +0000 2024",
        "full_text": "Years behind schedule and more than a billion dollars over budget, Boeing's Starliner capsule is finally poised for its first piloted launch Monday. https://t.co/H1sZX8uIxW",
        "id_str": "1787205626596139152"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 19:24:03 +0000 2024",
        "full_text": "RT @FaceTheNation: \"I think the president should and will get out there on campuses\" where there are protests over the Gaza war, says Rep.…",
        "id_str": "1787201613808963872"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 19:09:41 +0000 2024",
        "full_text": "Actor Bernard Hill, known for his roles in \"Titanic\" and \"Lord of the Rings,\" died early Sunday, family members confirmed. https://t.co/kVX02GZPfz",
        "id_str": "1787197994225332493"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 19:00:36 +0000 2024",
        "full_text": "RT @CBSSunday: The popular CBS drama \"Blue Bloods\" is wrapping up this year, but star Tom Selleck isn’t ready to let go. He discusses his h…",
        "id_str": "1787195709436871073"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 19:00:32 +0000 2024",
        "full_text": "RT @CBSSunday: On October 7, 2023, the \"Tribe of Nova\" music festival in southern Israel was attacked by Hamas terrorists. A New York City…",
        "id_str": "1787195691791434236"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 19:00:13 +0000 2024",
        "full_text": "RT @FaceTheNation: Sen.@JohnFetterman, who has spoken critically about the college campus protests against the war in Gaza and President Bi…",
        "id_str": "1787195614653984967"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 19:00:11 +0000 2024",
        "full_text": "RT @FaceTheNation: Rep. @RoKhanna (D-CA) calls for college campus protesters to show \"discipline\" amid reports that some have called for vi…",
        "id_str": "1787195605036511305"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 19:00:00 +0000 2024",
        "full_text": "Madonna put on a free concert on Copacabana beach Saturday night, turning Rio de Janeiro's vast stretch of sand into an enormous dance floor teeming with a multitude of her fans. https://t.co/zKjAxQkzGp",
        "id_str": "1787195558047723729"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 18:40:00 +0000 2024",
        "full_text": "South Dakota Gov. Kristi Noem told @FaceTheNation she's \"not retracting anything\" after facing backlash for stories about killing her young dog and a false claim about meeting Kim Jong Un, although she said the latter story will be adjusted in her book. https://t.co/e4w1jLWrVK",
        "id_str": "1787190527298798014"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 18:31:48 +0000 2024",
        "full_text": "Hamas militants attacked Israel's main crossing point for delivering humanitarian aid into the Gaza Strip on Sunday, dealing a blow to the ongoing crease-fire efforts that appear at an impasse with both sides blaming each other. https://t.co/ijpq23cQnL",
        "id_str": "1787188460811440457"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 17:58:43 +0000 2024",
        "full_text": "Interstate 95 reopened in both directions Sunday in Norwalk, Connecticut, days after a tanker truck caught fire and badly damaged a bridge. https://t.co/NrCkWgnOOO",
        "id_str": "1787180138548912381"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 17:05:33 +0000 2024",
        "full_text": "RT @RamyInocencio: Is the Israel-Hamas ceasefire-for-hostages proposal dead? “Israel will not agree to Hamas’s demands,” said Israeli Prime…",
        "id_str": "1787166757003608102"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 17:00:01 +0000 2024",
        "full_text": "A flood watch remained in effect for parts of southeastern Texas on Sunday, with forecasters expecting several more inches of rainfall and potentially serious runoff across a huge area that altogether covers more than 100 square miles and includes Houston. https://t.co/YLf4MpXBvr",
        "id_str": "1787165366159822977"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 16:23:38 +0000 2024",
        "full_text": "RT @CBSSunday: In Baton Rouge, La., nine-year-old Kelvin Ellis Jr. saw a homeless man outside a coffee shop and offered him his only dollar…",
        "id_str": "1787156208471671082"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 16:23:36 +0000 2024",
        "full_text": "RT @CBSSunday: NASA tucked a tiny four-pound helicopter aboard its Mars 2020 lander, anticipating just five short flights in the thin Marti…",
        "id_str": "1787156199713972273"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 16:00:00 +0000 2024",
        "full_text": "Los Angeles police officers in riot gear arrived at the University of Southern California early Sunday to clear a pro-Palestinian encampment after issuing a dispersal warning. https://t.co/bLtZhk318Y",
        "id_str": "1787150261246390479"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 15:49:59 +0000 2024",
        "full_text": "RT @FaceTheNation: .@KristiNoem on the controversial story she shared in her new book about killing her 14-month-old dog Cricket, which she…",
        "id_str": "1787147738984984583"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 15:49:54 +0000 2024",
        "full_text": "RT @FaceTheNation: .@KristiNoem addresses the false claim in her new book that she met with North Korea’s leader Kim Jong Un: \"This anecdot…",
        "id_str": "1787147720546734213"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 15:49:52 +0000 2024",
        "full_text": "RT @FaceTheNation: .@QueenRania of Jordan says people in her country view the U.S. as an \"enabler\" of Israel's actions in the war, and ther…",
        "id_str": "1787147710895645084"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 15:49:50 +0000 2024",
        "full_text": "RT @FaceTheNation: After telling stories in her new book about shooting her dog and goat, is @KristiNoem celebrating the killing of animals…",
        "id_str": "1787147703954083876"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 15:49:48 +0000 2024",
        "full_text": "RT @FaceTheNation: \"When October 7 happened, the world rightfully condemned and took strong actions, strong positions,\" says @QueenRania of…",
        "id_str": "1787147694370095477"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 15:49:44 +0000 2024",
        "full_text": "RT @FaceTheNation: \"There are many tools that the U.S. has in order to compel Israel to do the right thing,\" @QueenRania of Jordan says aft…",
        "id_str": "1787147676322042333"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 15:22:16 +0000 2024",
        "full_text": "RT @FaceTheNation: There were more crackdowns this weekend on anti-war protests and encampments at college campuses across the U.S., includ…",
        "id_str": "1787140765946179791"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 14:30:00 +0000 2024",
        "full_text": "Mystik Dan won the Kentucky Derby on Saturday in a stunning photo finish. It was the 150th running of the high-profile race. https://t.co/msuAnURGQF",
        "id_str": "1787127611354730685"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 14:00:01 +0000 2024",
        "full_text": "If you're trying to explain the 2024 Met Gala theme, you can look to the classic fable, \"Sleeping Beauty.\" https://t.co/p7FuCSBdT4",
        "id_str": "1787120064845451367"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 13:30:00 +0000 2024",
        "full_text": "A car crashed into the security gate that surrounds the White House on Saturday night, killing the driver, officials said. https://t.co/K5Zbm1hWfj",
        "id_str": "1787112512573325748"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 13:00:00 +0000 2024",
        "full_text": "Australian police shot and killed a 16-year-old boy armed with a knife after he stabbed a man in an attack that had the \"hallmarks\" of terror, officials said Sunday. https://t.co/0FG1uTq1uO",
        "id_str": "1787104964055126044"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 12:33:51 +0000 2024",
        "full_text": "Israeli Prime Minister Benjamin Netanyahu said on Sunday that his government's cabinet has voted unanimously to shut down the local offices of Qatar-owned broadcaster Al Jazeera, escalating Israel's long-running feud with the channel. https://t.co/M3xgAvfWUk",
        "id_str": "1787098382818762993"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 10:00:00 +0000 2024",
        "full_text": "Several people in Chicago were forced to unlock their phones and banking apps at gunpoint - and one was caught on camera. https://t.co/q1SzJh85Ee https://t.co/3z4nEAdNxJ",
        "id_str": "1787059663806119971"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 09:00:00 +0000 2024",
        "full_text": "Mystik Dan wins 150th Kentucky Derby in stunning photo finish https://t.co/UFfkT7nWRb",
        "id_str": "1787044565498675228"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 08:00:01 +0000 2024",
        "full_text": "Massachusetts detective searched gunshot residue testing online 11 days before his wife is shot dead https://t.co/0hgRhwHtHS",
        "id_str": "1787029467447075006"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 07:00:01 +0000 2024",
        "full_text": "A boy gave his only dollar to someone he mistook as homeless. In exchange, the businessman rewarded him for his generosity. https://t.co/adHIEWTAFx",
        "id_str": "1787014368791556336"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 06:00:00 +0000 2024",
        "full_text": "Frank Stella, a painter, sculptor and printmaker whose constantly evolving works are hailed as landmarks of the minimalist and post-painterly abstraction art movements, died Saturday at his home in Manhattan. He was 87. https://t.co/TuOlkZFp1F https://t.co/DHCSYOpClj",
        "id_str": "1786999265039991078"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 05:30:00 +0000 2024",
        "full_text": "Massachusetts detective's affair exposed during investigation into his wife's shooting death https://t.co/Rt3LSw1uzC",
        "id_str": "1786991717809271231"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 05:05:00 +0000 2024",
        "full_text": "The Seva Collective food pantry began as a scrappy operation — a handful of volunteers, food and toys purchased by the organizers themselves, and a dream to help a community. https://t.co/BxPHmVSl3I",
        "id_str": "1786985426533704096"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 04:05:01 +0000 2024",
        "full_text": "China has launched a lunar probe to land on the far side of the moon in a first-of-its-kind mission to return with samples. https://t.co/pudJQbaSzE",
        "id_str": "1786970327500587093"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 03:35:00 +0000 2024",
        "full_text": "Roughly 100,000 immigrants who were brought to the U.S. as children are expected to enroll in the Affordable Care Act's health insurance next year under a new directive the Biden administration released Friday. https://t.co/HCqLtXyFsr",
        "id_str": "1786962775152930922"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 03:05:00 +0000 2024",
        "full_text": "U.S. pregnancy-related deaths have fallen back to pre-pandemic levels, new government data suggests. https://t.co/MNfGthLufu",
        "id_str": "1786955224462029258"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 02:35:01 +0000 2024",
        "full_text": "Darren Reitz usually goes fishing for some \"peace and quiet\" – then he caught what he could only describe as a \"monster.\" It was a fish so big, it may have broken a U.K. record.  https://t.co/Ur3SAkzWlh",
        "id_str": "1786947678204563775"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 02:05:00 +0000 2024",
        "full_text": "\"I'm here because I'm standing up for myself. Because I know that when a woman stands up for herself, she stands up for all women,\" Halle Berry said. \"And all women go through menopause.\" https://t.co/gfXfG6Puir",
        "id_str": "1786940127882744297"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 01:52:15 +0000 2024",
        "full_text": "Authorities are investigating multiple bomb threats at synagogues across New York City on Saturday. https://t.co/WhoaqdUqrj",
        "id_str": "1786936916815819236"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 01:35:00 +0000 2024",
        "full_text": "Marc Summers, the iconic host of Nickelodeon's \"Double Dare\" and a familiar face on television for over three decades, is now showcasing his life story through his one-man play, \"The Life and Slimes of Marc Summers.\" https://t.co/I1L71ujcrQ",
        "id_str": "1786932577388933389"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 01:05:00 +0000 2024",
        "full_text": "A New York City man has pleaded guilty to attempting to sell prohibited wild animal parts, including a cougar head. https://t.co/SkLgFRPJML",
        "id_str": "1786925026530238482"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 00:35:00 +0000 2024",
        "full_text": "CDC says bird flu viruses \"pose pandemic potential,\" cites major knowledge gap. https://t.co/WfVm0UjgO1",
        "id_str": "1786917475944161377"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 00:26:01 +0000 2024",
        "full_text": "RT @CBSEveningNews: As graduation season approaches, high school seniors across the nation have much to be proud of. But for this predomina…",
        "id_str": "1786915215772471346"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 00:25:59 +0000 2024",
        "full_text": "RT @CBSEveningNews: Saturday marks May the Fourth, the unofficial celebration of all things Star Wars. And this year, even the president is…",
        "id_str": "1786915206490415365"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 00:25:56 +0000 2024",
        "full_text": "RT @CBSEveningNews: Scotland’s Queen Mary, once the most magnificent ship in the world, became just a tourist attraction in Long Beach, Cal…",
        "id_str": "1786915195237142993"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 00:25:52 +0000 2024",
        "full_text": "RT @CBSEveningNews: Artist Frank Stella, known for his large-scale, minimalist paintings that took the world by storm in the 1950s, has die…",
        "id_str": "1786915180309627194"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 00:25:49 +0000 2024",
        "full_text": "RT @CBSEveningNews: At his annual Berkshire Hathaway meeting with shareholders on Saturday, Warren Buffet laid out what’s supposed to happe…",
        "id_str": "1786915167655317910"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 00:25:48 +0000 2024",
        "full_text": "RT @CBSEveningNews: As CIA Director William Burns meets with Hamas representatives in Cairo for cease-fire talks, an adviser to Israeli Pri…",
        "id_str": "1786915159879066067"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 00:25:46 +0000 2024",
        "full_text": "RT @CBSEveningNews: College graduations are underway across the country, but the backdrop of passionate pro-Palestinian protests on dozens…",
        "id_str": "1786915152245452883"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 00:25:44 +0000 2024",
        "full_text": "RT @CBSEveningNews: While the Biden administration has been focused on a cease-fire agreement for the Israel-Hamas war, House Democrats hav…",
        "id_str": "1786915143441694792"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sun May 05 00:25:42 +0000 2024",
        "full_text": "RT @CBSEveningNews: Relentless floods continue to rise across Southeast Texas, where first responders have been making rescues in the treac…",
        "id_str": "1786915136856580419"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 23:58:53 +0000 2024",
        "full_text": "Crews rescued more than 400 people from homes, rooftops and roads engulfed in murky water in Texas following heavy rains on Saturday. https://t.co/9IuI1mhAIy",
        "id_str": "1786908389659889914"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 23:32:30 +0000 2024",
        "full_text": "Mystik Dan entered the 20-horse race with 18-1 odds and pulled off an extraordinary photo finish at the Kentucky Derby. https://t.co/ACa9A4DqeQ https://t.co/to8dzA8uYn",
        "id_str": "1786901747786559520"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 23:17:26 +0000 2024",
        "full_text": "BREAKING: Mystik Dan has won the 150th Kentucky Derby in a stunning photo finish. https://t.co/3vQG8KQFEw",
        "id_str": "1786897958094414130"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 22:33:00 +0000 2024",
        "full_text": "While some Jewish students and faculty have told CBS News that the pro-Palestinian protests on college campuses across the U.S. have left them feeling unsafe, others say they don't want the schools to break up the movements \"in their name.\" \n\n\"The universities have been saying… https://t.co/547ZQ7uTwD",
        "id_str": "1786886772653518968"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 22:03:18 +0000 2024",
        "full_text": "Federal prosecutors charged five men this week accused of impersonating Philadelphia police officers in the 2006 kidnapping and killing of a 38-year-old man. https://t.co/I9XT2vx3iv",
        "id_str": "1786879300802584858"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 21:45:06 +0000 2024",
        "full_text": "It may just be Southern California's longest drive-thru line. But when these drivers pull up to the front, there's no window, fast food or even cashiers. \n\nThis is the Seva Collective, a volunteer-run food pantry in Santa Ana, California. Here's what they're serving up, and who… https://t.co/JySf5fx6GT",
        "id_str": "1786874718467100913"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 21:00:00 +0000 2024",
        "full_text": "Kentucky's \"backside workers\" care for million-dollar horses on the racing circuit. This clinic takes care of them. https://t.co/cdLgKWruRH",
        "id_str": "1786863370789855235"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 20:51:33 +0000 2024",
        "full_text": "RT @CBSEveningNews: Here’s a look at the top stories coming up tonight on the CBS Weekend News with @EdOKeefe. https://t.co/ERox8HJdcv",
        "id_str": "1786861243027881991"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 20:33:40 +0000 2024",
        "full_text": "RT @RamyInocencio: Sound up! 🔊 We were in the midst of tonight’s huge rally of tens of thousands in Tel Aviv. Some chanted “Deal! Now!” ref…",
        "id_str": "1786856742460203190"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 20:00:01 +0000 2024",
        "full_text": "Officials at Miami International Airport say a man was trying to board a flight with snakes in his pants. https://t.co/uirsSIPCCF",
        "id_str": "1786848273833021550"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 19:43:44 +0000 2024",
        "full_text": "Police in Wisconsin fatally shot a student who had pointed a pellet rifle in their direction outside a middle school, according to the state's Department of Justice. https://t.co/qnd0BNbS8T",
        "id_str": "1786844178543956229"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 19:30:00 +0000 2024",
        "full_text": "10,000 people applied to be The Smashing Pumpkins' next guitarist. Meet the woman who got the job. https://t.co/0MEjfnR9jX",
        "id_str": "1786840722374578595"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 19:14:04 +0000 2024",
        "full_text": "RT @RamyInocencio: Happening now here in Tel Aviv. One of the biggest rallies calling for a ceasefire with Hamas, release of the 130 or so…",
        "id_str": "1786836712964141297"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 19:13:53 +0000 2024",
        "full_text": "RT @RamyInocencio: Confirmed. CIA Director William Burns now in Cairo for talks on Israel-Hamas war: U.S. official and a source familiar. H…",
        "id_str": "1786836665308434759"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 19:00:00 +0000 2024",
        "full_text": "Warren Buffett's Berkshire Hathaway gathered for its first annual meeting in an Omaha arena on Saturday, bringing together shareholders for the first time since the death of longtime vice chairman and right-hand man Charlie Munger. https://t.co/9YJKYT9NCA",
        "id_str": "1786833172702929110"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 18:30:00 +0000 2024",
        "full_text": "A graduation ceremony at the University of Michigan on Saturday was briefly interrupted by dozens of pro-Palestinian protesters who unfurled Palestinian flags and posters as they walked through the aisles. https://t.co/tBlF7dVuOP",
        "id_str": "1786825622074900679"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 17:40:01 +0000 2024",
        "full_text": "Employer who fired 78-year-old receptionist must now pay her $78,000 https://t.co/hSGeLFVzPd",
        "id_str": "1786813041163509793"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 17:20:00 +0000 2024",
        "full_text": "Mexican man wins case against Cartier after buying $13,000 earrings online for $13 https://t.co/fiXgMdVr2T",
        "id_str": "1786808004437848491"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 17:00:01 +0000 2024",
        "full_text": "29 iconic Met Gala looks from the best-dressed guests since 1973 https://t.co/Xa8qZs1fpm",
        "id_str": "1786802976314490896"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 16:40:00 +0000 2024",
        "full_text": "Progress cited in truce talks as Israel downplays chances of ending war with Hamas, Egypt media says https://t.co/aB9JtVk5Pg",
        "id_str": "1786797939391639971"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 16:20:00 +0000 2024",
        "full_text": "Kevin Spacey denies new sexual harassment and assault allegations to be aired in documentary https://t.co/z5nJIThAah",
        "id_str": "1786792908147875947"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 16:00:00 +0000 2024",
        "full_text": "London Mayor Sadiq Khan wins third term as UK's governing Conservatives endure more bad results  https://t.co/rPi5r1HZVK",
        "id_str": "1786787872609058928"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 15:40:00 +0000 2024",
        "full_text": "Flood watch affects millions in Texas and Oklahoma as more storms are expected Sunday https://t.co/jeKgw1bUR9",
        "id_str": "1786782840127922504"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 15:20:01 +0000 2024",
        "full_text": "Maine bowling alley reopens 6 months after state's deadliest mass shooting https://t.co/CZ8gIIhzxO",
        "id_str": "1786777808934461735"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 15:00:00 +0000 2024",
        "full_text": "At least 14 killed after flood and landslide hit Indonesia's Sulawesi island https://t.co/UmC1F0rri1",
        "id_str": "1786772774297423945"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 14:51:34 +0000 2024",
        "full_text": "RT @cbssaturday: While border concerns and undocumented migration have made headlines in recent years, the stories aren't new. In fact, it'…",
        "id_str": "1786770651644150172"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 14:51:30 +0000 2024",
        "full_text": "RT @cbssaturday: Two days after a fire nearly destroyed Paris' Notre Dame Cathedral, French President Emmanuel Macron set a five-year deadl…",
        "id_str": "1786770635819020737"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 14:51:26 +0000 2024",
        "full_text": "RT @cbssaturday: Parts of Texas are bracing for giant hail, wind gusts and catastrophic flood conditions. The Houston area remains under fl…",
        "id_str": "1786770618995658994"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 14:51:20 +0000 2024",
        "full_text": "RT @cbssaturday: Desert Monks Brewing uses recycled water to create a unique flavor and save water. The innovative process combines classic…",
        "id_str": "1786770593661997242"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 14:51:18 +0000 2024",
        "full_text": "RT @cbssaturday: .@Monumental_Labs, a New York-based startup is looking to bring back a blast from the past by using robots to create intri…",
        "id_str": "1786770583323021821"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 14:49:42 +0000 2024",
        "full_text": "RT @cbssaturday: Award-winning Chef Andrew Carmellini has risen to the top of the cooking world, opening a bevy of restaurants in New York…",
        "id_str": "1786770181655601504"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 14:49:37 +0000 2024",
        "full_text": "RT @cbssaturday: Old 97's four original members are celebrating the 30th anniversary of their debut record with a tour and a new studio alb…",
        "id_str": "1786770159820005641"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 14:40:00 +0000 2024",
        "full_text": "All the past Met Gala themes over the years up to 2024 https://t.co/x5rFVB4GSg",
        "id_str": "1786767741971562593"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 14:20:00 +0000 2024",
        "full_text": "Tanzania hit by power blackouts as Cyclone Hidaya strengthens toward country's coastline https://t.co/nIaCGrDK2j",
        "id_str": "1786762706634015000"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 14:00:00 +0000 2024",
        "full_text": "When her mother went missing, an Illinois woman ventured into the dark corners of America's romance scam epidemic https://t.co/xRIILwUg2m",
        "id_str": "1786757675599962247"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 13:40:00 +0000 2024",
        "full_text": "Drive-thru food pantry in Southern California food desert provides consistent source of groceries for thousands: \"It's a labor of love\" https://t.co/4B9WDeX72i",
        "id_str": "1786752642779074825"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 13:39:57 +0000 2024",
        "full_text": "RT @cbssaturday: An AI-powered F-16 fighter jet took Air Force Secretary Frank Kendall on a history-making flight this week. The Air Force…",
        "id_str": "1786752627859972158"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 13:39:53 +0000 2024",
        "full_text": "RT @cbssaturday: Since the protests against the war in Gaza began on college campuses across the nation more than two weeks ago, more than…",
        "id_str": "1786752610059391333"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 13:39:51 +0000 2024",
        "full_text": "RT @cbssaturday: CIA Director William Burns arrived in Cairo, Egypt, Friday for the latest round of high-stakes negotiations over a hostage…",
        "id_str": "1786752601750376865"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 13:39:48 +0000 2024",
        "full_text": "RT @cbssaturday: May the Fourth be with you! Happy Star Wars Day to those who celebrate in galaxies near and far. https://t.co/cy0gUzoS6R",
        "id_str": "1786752590509756714"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 13:39:45 +0000 2024",
        "full_text": "RT @cbssaturday: The April jobs report showed that 175,000 jobs were added, well below expectations of roughly 232,000. The unemployment ra…",
        "id_str": "1786752578652451311"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 13:39:39 +0000 2024",
        "full_text": "RT @cbssaturday: President Biden awarded the Medal of Freedom, the nation's highest civilian honor, to 19 people ranging from activists to…",
        "id_str": "1786752553792757912"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 13:39:37 +0000 2024",
        "full_text": "RT @cbssaturday: ON THIS DATE: In 1959, the first Grammy Awards are presented. The winners include Frank Sinatra, Ella Fitzgerald and the K…",
        "id_str": "1786752543378288886"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 13:20:00 +0000 2024",
        "full_text": "IRS says its number of audits is about to surge. Here's who the agency is targeting. https://t.co/ezlVF2TRYc",
        "id_str": "1786747607072588077"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 13:00:01 +0000 2024",
        "full_text": "U.S. pilot accounted for 57 years after vanishing during Vietnam War spy mission https://t.co/qPrHTUUYsR",
        "id_str": "1786742577883922894"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 12:40:00 +0000 2024",
        "full_text": "24 years ago, an officer was dispatched to an abandoned baby. Decades later, he finally learned that baby's surprising identity. https://t.co/8yYt5KoEq5",
        "id_str": "1786737542433235247"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 12:20:00 +0000 2024",
        "full_text": "Walgreens limits Gummy Mango candy sales to one bag per customer https://t.co/MO1cdoGGCu",
        "id_str": "1786732507146096874"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 12:00:00 +0000 2024",
        "full_text": "American workers by and large believe they'll retire at 65, the nation's traditional retirement age. But real life often gets in the way of those plans, with new research finding that the majority actually step back from work far earlier. https://t.co/yZ202JV8L2 https://t.co/jwCxSJw3v6",
        "id_str": "1786727475797454981"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 11:40:00 +0000 2024",
        "full_text": "\"Incredibly rare\" ancient purple dye that was once worth more than gold found in U.K. https://t.co/70wAAXFJxs",
        "id_str": "1786722443807133965"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 11:00:00 +0000 2024",
        "full_text": "Mexican man prevails in fight with Cartier after buying $14,000 earrings online for $14 https://t.co/Uab5X1tUfd",
        "id_str": "1786712377024467193"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 10:00:35 +0000 2024",
        "full_text": "RT @cbssaturday: TOMORROW: @old97s will perform music from their new studio album in a return visit to #SaturdaySessions. Find out what tim…",
        "id_str": "1786697421780590877"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 10:00:28 +0000 2024",
        "full_text": "RT @cbssaturday: .@Monumental_Labs, a New York-based startup is trying to bring back ornate and intricate stone structures by using industr…",
        "id_str": "1786697392709829072"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 10:00:01 +0000 2024",
        "full_text": "An invasive and harmful worm capable of growing to three feet long has been discovered in Ontario, Canada. The hammerhead land planarian is toxic and, experts warn, can pose a threat to pets, small children and small animals. https://t.co/ooY4WsoHln https://t.co/aJytZLjdLs",
        "id_str": "1786697278608007274"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 09:00:00 +0000 2024",
        "full_text": "A boy gave his only dollar to someone he mistook as homeless. In exchange, the businessman rewarded him for his generosity. https://t.co/5FD2Nof8jm",
        "id_str": "1786682175397482700"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 08:00:00 +0000 2024",
        "full_text": "The IRS says it is about to ramp up audits as it cracks down on tax cheats and seeks to deliver more revenue into the U.S. Treasury's coffers - bolstered by $80 billion in new funding directed by the Inflation Reduction Act (IRA). https://t.co/wdEIvVyxdN https://t.co/ovAXOSRuOT",
        "id_str": "1786667077157167531"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 07:00:00 +0000 2024",
        "full_text": "3 bodies found in Mexican region where Australian, American surfers went missing, FBI says https://t.co/boUFvPXWob",
        "id_str": "1786651978182832250"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 06:00:00 +0000 2024",
        "full_text": "Fans finally got to see Caitlin Clark and Angel Reese suit up as professionals for the first time Friday night as the brief WNBA preseason begins. https://t.co/FdbwO2aVDf https://t.co/bDWPQaJYv6",
        "id_str": "1786636879317651458"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 05:05:00 +0000 2024",
        "full_text": "Walgreens is ramping up production of Walgreen's Nice! Gummy Mango peelable candy, and limiting online sales to one bag per customer due to high demand thanks to TikTok. https://t.co/NJErK7Sry9",
        "id_str": "1786623035765674491"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 04:05:00 +0000 2024",
        "full_text": "Bumblebee babies are dying in their nests because global temperatures are getting too warm, new research shows. https://t.co/fj23itg5WN",
        "id_str": "1786607937693065677"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 03:35:00 +0000 2024",
        "full_text": "10,000 people applied to be The Smashing Pumpkins' next guitarist. Meet the woman who got the job. https://t.co/t7wiIY0BCk",
        "id_str": "1786600386595340404"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 03:05:01 +0000 2024",
        "full_text": "Russian military personnel have entered an airbase in Niger where some U.S. troops are located, two U.S. officials confirmed to CBS News. https://t.co/lTZmj7Vsav",
        "id_str": "1786592840316809297"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 02:56:07 +0000 2024",
        "full_text": "Meet the Kentucky Derby horses running in the 2024 race on Saturday. https://t.co/r4hdFYGQxs",
        "id_str": "1786590601510527145"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 02:05:00 +0000 2024",
        "full_text": "The IRS says it is about to ramp up audits as it cracks down on tax cheats and seeks to deliver more revenue into the U.S. Treasury's coffers. https://t.co/xgS7YihvlB",
        "id_str": "1786577737907331173"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 01:57:18 +0000 2024",
        "full_text": "A storm chaser not only captured a massive tornado touching down in Hawley, Texas on Thursday but ended up rescuing a family of four whose home was destroyed by it. https://t.co/1hSKcXrdz6",
        "id_str": "1786575801950875775"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 01:35:00 +0000 2024",
        "full_text": "Peloton was once hailed as the future of fitness. Now it's sucking wind. https://t.co/xxp9Vv04yn",
        "id_str": "1786570187136696622"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 01:23:45 +0000 2024",
        "full_text": "A boy gave his only dollar to someone he mistook as homeless. In exchange, the businessman rewarded him for his generosity. https://t.co/tCNo2c9sgq",
        "id_str": "1786567358376468797"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Sat May 04 00:09:32 +0000 2024",
        "full_text": "RT @CBSEveningNews: Jordan's Queen Rania told @margbrennan that \"emotions are running high\" at pro-Palestinian protests at US college campu…",
        "id_str": "1786548679886635230"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 23:54:06 +0000 2024",
        "full_text": "Caitlin Clark, Angel Reese to make pro debut Friday as WNBA preseason begins https://t.co/GAYPGSZwKE",
        "id_str": "1786544795374018727"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 23:50:41 +0000 2024",
        "full_text": "The Alabama Supreme Court on Friday declined to reconsider a controversial ruling that said frozen embryos are considered children under a state law. https://t.co/txwljD4e1d",
        "id_str": "1786543937110384977"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 23:45:19 +0000 2024",
        "full_text": "RT @CBSEveningNews: Crossing guard Lenzo Thompson goes above and beyond to ensure the safety of kids in Nashville, always greeting them wit…",
        "id_str": "1786542584979947689"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 23:26:59 +0000 2024",
        "full_text": "RT @CBSEveningNews: The NYPD and Mayor Eric Adams are under scrutiny following an incident where a sergeant's gun discharged while clearing…",
        "id_str": "1786537973783134704"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 23:26:57 +0000 2024",
        "full_text": "RT @CBSEveningNews: Storm chasers in Texas came to the rescue of a 7-year-old boy and his family who were injured when a massive tornado de…",
        "id_str": "1786537963200917807"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 23:19:55 +0000 2024",
        "full_text": "RT @CBSEveningNews: 9-year-old Kelvin Ellis Jr. wanted to help the homeless, so he offered his last dollar to a man he saw praying outside…",
        "id_str": "1786536195431800915"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 23:04:27 +0000 2024",
        "full_text": "RT @CBSEveningNews: Crews have begun dismantling a bridge in Norwalk, Connecticut, that was severely damaged during a fiery crash on Inters…",
        "id_str": "1786532299548336195"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 23:04:24 +0000 2024",
        "full_text": "RT @CBSEveningNews: China launched a rocket into space on Friday with an ambitious goal to collect lunar samples from the far side of the m…",
        "id_str": "1786532288836104356"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 23:04:21 +0000 2024",
        "full_text": "RT @CBSEveningNews: The bodies of an American and two Australian tourists have reportedly been found in Mexico after they went missing in t…",
        "id_str": "1786532277586895041"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 23:04:18 +0000 2024",
        "full_text": "RT @CBSEveningNews: The Presidential Medal of Freedom, the nation's highest civilian honor, was awarded to 19 individuals for their profoun…",
        "id_str": "1786532265264025793"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 23:04:07 +0000 2024",
        "full_text": "RT @CBSEveningNews: Democratic Rep. Henry Cuellar and his wife were indicted on more than a dozen federal charges alleging they accepted ne…",
        "id_str": "1786532216366837872"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 23:04:04 +0000 2024",
        "full_text": "RT @CBSEveningNews: Former White House communications director Hope Hicks gave emotional testimony in Donald Trump's New York criminal tria…",
        "id_str": "1786532205394538613"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 22:49:50 +0000 2024",
        "full_text": "Turkish President Recep Tayyip Erdogan said Thursday his country has imposed a trade ban on Israel because it could no longer \"stand by and watch\" the violence in Gaza. https://t.co/5UYPwW8Ecz",
        "id_str": "1786528624914354189"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 21:48:27 +0000 2024",
        "full_text": "RT @CBSSunday: “It freaked me out.” In 2013 country music star @randytravis suffered a stroke that robbed him of his singing voice. Travis’…",
        "id_str": "1786513173681705358"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 21:38:00 +0000 2024",
        "full_text": "Walgreens said it is ramping up production of its peelable gummy mango candy, and limiting online sales to one bag per customer due to high demand for the treats, fed by social media. https://t.co/VPFeasfxC3",
        "id_str": "1786510543840305638"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 20:50:09 +0000 2024",
        "full_text": "Canadian police made 3 arrests in slaying of Sikh separatist leader. https://t.co/AjLY78Egth",
        "id_str": "1786498504229097940"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 20:23:05 +0000 2024",
        "full_text": "Watch Live: Biden awards Medal of Freedom to Nancy Pelosi, Al Gore, Katie Ledecky and more: https://t.co/NG37CJlD3e",
        "id_str": "1786491692243202307"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 20:01:04 +0000 2024",
        "full_text": "After poachers busted hiding striped bass in odd locations, New York changes fishing regulations. https://t.co/R35TXgBGUt",
        "id_str": "1786486150128959746"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 19:48:41 +0000 2024",
        "full_text": "A field of 20 horses is set to launch from the starting gate for the 2024 Kentucky Derby on Saturday.  https://t.co/pXL3zZq1Ku",
        "id_str": "1786483035807924691"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 18:59:37 +0000 2024",
        "full_text": "Massachusetts detective searched gunshot residue testing online 11 days before his wife is shot dead. https://t.co/xsQqbzad6e",
        "id_str": "1786470686501859631"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 18:58:26 +0000 2024",
        "full_text": "Trump Media's accountant is charged with \"massive fraud\" by the SEC https://t.co/bJClbfkeeC",
        "id_str": "1786470389075394979"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 18:57:33 +0000 2024",
        "full_text": "CIA Director William Burns arrived in Cairo, Friday for the latest round of high-stakes negotiations over a hostage and cease-fire deal between Hamas and Israel. https://t.co/9IMBy4qBYy",
        "id_str": "1786470168442421649"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 17:40:00 +0000 2024",
        "full_text": "Marc Summers, the iconic host of Nickelodeon's \"Double Dare\" and a familiar face on television for over three decades, is now showcasing his life story in New York City through his one-man play, \"The Life and Slimes of Marc Summers.\"  https://t.co/0tffQBpfSz",
        "id_str": "1786450650290589705"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 17:20:00 +0000 2024",
        "full_text": "The 2024 Kentucky Derby will be held for the 150th time on Saturday. Here's what to know.  https://t.co/rj7ypoQbg2",
        "id_str": "1786445618602238394"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 17:09:33 +0000 2024",
        "full_text": "Bird flu continues to appear to pose a \"low risk to the general public\" for now, the CDC says.  https://t.co/2iyMpMEYT4",
        "id_str": "1786442989352488968"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 16:30:00 +0000 2024",
        "full_text": "A 78-year-old Belgian man was arrested on suspicion of murdering his companion 30 years ago after excavation work turned up human remains in a garden. https://t.co/Pvngv7cG3h",
        "id_str": "1786433034838778357"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 16:28:56 +0000 2024",
        "full_text": "Ex-government employee Miguel Zapata with tie is accused of sending fake FBI tips falsely accusing multiple coworkers of taking part in the Jan. 6, 2021, Capitol breach. https://t.co/PlIf0pWuwG",
        "id_str": "1786432766508240971"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 16:09:34 +0000 2024",
        "full_text": "Democratic Rep. Henry Cuellar, of Texas, is expected to be indicted by the DOJ, a U.S. official tells CBS News. https://t.co/aOlxgN6hDf",
        "id_str": "1786427894773715441"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 15:40:00 +0000 2024",
        "full_text": "During a recent court appearance, the attorney representing Bryan Kohberger, the man accused of murdering four students at the University of Idaho in November 2022, said that prosecutors were withholding information from the defense team.  https://t.co/NIRnO3TMgF",
        "id_str": "1786420451549278239"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 15:32:44 +0000 2024",
        "full_text": "BREAKING: Hope Hicks, a former spokesperson for Donald Trump, is called to testify in his New York criminal trial.  https://t.co/KS00Zoc0z9",
        "id_str": "1786418624564953113"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 15:20:00 +0000 2024",
        "full_text": "A New York City man has pleaded guilty to attempting to sell prohibited wild animal parts, including a cougar head. https://t.co/pUdSSonV6j",
        "id_str": "1786415420527825133"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 15:00:04 +0000 2024",
        "full_text": "Mexican authorities said Thursday they have found tents and questioned three people in the case of two Australians and an American who went missing over the weekend in Baja California.  https://t.co/1hTlIsWBxe",
        "id_str": "1786410401531396115"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 14:45:00 +0000 2024",
        "full_text": "Scientists have been warning for years that bumblebee populations are declining. New research has found a \"major factor\" in why.  https://t.co/urBOPPrOia",
        "id_str": "1786406612434817335"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 14:41:21 +0000 2024",
        "full_text": "RT @camiloreports: As we reported live from El Paso, Texas for @CBSNews, we witnessed 3 migrants who appeared to be unaccompanied children…",
        "id_str": "1786405692158410934"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 14:30:00 +0000 2024",
        "full_text": "Former U.K. Prime Minister Boris Johnson was turned away from his local polling station Thursday as he failed bring with him photo identification, which is required under a relatively new law introduced by his government two years ago.  https://t.co/gI44kxosrC",
        "id_str": "1786402837066285371"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 14:15:00 +0000 2024",
        "full_text": "Job site Indeed identified the top 10 most sought-after job candidates by employers and recruiters. Here's what they found.  https://t.co/S2vrX0S7BT",
        "id_str": "1786399062071099611"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 14:01:24 +0000 2024",
        "full_text": "RT @CBSMornings: Pres. Biden will present the Presidential Medal of Freedom to 19 Americans, including former Speaker of the House Nancy Pe…",
        "id_str": "1786395638902542483"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 14:01:21 +0000 2024",
        "full_text": "RT @CBSMornings: For the first time, Boeing plans to launch astronauts to the International Space Station on its spaceship, Starliner. The…",
        "id_str": "1786395627489743081"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 14:01:15 +0000 2024",
        "full_text": "RT @CBSMornings: As protests have erupted on college campuses, some say chants are slogans of resistance — while others say they incite vio…",
        "id_str": "1786395599081722064"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 14:01:13 +0000 2024",
        "full_text": "RT @CBSMornings: .@realmarcsummers has enjoyed a long career in front of and behind the camera, hosting shows like @nickelodeon’s “Double D…",
        "id_str": "1786395591053807995"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 13:40:00 +0000 2024",
        "full_text": "Russia's government blasted France's President Emmanuel Macron for again suggesting his country would consider sending troops to Ukraine to help defend against Russia's ongoing invasion, if Kyiv were to request that level of help.  https://t.co/4bXyfEZ9W3",
        "id_str": "1786390251763618073"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 13:20:00 +0000 2024",
        "full_text": "The Smashing Pumpkins has been an iconic alt-rock ban for decades. And now the group has added a new member to help them carry on for decades more.  https://t.co/3iadJHHc2T",
        "id_str": "1786385220188410238"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 13:12:24 +0000 2024",
        "full_text": "RT @CBSMornings: For the first time ever, America’s top teachers were invited to a state dinner at the White House to honor their work.\n\nIt…",
        "id_str": "1786383307451535684"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 13:12:20 +0000 2024",
        "full_text": "RT @CBSMornings: A former attorney for adult film actor Stormy Daniels testified Thursday in former Pres. Trump’s criminal trial in New Yor…",
        "id_str": "1786383289281884177"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 13:12:18 +0000 2024",
        "full_text": "RT @CBSMornings: A section of I-95, one of America’s busiest highways, is shut down for at least several days, after a fiery crash Thursday…",
        "id_str": "1786383280075309461"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 13:12:14 +0000 2024",
        "full_text": "RT @CBSMornings: President Biden appealed for calm as even more campus protests against the war in Gaza are cleared by law enforcement.\n\nWh…",
        "id_str": "1786383266808815843"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 13:12:12 +0000 2024",
        "full_text": "RT @CBSMornings: Hundreds of people were arrested on college campuses Thursday, in the latest fallout from protests against the war in Gaza…",
        "id_str": "1786383256838975918"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 13:12:09 +0000 2024",
        "full_text": "RT @CBSMornings: Some residents in southeastern Texas are facing mandatory evacuations, as flooding reaching several feet is now life-threa…",
        "id_str": "1786383243043852609"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 13:00:00 +0000 2024",
        "full_text": "Hiring across the U.S. fell in April, a sign the Federal Reserve's efforts to shackle economic growth and curb inflation is chilling the labor market. https://t.co/kM4FgsdbCv",
        "id_str": "1786380188227395852"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 12:46:54 +0000 2024",
        "full_text": "Russian military personnel have entered an airbase in Niger where some U.S. troops are located, two U.S. officials confirmed to CBS News on Thursday https://t.co/XxhEthNCJj",
        "id_str": "1786376888216158561"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 12:35:11 +0000 2024",
        "full_text": "A lawsuit says if emergency responders had known about widespread cellphone outages during last year's deadly Maui wildfires, they would've used other methods to warn about the disaster. https://t.co/5ML9kdNxT4",
        "id_str": "1786373939809202583"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 12:15:00 +0000 2024",
        "full_text": "A forensic analyst who works for Manhattan District Attorney Alvin Bragg will resume testimony Friday in the trial of former President Donald Trump.  https://t.co/OlySElduDl",
        "id_str": "1786368863354954097"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 11:30:54 +0000 2024",
        "full_text": "Coming up on CBS News: \n\n🌪️Tornado hits central Texas town as severe weather continues to slam state\n\n🔘Captain of dive boat that caught fire in 2019, killing 34 people, sentenced to four years in prison\n\n👩‍🏫Teachers of the Year honored at the White House https://t.co/8ycymo6LTG",
        "id_str": "1786357765352436138"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 11:30:00 +0000 2024",
        "full_text": "China has launched a lunar probe to land on the far side of the moon in a first-of-its-kind mission to return with samples that could provide insights into differences between the less-explored region and the better-known near side. https://t.co/lZ8bC7sDhH",
        "id_str": "1786357537786179723"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 11:00:01 +0000 2024",
        "full_text": "Pres. Biden will award the Presidential Medal of Freedom to 19 recipients, including fmr. House Speaker Nancy Pelosi, fmr. Vice President Al Gore and Olympic swimmer Katie Ledecky.  https://t.co/3ZzMz4fIka",
        "id_str": "1786349992212402666"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 10:30:00 +0000 2024",
        "full_text": "Roughly 100,000 people who were brought to the U.S. as children are expected to enroll in the Affordable Care Act's health insurance next year under a new directive from the Biden administration. https://t.co/tEAuGtFKC3",
        "id_str": "1786342438757417383"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 10:00:00 +0000 2024",
        "full_text": "Summer heat has arrived early across South and Southeast Asia, setting records and even claiming lives. It's expected to get much worse through May and June. https://t.co/VhDLRZHtzK https://t.co/OqlYhpQ0Tb",
        "id_str": "1786334887680544857"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 09:30:00 +0000 2024",
        "full_text": "An NYPD officer fired his gun inside Hamilton Hall during Tuesday night's operation at Columbia University, the Manhattan district attorney's office confirmed. https://t.co/WtTmvXeyXC",
        "id_str": "1786327336960331856"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 09:00:00 +0000 2024",
        "full_text": "MS-13 gang leader who prosecutors say turned D.C. area into \"hunting ground\" sentenced to life in prison https://t.co/zIaqtXw4nb",
        "id_str": "1786319789536772194"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 08:00:00 +0000 2024",
        "full_text": "The IRS says it is about to ramp up audits as it cracks down on tax cheats and seeks to deliver more revenue into the U.S. Treasury's coffers. https://t.co/wdEIvVyxdN https://t.co/D2K2w40eLs",
        "id_str": "1786304690348523844"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 07:00:00 +0000 2024",
        "full_text": "Employer who fired 78-year-old receptionist must now pay her $78,000 https://t.co/lIwEcsMFgt",
        "id_str": "1786289589612683318"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 06:00:00 +0000 2024",
        "full_text": "The last Neanderthals mysteriously died out around 40,000 years ago, just a few thousand years after humans arrived. The latest discovery is thought to be the best preserved Neanderthal find this century. https://t.co/tkf440uDxg https://t.co/2SbJGX3k58",
        "id_str": "1786274490319511857"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 05:05:00 +0000 2024",
        "full_text": "An orphaned bear cub is doing well two weeks after she was pulled from a tree by a group of people apparently looking to take pictures with her, an animal rescue said. https://t.co/U7QDY1hpNz",
        "id_str": "1786260649766465649"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 04:05:00 +0000 2024",
        "full_text": "A 9-year-old's heroic act saves his parents after a recent Oklahoma tornado: \"Please don't die, I will be back\" https://t.co/WnLgTeRUgp",
        "id_str": "1786245549886185595"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 03:35:00 +0000 2024",
        "full_text": "A rare white killer whale nicknamed \"Frosty\" was spotted off the California coast. https://t.co/IhDn9r5ouN",
        "id_str": "1786237998582915269"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 03:05:00 +0000 2024",
        "full_text": "Extreme heat is expected in the U.S. this summer. Here’s where hotter-than-normal temperatures are likely. https://t.co/vaGMu8LhGy",
        "id_str": "1786230451981435390"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 02:45:23 +0000 2024",
        "full_text": "At least 1 dead, 1 injured in house explosion in New Jersey. Watch video over the scene. https://t.co/GWuGEgLTem",
        "id_str": "1786225515243683970"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 02:35:00 +0000 2024",
        "full_text": "An orangutan named Rakus appeared to treat a wound with medicine from a tropical plant— the latest example of how some animals attempt to soothe their own ills with remedies, according to a new study. https://t.co/Nrko1ivHED https://t.co/VkNwVFZunG",
        "id_str": "1786222898723590411"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 02:06:57 +0000 2024",
        "full_text": "The second week of former president Donald Trump’s criminal “hush money” trial saw potential gag order violations and a testimony from the lawyer who represented Karen McDougal and Stormy Daniels at the time of the alleged payments. https://t.co/blbRwRrKTC https://t.co/47cJVQ6gtq",
        "id_str": "1786215842448887959"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 00:42:01 +0000 2024",
        "full_text": "CBS News investigation: Republican Rep. Troy Nehls of Texas made claims about his military career that contradict official documents. https://t.co/NZ6J2qRk0m",
        "id_str": "1786194465129938953"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 00:40:00 +0000 2024",
        "full_text": "Peloton, known for its tech-enabled stationary bikes and treadmills, announced its CEO is stepping down from his roles as CEO, president and board director. The company also announced it is cutting 15% of its staff or 400 employees. https://t.co/mc2w6SEohN",
        "id_str": "1786193961566024150"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 00:20:00 +0000 2024",
        "full_text": "New Jersey Sen. Bob Menendez wants a psychiatrist to testify about his habit of stockpiling cash, his attorneys said Wednesday. https://t.co/EUAMXSaJir",
        "id_str": "1786188925792403892"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Fri May 03 00:00:00 +0000 2024",
        "full_text": "Russian military personnel entered an airbase in Niger where some U.S. troops are located, two U.S. officials confirmed to CBS News. https://t.co/R1b4uwMDUL",
        "id_str": "1786183894791868738"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:40:00 +0000 2024",
        "full_text": "I-95 in Norwalk, Connecticut is closed in both directions and may not reopen for days after a fuel truck crashed and burst into flames under an overpass Thursday morning. https://t.co/qo1d4gFA6V",
        "id_str": "1786178859039130018"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:20:01 +0000 2024",
        "full_text": "RT @CBSEveningNews: Stormy Daniels' former Attorney Keith Davidson testified in Donald Trump's New York criminal trial on Thursday, reveali…",
        "id_str": "1786173832547422569"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:06:38 +0000 2024",
        "full_text": "RT @CBSEveningNews: “There's the right to protest, but not the right to cause chaos,” President Biden said Thursday regarding the violence…",
        "id_str": "1786170462617170014"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:06:36 +0000 2024",
        "full_text": "RT @CBSEveningNews: Police used rubber bullets and flash bangs overnight at UCLA to disperse groups of protesters and dismantle on-campus e…",
        "id_str": "1786170454111027251"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:06:34 +0000 2024",
        "full_text": "RT @CBSEveningNews: Interstate 95 in Norwalk, Connecticut will remain closed for several days following a fiery multi-vehicle crash involvi…",
        "id_str": "1786170444933988510"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:06:32 +0000 2024",
        "full_text": "RT @CBSEveningNews: Arizona Gov. Katie Hobbs signed a bill repealing an 1864 law that had effectively banned nearly all abortions in the st…",
        "id_str": "1786170436343984224"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:06:29 +0000 2024",
        "full_text": "RT @CBSEveningNews: Nearly 40 million people in Texas are on alert for flash flooding after days of torrential rain and severe weather poun…",
        "id_str": "1786170424016945241"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:06:23 +0000 2024",
        "full_text": "RT @CBSEveningNews: Rep. Marjorie Taylor Greene says she plans to move forward with an effort to remove House Speaker Mike Johnson. In an u…",
        "id_str": "1786170399169949747"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:06:20 +0000 2024",
        "full_text": "RT @CBSEveningNews: The body of a fifth construction worker killed in the Baltimore Francis Scott Key Bridge collapse has been recovered fr…",
        "id_str": "1786170389107794308"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:06:18 +0000 2024",
        "full_text": "RT @CBSEveningNews: The average rate on a 30-year mortgage increased by a fraction to more than 7.2% — the highest level in more than five…",
        "id_str": "1786170380396187950"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:06:16 +0000 2024",
        "full_text": "RT @CBSEveningNews: Trillions of cicadas are emerging from the Midwest to the East Coast after spending more than a decade underground. In…",
        "id_str": "1786170372519235727"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:06:14 +0000 2024",
        "full_text": "RT @CBSEveningNews: Florida police officers and a courageous good Samaritan who swiftly responded to a burning home in Cape Coral were hono…",
        "id_str": "1786170363098829042"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 23:00:01 +0000 2024",
        "full_text": "Heather Pressdee, the Pennsylvania nurse charged with killing multiple nursing home residents and trying to kill more than a dozen others, pleaded guilty in court Thursday morning. https://t.co/5cIolxu0Zi",
        "id_str": "1786168795981046027"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 22:45:00 +0000 2024",
        "full_text": "The candidate who finished first in the Republican nomination primary race for a North Carolina congressional seat says she's suspending her campaign, citing her rival's endorsement by former President Donald Trump in the runoff election. https://t.co/FXK7eGbMp3",
        "id_str": "1786165020235075926"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 22:33:36 +0000 2024",
        "full_text": "Prosecutors in former President Trump's criminal trial urged the judge to penalize Trump for more alleged violations of a gag order.\n\n\"I do see the possibility that Trump would be incarcerated, however briefly, by this judge for continued violations,\" former Trump White House… https://t.co/0OEHZj9Y0E",
        "id_str": "1786162151339532374"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 22:31:46 +0000 2024",
        "full_text": "As early voting begins in Maryland, Prince George's County Executive Angela Alsobrooks is vying for the Democratic nomination in the state's Senate race, in what could be a matchup against former GOP Maryland Gov. Larry Hogan. \n\n\"I feel really confident that the seat will remain… https://t.co/VY2xnm7Iuw",
        "id_str": "1786161689357922797"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 22:21:01 +0000 2024",
        "full_text": "Former President Trump's criminal trial in New York began Thursday with a second gag order hearing. Plus- Stormy Daniels' ex-lawyer Keith Davidson continued his testimony, detailing fallout from the \"hush money\" payment at the center of the case.\n\nHere's the court takeaways: https://t.co/c4nSfa92bR",
        "id_str": "1786158984392548648"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 22:00:03 +0000 2024",
        "full_text": "WATCH LIVE: The Daily Report with John Dickerson spotlights reporting and interviews on the day's events https://t.co/0MGCIhM13t https://t.co/5ekf21CI7n",
        "id_str": "1786153708939559000"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 22:00:00 +0000 2024",
        "full_text": "Democratic Arizona Gov. Katie Hobbs has signed a bill to undo a long-dormant law that bans all abortions except those done to save a patient's life, but the ban is still in effect until the fall.\n https://t.co/qCURDd9F18",
        "id_str": "1786153696255963176"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 21:40:00 +0000 2024",
        "full_text": "An arsonist set fire to at least 15 police cars at a training facility in northeastern Portland, Oregon, early Thursday morning, authorities said. No one was injured.\n\n https://t.co/XCf6ddbmZR",
        "id_str": "1786148659832164853"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 21:20:00 +0000 2024",
        "full_text": "The operator of a retirement facility in Columbus, Georgia, will have to pay $78,000 to a receptionist to settle an age and disability discrimination lawsuit filed by the Equal Employment Opportunity Commission. https://t.co/CKQqZXRwx9",
        "id_str": "1786143628781314250"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 21:01:39 +0000 2024",
        "full_text": "WATCH LIVE: \"America Decides\" has the latest political news, analysis and original reporting  https://t.co/N5oZfxvFs3\n\n https://t.co/HGloHsGfz0",
        "id_str": "1786139011125272731"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 21:00:01 +0000 2024",
        "full_text": "Israel's Prime Minister Benjamin Netanyahu is determined to launch a ground offensive in Rafah. Here's why, and why it matters. https://t.co/2WN8ovpoZJ",
        "id_str": "1786138596937805967"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 20:51:54 +0000 2024",
        "full_text": "The Biden administration is exploring options to resettle some Palestinians from Gaza in the U.S., with refugee status that would allow benefits including a pathway to American citizenship.\n\nCBS News' @camiloreports details what's being considered. https://t.co/rFFWTZlL4T https://t.co/YCetnVbxB8",
        "id_str": "1786136557436485720"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 20:40:00 +0000 2024",
        "full_text": "A whistleblower who identified engineering problems at the company that supplied Boeing with airliner fuselages died on Monday, CBS News has learned, after suffering from a fast-spreading infection. \n\n https://t.co/Wq4xiDONUZ",
        "id_str": "1786133560740516040"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 20:20:00 +0000 2024",
        "full_text": "Florida health regulators issued a new rule Thursday clarifying exceptions to the state's six-week abortion ban, detailing the treatments allowed for certain medical conditions that jeopardize the health of the pregnant woman and fetus. https://t.co/4rcXQzSSLs",
        "id_str": "1786128529198919933"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 20:00:01 +0000 2024",
        "full_text": "An elderly man from Missouri was arrested on Monday for the murder of an 18-year-old woman nearly 60 years ago in a south suburb of Chicago. https://t.co/sypSLvciAK",
        "id_str": "1786123498487714141"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 19:40:00 +0000 2024",
        "full_text": "The IRS says it is about to ramp up audits as it cracks down on tax cheats and seeks to deliver more revenue into the U.S. Treasury's coffers. But not every group of taxpayers will face more scrutiny, according to IRS commissioner Danny Werfel.  https://t.co/IgQjncKsq3",
        "id_str": "1786118462831538384"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 19:20:01 +0000 2024",
        "full_text": "The captain of the dive boat Conception, which caught fire and killed all 33 of the boat's passengers and one crew member in 2019, faces sentencing in Los Angeles federal court Thursday.  https://t.co/0z0S0UzCpK",
        "id_str": "1786113431713489174"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 19:09:05 +0000 2024",
        "full_text": "Five people have died after drinking a poison potion in a Santeria \"power\" ritual. https://t.co/POE6kAFBp8",
        "id_str": "1786110679620964368"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 19:00:01 +0000 2024",
        "full_text": "Darren Reitz usually goes fishing for some “peace and quiet” – then he caught what he could only describe as a “monster.” It was a fish so big, it took nearly an hour and four people to reel it in – and it may have broken a U.K. record. https://t.co/geQwXxOtiV https://t.co/UK7dCbzIBA",
        "id_str": "1786108399467278677"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 16:34:23 +0000 2024",
        "full_text": "An orangutan appeared to treat a wound with medicine from a tropical plant— the latest example of how some animals attempt to soothe their own ills with remedies found in the wild, scientists reported Thursday. https://t.co/bnSYVcnwqj",
        "id_str": "1786071749584429350"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 16:25:16 +0000 2024",
        "full_text": "Nearly 8 tons of ground beef sold at Walmart recalled over possible E. coli contamination. https://t.co/49UIBIqOvW",
        "id_str": "1786069455065256237"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 16:24:00 +0000 2024",
        "full_text": "Almost a year later, the U.S. military has concluded that an airstrike last May in northwestern Syria killed a civilian, instead of a senior al Qaeda leader, as it initially claimed.  https://t.co/Ogje0SOjcR",
        "id_str": "1786069136549859385"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 16:15:00 +0000 2024",
        "full_text": "A British team of archaeologists revealed the reconstructed face of a 75,000-year-old Neanderthal woman, as researchers reappraise the perception of the species as brutish and unsophisticated.   https://t.co/7LrCFjdqRm",
        "id_str": "1786066874012217742"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 16:05:08 +0000 2024",
        "full_text": "President Biden called longtime ally Japan \"xenophobic,\" along with China and Russia, blaming their economies' recent performances on racial prejudice. https://t.co/wnmBgP0AQV https://t.co/jdS2lALhGq",
        "id_str": "1786064388274672114"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 16:00:04 +0000 2024",
        "full_text": "A field of 20 horses is set to launch from the starting gate for the 2024 Kentucky Derby on Saturday.  https://t.co/yIOSi6udx4",
        "id_str": "1786063112300327118"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:55:00 +0000 2024",
        "full_text": "Ariana Grande, Drake, Lady Gaga and Rihanna are just some of the artists returning to TikTok — where Taylor Swift's music recently reappeared — with Universal Music Group and TikTok announcing a licensing deal ending a months-long spat. \n https://t.co/iNXmmSx69U",
        "id_str": "1786061837554909554"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:50:00 +0000 2024",
        "full_text": "Actor Halle Berry joined a group of bipartisan senators to announce new legislation to promote menopause research, training and education.  https://t.co/ykt0xylt2Z",
        "id_str": "1786060581721506103"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:49:53 +0000 2024",
        "full_text": "RT @NorahODonnell: This Congress will likely be the least productive since the Civil War. To understand why, we sat down with House Minorit…",
        "id_str": "1786060550872445216"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:40:00 +0000 2024",
        "full_text": "Darren Reitz usually goes fishing for some \"peace and quiet\" – then he caught what he could only describe as a \"monster.\" \n\nIt was a fish so big, it may have broken a U.K. record. \n\n https://t.co/YBWAg9bnpa",
        "id_str": "1786058065004961965"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:33:03 +0000 2024",
        "full_text": "BREAKING: President Biden condemns violence at campus protests, but says the National Guard should not intervene.  https://t.co/yBHejceDHw",
        "id_str": "1786056316403769462"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:32:07 +0000 2024",
        "full_text": "Reporter asks President Biden about the college campus demonstrations over the war in Gaza: \"Have the protests forced you to reconsider any of the policies with regard to the region?\"\n\nBiden: \"No.\"\n\nHe also says he does not think the National Guard should intervene. https://t.co/vsRKwV9ndp",
        "id_str": "1786056080159547547"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:25:33 +0000 2024",
        "full_text": "\"Violent protest is not protected. Peaceful protest is,\" Pres. Biden says about protests at colleges across the country.\n\n\"Vandalism, trespassing, breaking windows, shutting down campuses, forcing the cancellation of classes and graduations — none of this is a peaceful protest.\" https://t.co/41GRyQFPRX",
        "id_str": "1786054429730279894"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:15:00 +0000 2024",
        "full_text": "Police searching for clandestine crematorium in Mexico say bones found around charred pit are of \"animal origin\"  https://t.co/tQvghJZA9A",
        "id_str": "1786051771049115690"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:09:08 +0000 2024",
        "full_text": "WATCH LIVE: President Biden gives remarks on protests happening on U.S. college campuses over the war in Gaza. https://t.co/P6CoVJwxT2",
        "id_str": "1786050298030563829"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:01:04 +0000 2024",
        "full_text": "RT @CBSMornings: Jeff Daniels says his new role in @Netflix’s “A Man in Full” is one of his most challenging yet.\n\nHe tells CBS Mornings wh…",
        "id_str": "1786048266116730911"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:00:46 +0000 2024",
        "full_text": "RT @CBSMornings: MOTHER’S DAY GIFTS: From music lovers to home cooks to aspiring gardeners, @amazonbooks’ editorial director Sarah Gelman s…",
        "id_str": "1786048189738434687"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:00:40 +0000 2024",
        "full_text": "RT @CBSMornings: Parts of Texas could see several more inches of rain as severe storms move across the state.\n\n@WeatherChannel's @JimCantor…",
        "id_str": "1786048165034000720"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 15:00:02 +0000 2024",
        "full_text": "Meet Shanidar Z, a 75,000-year-old Neanderthal woman whose skull was found “as flat as a pizza” in a cave in 2018. Archaeologists have been reconstructing her face ever since as mystery surrounds her story. https://t.co/auPTjf7Skh https://t.co/c0DvCsNKuq",
        "id_str": "1786048008183824787"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 14:48:05 +0000 2024",
        "full_text": "Prosecutors in Donald Trump's criminal trial in New York urged the judge to penalize the defendant for more alleged violations of a gag order limiting what he can say about those involved in the case.  https://t.co/MOJrsFmITg",
        "id_str": "1786044997109707152"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 14:45:00 +0000 2024",
        "full_text": "U.S. pregnancy-related deaths have fallen back to pre-pandemic levels, new government data suggests.  https://t.co/IqVOaK1wRR",
        "id_str": "1786044223436836943"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 14:30:00 +0000 2024",
        "full_text": "Dangerous concentrations of long-lingering \"forever chemicals\" have been found in surface and groundwater worldwide, according to a study released in April that showed Australia, the U.S. and Europe as hotspots.  https://t.co/je572JwPyK",
        "id_str": "1786040448068243573"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 14:15:00 +0000 2024",
        "full_text": "Rosie O'Donnell revealed she is joining the cast of the \"Sex and the City\" spinoff \"And Just Like That...\" \n https://t.co/GStdiCVH1T",
        "id_str": "1786036672796262841"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 14:02:14 +0000 2024",
        "full_text": "Police are detaining protesters after clearing out pro-Palestinian encampment at UCLA campus.\n\nStream CBS Los Angeles' coverage now: https://t.co/UAjL4FkTAq",
        "id_str": "1786033461964251539"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 14:00:02 +0000 2024",
        "full_text": "Sinkholes don’t just happen on land, they also happen in the ocean where they’re known as blue holes. And now, researchers say they’ve found the deepest known one on the planet – and it’s so large that they can’t even get to the bottom. https://t.co/HF2hsWONO3 https://t.co/LxliR0UXu2",
        "id_str": "1786032908546838972"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 13:57:31 +0000 2024",
        "full_text": "RT @CBSMornings: .@walkerhayes’ music is known for being lighthearted and fun — but a close listen reveals a story of struggle, addiction a…",
        "id_str": "1786032274334491049"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 13:57:11 +0000 2024",
        "full_text": "RT @CBSMornings: At least 100 police officers are slowly working their way into a pro-Palestinian encampment on UCLA’s campus, as protester…",
        "id_str": "1786032188665815204"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 13:57:10 +0000 2024",
        "full_text": "RT @CBSMornings: Hundreds of police officers are raiding an encampment of pro-Palestinian protesters on UCLA’s campus, a day after counter-…",
        "id_str": "1786032183917855159"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 13:57:08 +0000 2024",
        "full_text": "RT @CBSMornings: For the first time since 1803, two types of cicadas will emerge above ground across Illinois — a cycle that aligns every 2…",
        "id_str": "1786032176196124889"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 13:57:05 +0000 2024",
        "full_text": "RT @CBSMornings: “We are trying to make climate change a top issue in American politics”: Climate Defiance is taking direct action to make…",
        "id_str": "1786032164468916656"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 13:57:02 +0000 2024",
        "full_text": "RT @CBSMornings: Large crowds blocked off Tel Aviv’s main highway, demanding a deal to bring Israeli hostages home.\n\nThey are pleading with…",
        "id_str": "1786032152150200568"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 13:57:00 +0000 2024",
        "full_text": "RT @CBSMornings: Water levels in some areas of Southeast Texas are nearly as high as they were during Hurricane Harvey.\n\nFlooding has swamp…",
        "id_str": "1786032144390697263"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 13:56:58 +0000 2024",
        "full_text": "RT @CBSMornings: Former Pres. Donald Trump returned to the campaign trail, highlighting his role in overturning Roe v. Wade during rallies…",
        "id_str": "1786032134420918386"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 13:56:56 +0000 2024",
        "full_text": "RT @CBSMornings: Arizona’s Republican-controlled Senate narrowly voted to repeal a 160-year-old abortion ban.\n\nThe governor is expected to…",
        "id_str": "1786032126468456812"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 13:45:13 +0000 2024",
        "full_text": "Police moved in to clear people out of the encampment at UCLA on Thursday after they declared it an unlawful assembly following violent clashes between pro-Palestinian protesters and counter protesters. https://t.co/AIjfzTe3nM https://t.co/DZCi3GkSGA",
        "id_str": "1786029177482719557"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 13:32:20 +0000 2024",
        "full_text": "The Prince and Princess of Wales released a new photo of their daughter Princess Charlotte on Thursday, taken by Princess Kate, to celebrate her 9th birthday. https://t.co/1wKU7i1hCZ https://t.co/TeBx4Aq50k",
        "id_str": "1786025934623047960"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 13:00:01 +0000 2024",
        "full_text": "The death toll from a highway in southeastern China that collapsed after a month of heavy rains climbed to 48 on Thursday as searchers dug for a second day through a treacherous and mountainous area.  https://t.co/XNTPn0l8zl",
        "id_str": "1786017802463113567"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 12:47:49 +0000 2024",
        "full_text": "Much of Asia is sweltering under a heat wave that's killed dozens – and that one expert calls \"by far the most extreme event in world climatic history.\" https://t.co/tiepA7HQSo",
        "id_str": "1786014734472351904"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 12:34:53 +0000 2024",
        "full_text": "Set sail on the \"Big Nude Boat,\" the naked cruise offering a trip from Florida to \"bare-adise.\"  https://t.co/6kMOIei2F0",
        "id_str": "1786011476886425793"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 12:15:00 +0000 2024",
        "full_text": "Pres. Biden's campaign is launching a new seven-figure ad buy centered around abortion, a centerpiece issue for his campaign, as it attempts to link restrictive state abortion bans to fmr. Pres. Trump.  https://t.co/68u5iSKEg3",
        "id_str": "1786006474130407831"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 12:00:00 +0000 2024",
        "full_text": "A 21-year-old Utah woman has been arrested and charged with murder after a friend was shot in what police said was an uncompleted suicide pact the women had reached several weeks earlier. https://t.co/fzSvhYTMef",
        "id_str": "1786002698539524154"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 11:30:00 +0000 2024",
        "full_text": "Abortion access is defining key New York congressional races.\n https://t.co/Rasic4Pciy",
        "id_str": "1785995150289674510"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 11:19:40 +0000 2024",
        "full_text": "Coming up on CBS News: \n\n🔘Arizona lawmakers vote to repeal Civil War-era ban on nearly all abortions \n\n🏳️‍🌈United Methodist Church lifts its ban on LGBTQ+ clergy\n\n🧑‍🎨Fmr. Pres. George W. Bush’s art to go on display at Disney World https://t.co/Wh6ffnioVJ",
        "id_str": "1785992550467182985"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 11:00:00 +0000 2024",
        "full_text": "An attorney who represented two women seeking payments in 2016 for their silence about alleged sexual encounters with Donald Trump will continue his testimony today. https://t.co/0eIgPjNYk1",
        "id_str": "1785987598587998368"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 10:30:00 +0000 2024",
        "full_text": "Hundreds of pro-Palestinian protesters remained behind barricades on the UCLA campus early Thursday after police apparently moved in on their camp, then pulled back. https://t.co/lXxBKdNmsx",
        "id_str": "1785980051911033008"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 10:00:00 +0000 2024",
        "full_text": "This week, pro-Palestinian protesters took over Columbia University's Hamilton Hall, renaming it \"Hind's Hall,\" after a 6-year-old Palestinian girl who was killed in Gaza in January. But this isn't the first time protesters have taken over that building in Columbia's history. https://t.co/FwaxTsMDRB",
        "id_str": "1785972502306398359"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 09:00:00 +0000 2024",
        "full_text": "A United Airlines passenger got \"belligerent\" with flight attendants. Here's what that will cost him. https://t.co/eosNNw1m0c",
        "id_str": "1785957401738231987"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 08:00:02 +0000 2024",
        "full_text": "New NASA images show iconic horse-shaped nebula in unprecedented detail. https://t.co/esDSf9HFEd",
        "id_str": "1785942307641987484"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 07:00:03 +0000 2024",
        "full_text": "More than half of cats died after drinking raw milk from bird flu-infected cows. https://t.co/cxV16vxcx0",
        "id_str": "1785927213113545109"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 06:30:00 +0000 2024",
        "full_text": "Dueling groups of pro-Palestinian protesters and pro-Israel counterprotesters clashed Wednesday at UCLA, breaking out in fistfights, tearing down encampment barricades and using objects to beat one another. https://t.co/eLTOkdLARP https://t.co/rlM40wLHDx",
        "id_str": "1785919651999821868"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 06:00:01 +0000 2024",
        "full_text": "Tests of ground beef purchased at retail stores have been negative for bird flu so far, the U.S. Department of Agriculture announced Wednesday. https://t.co/UpHfJRxf0R",
        "id_str": "1785912104836378924"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 05:00:01 +0000 2024",
        "full_text": "All your mammogram and breast cancer screening questions, answered by medical experts. https://t.co/7sCQekCKPs",
        "id_str": "1785897005161582872"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 04:00:00 +0000 2024",
        "full_text": "U.S. officials are bracing for another summer of dangerous heat. These maps show where it's most likely to happen. https://t.co/etZqqNU4cr",
        "id_str": "1785881902601097398"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 03:40:00 +0000 2024",
        "full_text": "An influencer ran a half marathon without registering. People were not happy. https://t.co/l0l9UQLujd",
        "id_str": "1785876870950510905"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 03:20:01 +0000 2024",
        "full_text": "Her toddler heard monsters in the wall. Turns out, the noise was more than 50,000 bees that produced 100 pounds of honeycomb. https://t.co/KsL7iQbN3q",
        "id_str": "1785871839257837570"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 03:00:00 +0000 2024",
        "full_text": "At least five people were injured, including four children, in a shooting in west Fort Worth, Texas, Tuesday night, authorities said. https://t.co/TvWiuDlCX6",
        "id_str": "1785866803391992173"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 02:40:00 +0000 2024",
        "full_text": "16,000 people with disabilities are in state-operated institutions. This is how experts say health care should change. https://t.co/3hoAFAvQhI",
        "id_str": "1785861771317629097"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 02:20:00 +0000 2024",
        "full_text": "Walmart is launching a new store brand called Bettergoods. Here what it's selling and the cost. https://t.co/NIUx1gM68F",
        "id_str": "1785856738983297289"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 02:00:00 +0000 2024",
        "full_text": "A famous white orca called \"Frosty\" was seen this week by a whale-watching tour group off the coast of Newport Beach in California.\n https://t.co/wxxGsA3pce",
        "id_str": "1785851703662662111"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 01:40:00 +0000 2024",
        "full_text": "CBS News medical contributor Dr. Céline Gounder explains why experts hope more aggressive screening guidelines will help address some concerning breast cancer trends. https://t.co/ypcQ2zsFR2",
        "id_str": "1785846672527933486"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 01:20:00 +0000 2024",
        "full_text": "Formula 1 champ Lewis Hamilton on driving his F1 car in NYC: \"It's a huge, huge deal.\" https://t.co/tCobgkHgJE",
        "id_str": "1785841636846534761"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 01:00:00 +0000 2024",
        "full_text": "MS-13 gang leader who prosecutors say turned D.C. area into \"hunting ground\" sentenced to life in prison https://t.co/oQiW28qRjy",
        "id_str": "1785836605250355302"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 00:40:01 +0000 2024",
        "full_text": "Arizona's Republican-controlled Senate on Wednesday voted to repeal a Civil War-era abortion ban, one week after a similar motion passed the GOP-controlled state House.  https://t.co/z09O0SRSw3",
        "id_str": "1785831573973070002"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 00:20:00 +0000 2024",
        "full_text": "Indonesia's Mount Ruang volcano spewed more hot clouds on Wednesday after an eruption the previous day forced the closure of schools and airports, pelted villages with volcanic debris and prompted hundreds of people to flee.  https://t.co/8C9ttep5qf",
        "id_str": "1785826538191036807"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Thu May 02 00:00:00 +0000 2024",
        "full_text": "9-year-old's heroic act saves parents after Oklahoma tornado: \"Please don't die, I will be back\" https://t.co/HOe8QvfoVH",
        "id_str": "1785821506997518513"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:40:00 +0000 2024",
        "full_text": "From Juliet to Cleopatra, Judi Dench revisits her Shakespearean legacy in new book\n https://t.co/KhdPqaor4Q",
        "id_str": "1785816471093850272"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:28:41 +0000 2024",
        "full_text": "\"I have definitely felt unsafe at times... I worry about my friends.\" A Jewish Columbia student tells CBS News that anti-Semitic language and what he perceives as a \"disregard for the experiences of Jewish students on campus\" have left him feeling unsafe. https://t.co/El8Psusd8h",
        "id_str": "1785813624633647154"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:25:08 +0000 2024",
        "full_text": "RT @CBSEveningNews: Florida now stands among 12 other states in the region with total or near-total abortion bans following the enactment o…",
        "id_str": "1785812732207382628"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:25:05 +0000 2024",
        "full_text": "RT @CBSEveningNews: UnitedHealth Group’s CEO testified on Capitol Hill that the company paid a $22 million ransom to Russian-linked cybercr…",
        "id_str": "1785812718416482607"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:20:00 +0000 2024",
        "full_text": "Sinkholes don't just happen on land, they also happen in the ocean where they're known as blue holes. And now, researchers say they've found the deepest one yet on the planet – one so large that they can't even get to the bottom.  https://t.co/vY8w4dcuk5",
        "id_str": "1785811439845880203"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:19:21 +0000 2024",
        "full_text": "RT @CBSEveningNews: Working parents are struggling to find affordable summer activity options for their children as camp costs soar due to…",
        "id_str": "1785811273449427183"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:19:19 +0000 2024",
        "full_text": "RT @CBSEveningNews: Beekeeper Matt Hilton had the honor of throwing the first pitch at the Diamondbacks-Dodgers game on Tuesday for putting…",
        "id_str": "1785811265404723247"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:11:49 +0000 2024",
        "full_text": "RT @CBSEveningNews: A 30-year-old man has been fined $20,000 after causing a United Airlines flight from London to New Jersey to be diverte…",
        "id_str": "1785809380396380236"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:10:38 +0000 2024",
        "full_text": "RT @CBSEveningNews: During a court appearance on Wednesday, New York prosecutors asked for a September retrial for disgraced movie mogul Ha…",
        "id_str": "1785809083662000623"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:10:32 +0000 2024",
        "full_text": "RT @CBSEveningNews: The Federal Reserve said on Wednesday it is keeping its benchmark interest rate in a range of 5.25% to 5.5%, the level…",
        "id_str": "1785809056600354947"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:10:30 +0000 2024",
        "full_text": "RT @CBSEveningNews: Violence broke out between groups of protesters at UCLA amid clashes over the conflict in Gaza. Protesters were arreste…",
        "id_str": "1785809047360323652"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:10:27 +0000 2024",
        "full_text": "RT @CBSEveningNews: Secretary of State Antony Blinken renewed calls for a cease-fire agreement between Hamas and Israel, saying that the U.…",
        "id_str": "1785809036350210224"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:10:17 +0000 2024",
        "full_text": "RT @CBSEveningNews: The central U.S. is preparing for another round of severe storms, with the potential for tornadoes, strong wind gusts,…",
        "id_str": "1785808995321520360"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:10:15 +0000 2024",
        "full_text": "RT @CBSEveningNews: An active shooter was \"neutralized\" at a middle school near Madison, Wisconsin, according to school officials. Authorit…",
        "id_str": "1785808983695020071"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 23:00:00 +0000 2024",
        "full_text": "An orphaned bear cub is doing well two weeks after she was pulled from a tree by a group of people apparently looking to take pictures with her, an animal rescue said Tuesday.  https://t.co/uVRmMvlmyB",
        "id_str": "1785806404458041617"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 22:40:00 +0000 2024",
        "full_text": "A 36-year-old man was charged with murder Wednesday in London after allegedly attacking members of the public and two police officers with a sword, London's Metropolitan Police said. https://t.co/PpZGIGlRX7",
        "id_str": "1785801372798988460"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 22:30:07 +0000 2024",
        "full_text": "As debate continues over how to address the migrant crisis at the U.S. southern border, @camiloreports traveled to Juarez, Mexico to take a look at the humanitarian toll its taking on those seeking asylum. https://t.co/VcsnF6xdDB",
        "id_str": "1785798885635428862"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 22:20:00 +0000 2024",
        "full_text": "The start of Tuesday night's game between the Los Angeles Dodgers and Arizona Diamondbacks was delayed nearly two hours after a bee colony swarmed the top of the protective netting directly behind home plate. https://t.co/PSokihSeSC",
        "id_str": "1785796341282533703"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 22:11:04 +0000 2024",
        "full_text": "WATCH LIVE: The Daily Report with John Dickerson spotlights reporting and interviews on the day's events https://t.co/65NDumzX6j https://t.co/ghL4qlXz1m",
        "id_str": "1785794091923448174"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 21:54:45 +0000 2024",
        "full_text": "The Biden admin. has \"absolutely not\" taken enough action to address concerns over the war in Gaza, Dearborn, Michigan Mayor Abdullah Hammoud says.\n\n\"I do believe that the war that is unfolding...is going to be a top-of-mind issue for the deciding electorate, come November.\" https://t.co/LXgypNKJym",
        "id_str": "1785789986350019058"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 21:42:34 +0000 2024",
        "full_text": "Arizona's Republican-controlled Senate has voted Wednesday to repeal the state's Civil War-era abortion ban. Two Republicans joined all 14 Democrats to pass the measure, sending it to Democratic Gov. Katie Hobbs' desk, @JanetShamlian reports. https://t.co/2pgVeljBpc",
        "id_str": "1785786918333993313"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 21:40:00 +0000 2024",
        "full_text": "School officials say that an active shooter was \"neutralized\" at a middle school west of Madison, Wisconsin, Wednesday morning, with no reported injuries to those inside the school. But the event has left the small community shaken. https://t.co/h07ABHNhnK",
        "id_str": "1785786273497595983"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 21:20:01 +0000 2024",
        "full_text": "Rep. Marjorie Taylor Greene has dangled the threat of removing Mike Johnson as House speaker since late March after he relied on Democrats to push through a $1.2 trillion spending bill to avert a partial government shutdown. https://t.co/N1rcBM9Pmi",
        "id_str": "1785781242312495337"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 21:00:31 +0000 2024",
        "full_text": "WATCH LIVE: \"America Decides\" has the latest political news, analysis and original reporting  https://t.co/N5oZfxvFs3\n\n https://t.co/cLXyRMrrX7",
        "id_str": "1785776337178722403"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 21:00:00 +0000 2024",
        "full_text": "Volunteer searchers said they have found a clandestine crematorium on the edge of Mexico City, the latest grim discovery in a nation where more than 100,000 people are listed as officially missing. https://t.co/wFVyHjOhnR",
        "id_str": "1785776206140375441"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 20:45:44 +0000 2024",
        "full_text": "Arizona's Republican-controlled Senate has voted to repeal a Civil War-era abortion ban, one week after a similar motion passed the GOP-controlled state House. https://t.co/9r9u66ScW0",
        "id_str": "1785772618403950642"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 20:40:00 +0000 2024",
        "full_text": "Prosecutors asked for a September retrial for Harvey Weinstein during a hearing at a Manhattan courthouse Wednesday, the disgraced movie mogul's first appearance since his 2020 rape conviction was overturned by an appeals court last week. https://t.co/absYhtIlmz",
        "id_str": "1785771174447710293"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 20:35:13 +0000 2024",
        "full_text": "RT @CBSEveningNews: Here's a look at what's coming up on the CBS Evening News with @NorahODonnell at 6:30 p.m. ET. https://t.co/5zrjBgvFL3",
        "id_str": "1785769969537401114"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 20:20:00 +0000 2024",
        "full_text": "Post positions for the 2024 Kentucky Derby were updated after a horse scratched from the race. https://t.co/chS7Z5c7Z1",
        "id_str": "1785766142667104379"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 20:00:01 +0000 2024",
        "full_text": "Judi Dench has tackled nearly every female role in William Shakespeare's plays, from Juliet to Cleopatra, in her seven-decade career. Now, she explores her connection with Shakespeare in the book \"Shakespeare: The Man Who Pays the Rent.\" https://t.co/O90YOFyGE3",
        "id_str": "1785761110655721780"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 19:40:00 +0000 2024",
        "full_text": "Results of tests run by the Food and Drug Administration show that pasteurization is working to kill off bird flu in milk and other dairy products, the agency says. https://t.co/uuBZvLYHl2",
        "id_str": "1785756073992818741"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 19:30:10 +0000 2024",
        "full_text": "\"We don't even know what data was stolen,\" Senator Wyden tells UnitedHealth Group CEO Andrew Witty, during a congressional hearing on the cyberattack that exposed millions of Americans' confidential medical information. \"Your company, on your watch, let the country down.\" https://t.co/T2MyUIZ2MN",
        "id_str": "1785753599001125004"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 19:26:11 +0000 2024",
        "full_text": "Rep. Marjorie Taylor Greene says she's moving forward with her threat to oust House Speaker Mike Johnson. \n\nBut Johnson says he's not worried about losing his job, and even Democratic leaders say they won't support Greene's move.\n\n@NikolenDC reports: https://t.co/2tD2eWrs4z",
        "id_str": "1785752598697410653"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 19:21:46 +0000 2024",
        "full_text": "As Democrats play defense in U.S. Senate races, two battleground-state incumbents are ahead in their reelection campaigns, CBS News polling shows. Bob Casey in Pennsylvania and Tammy Baldwin in Wisconsin are leading their lesser-known GOP challengers. https://t.co/g8aHkHC0vB",
        "id_str": "1785751484325343380"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 18:09:07 +0000 2024",
        "full_text": "Federal Reserve holds rates steady. Here's what that means for your money. https://t.co/VLkcyOq8K7",
        "id_str": "1785733202973180164"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 18:02:07 +0000 2024",
        "full_text": "Johnson &amp; Johnson offers to pay $6.5 billion to settle talc ovarian cancer lawsuits https://t.co/5a0UHNVB3l",
        "id_str": "1785731439843045531"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 18:00:01 +0000 2024",
        "full_text": "Tourists were evacuated by helicopter on Wednesday from Kenya's Maasai Mara National Reserve as devastating flooding in the east African nation hit the renowned wildlife sanctuary. https://t.co/0F73HGTyQ2",
        "id_str": "1785730912115707918"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 17:45:00 +0000 2024",
        "full_text": "The CEO of UnitedHealth Group defended his unilateral decision to pay ransom in the midst of a major cyberattack against the company earlier this year.  https://t.co/ltgnB7lClo",
        "id_str": "1785727134796763383"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 17:41:15 +0000 2024",
        "full_text": "The main reason why self-driving cars are not ready for prime time https://t.co/9xb3z684ZC",
        "id_str": "1785726189241307147"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 17:30:00 +0000 2024",
        "full_text": "Researchers found the planet's deepest under-ocean sinkhole – and it's so big, they can't get to the bottom. https://t.co/56f7EJKGBN",
        "id_str": "1785723358769791415"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 17:15:00 +0000 2024",
        "full_text": "Arizona's Republican-controlled Senate is set to vote on repealing a Civil War-era abortion ban, one week after a similar motion passed the GOP-controlled state House.  https://t.co/yTuXcrK3jF",
        "id_str": "1785719583011209671"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 17:08:40 +0000 2024",
        "full_text": "A famous white orca called \"Frosty\" was seen this week by a whale-watching tour group off the coast of Newport Beach in California. https://t.co/4ogHojSpko",
        "id_str": "1785717989439848741"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 16:49:41 +0000 2024",
        "full_text": "Video shows the damage inside of Columbia University's Hamilton Hall after police cleared pro-Palestinian protesters who had seized the academic building early Tuesday morning. More than 100 arrests were made. https://t.co/i6IdfWxW7i https://t.co/isZrvRPhk4",
        "id_str": "1785713211213316447"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 16:43:53 +0000 2024",
        "full_text": "RT @CBSMornings: Lulu Cheng and Lacey Benard started their company, Bitty Bao, in 2020, after struggling to find Chinese learning books for…",
        "id_str": "1785711752144928798"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 16:30:00 +0000 2024",
        "full_text": "A 2021 jet fuel leak from the U.S. military's Red Hill fuel storage facility sickened Hawaiians and military families. But it wasn’t the first incident – and the problem goes back years: \"There were a number of warnings.\" https://t.co/LuTR2Q0Vx6",
        "id_str": "1785708260290420980"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 16:00:05 +0000 2024",
        "full_text": "Police ended pro-Palestinian protesters' occupation of a Columbia University building, but violence erupted at UCLA and the University of Arizona in Tucson as schools stepped up efforts to end demonstrations.  https://t.co/3B4l577HYT",
        "id_str": "1785700728683561284"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 15:45:00 +0000 2024",
        "full_text": "The British government released video clips of what it said were the first detentions of migrants in the country without permission under a highly controversial new program that aims to deport them to Rwanda.  https://t.co/PNo9IE9aWb",
        "id_str": "1785696933270503885"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 15:42:02 +0000 2024",
        "full_text": "The Biden administration is forgiving $6.1 billion in student debt for 317,000 people who attended The Art Institutes, a for-profit chain of schools that shut down last fall amid allegations of fraud.  https://t.co/83uutSjBbW",
        "id_str": "1785696188315869398"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 15:30:00 +0000 2024",
        "full_text": "Mayor Eric Adams said approximately 300 people were arrested when police responded to protests at Columbia and nearby City College of New York.   https://t.co/QuJtWPtXyC",
        "id_str": "1785693161664180230"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 15:25:58 +0000 2024",
        "full_text": "United Methodists overwhelmingly vote to repeal longstanding ban on LGBTQ clergy  https://t.co/uy2FhJTb5H",
        "id_str": "1785692142922260786"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 15:00:03 +0000 2024",
        "full_text": "A nationwide survey by the Trevor Project found that more than one in 10 young people in the United States who identify as LGBTQ attempted suicide in 2023.  https://t.co/X8Sk0oHdg8",
        "id_str": "1785685623732347301"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 14:37:11 +0000 2024",
        "full_text": "Breast cancer screenings for women at average risk should be done every other year beginning at age 40, according to finalized guidance released Tuesday.\n\nThis means mammograms should start 10 years earlier than previously recommended.  https://t.co/2VAwrrDHUi",
        "id_str": "1785679866295181588"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 14:09:36 +0000 2024",
        "full_text": "NYPD Commissioner Edward Caban says “approximately 300 arrests” were made at Columbia University and City College of New York as officers were called into the remove protesters at the campuses once “public safety was a real concern.” https://t.co/PU5bipKWM0 https://t.co/AQsmvpCY7G",
        "id_str": "1785672925879599334"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 14:08:29 +0000 2024",
        "full_text": "New York City's Fifth Avenue transformed into a stage for a thrilling performance by seven-time Formula One world champion Lewis Hamilton.  https://t.co/avI8gHbKRg",
        "id_str": "1785672645180100912"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 14:01:14 +0000 2024",
        "full_text": "RT @CBSMornings: More details are being revealed about the circumstances of the ambush that killed four law enforcement officers in Charlot…",
        "id_str": "1785670819873505784"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 14:01:10 +0000 2024",
        "full_text": "RT @CBSMornings: Author @ProfEmilyOster, who has been helping women navigate pregnancy for more than a decade, is out with her fourth book,…",
        "id_str": "1785670802358022480"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 14:01:07 +0000 2024",
        "full_text": "RT @CBSMornings: New breast cancer screening guidelines may help clarify when to get mammograms — and help identify cancers early, when the…",
        "id_str": "1785670790790119916"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 14:01:03 +0000 2024",
        "full_text": "RT @CBSMornings: A new abortion law goes into effect today in Florida, sharply restricting the procedure after six weeks, before many women…",
        "id_str": "1785670773274812842"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 14:01:00 +0000 2024",
        "full_text": "RT @CBSMornings: Dame Judi Dench has played nearly every female character William Shakespeare wrote — and now, she’s written a book about h…",
        "id_str": "1785670762755457282"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 14:00:58 +0000 2024",
        "full_text": "RT @CBSMornings: F1 champion @LewisHamilton drove down Fifth Avenue on Tuesday to promote @MercedesAMGF1's partnership with @WhatsApp.\n\nIn…",
        "id_str": "1785670753951592901"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 13:37:29 +0000 2024",
        "full_text": "BREAKING: Rep. Marjorie Taylor Greene says she will force a vote to oust House Speaker Mike Johnson next week.  https://t.co/id22wkg83A",
        "id_str": "1785664842994532766"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 13:34:47 +0000 2024",
        "full_text": "WATCH LIVE: New York City Mayor Eric Adams gives update after more than 200 people were arrested at Columbia University. https://t.co/QSozKyzEQp https://t.co/RzPadB3FXT",
        "id_str": "1785664163890524475"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 13:30:00 +0000 2024",
        "full_text": "MS-13 gang leader who prosecutors say turned D.C. area into \"hunting ground\" sentenced to life in prison \n https://t.co/Kf3lllxL2h",
        "id_str": "1785662960049737783"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 13:17:08 +0000 2024",
        "full_text": "The NYPD released footage of officers entering Columbia University’s Hamilton Hall on Tuesday night at the request of the school. The building had been occupied by pro-Palestinian protesters, who had barricaded themselves inside. https://t.co/W8f43oFhLd https://t.co/v9rnVS2Yr7",
        "id_str": "1785659723359928654"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 13:15:01 +0000 2024",
        "full_text": "A section of a highway collapsed early Wednesday in southern China, sending cars tumbling and leaving at least 24 people dead, according to state media.  https://t.co/pAU0SeKxub",
        "id_str": "1785659188196126876"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 13:00:00 +0000 2024",
        "full_text": "Sec. of State Antony Blinken said in Israel on Wednesday that the U.S. is “determined” to see Hamas and Israel agree to a cease-fire as officials in Hamas-run Gaza say the conflict has killed more than 34,000 people. https://t.co/tfey7J3yBu",
        "id_str": "1785655409820180760"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 12:56:56 +0000 2024",
        "full_text": "RT @CBSMornings: Only on CBS Mornings, we’re revealing the annual @GoldHouseCo A100 list, recognizing the most impactful Asian-Pacific lead…",
        "id_str": "1785654640765198653"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 12:56:54 +0000 2024",
        "full_text": "RT @CBSMornings: .@NYCMayor says a “substantial number” of the pro-Palestinian protesters arrested Tuesday night were not CUNY or Columbia…",
        "id_str": "1785654632166850727"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 12:56:51 +0000 2024",
        "full_text": "RT @CBSMornings: One person died and dozens of homes were destroyed when a tornado ripped through the small city of Westmoreland in northea…",
        "id_str": "1785654617604263952"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 12:56:49 +0000 2024",
        "full_text": "RT @CBSMornings: The Justice Department is ready to reclassify marijuana as a less dangerous drug, sources tell CBS News.\n\nIt would acknowl…",
        "id_str": "1785654609354088480"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 12:30:00 +0000 2024",
        "full_text": "After a tornado suddenly tossed his family’s truck into trees, a 9-year-old boy managed to get out and run over a mile in the dark to get help for his severely injured parents. https://t.co/s830aLFkDt",
        "id_str": "1785647862438678861"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 12:12:45 +0000 2024",
        "full_text": "RT @CBSMornings: Aviva Siegel, a former hostage held by Hamas and the wife of Keith Siegel, an American hostage still being held, told @Ram…",
        "id_str": "1785643520499372156"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 12:12:43 +0000 2024",
        "full_text": "RT @CBSMornings: Police stormed Columbia’s campus in NYC to forcibly remove pro-Palestinian demonstrators who had taken over an academic bu…",
        "id_str": "1785643512941224066"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 12:12:41 +0000 2024",
        "full_text": "RT @CBSMornings: A pro-Palestinian encampment at UCLA came under attack overnight from pro-Israel counter-protesters using fireworks.\n\n@car…",
        "id_str": "1785643505206874399"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 12:12:40 +0000 2024",
        "full_text": "RT @CBSMornings: Severe storms have caused dangerous flooding in Southeast Texas, with some rivers at the highest levels they’ve seen in ne…",
        "id_str": "1785643497246048517"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 12:00:01 +0000 2024",
        "full_text": "The Federal Reserve will announce its third interest rate decision of 2024 today as high borrowing costs have slammed inflation-weary consumers. Here's what economists expect the Fed to announce. https://t.co/k3UjFDKvro",
        "id_str": "1785640314364916139"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 11:34:14 +0000 2024",
        "full_text": "Coming up on CBS News: \n\n🔘The NYPD entered Columbia University’s campus Tuesday night at the request of the school, arresting pro-Palestinian protesters \n\n🔘Florida’s six-week abortion ban begins today \n\n🏁F1's Lewis Hamilton hit the streets of NYC ahead of Miami Grand Prix https://t.co/8zh7gM5Bjo",
        "id_str": "1785633825499828371"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 11:30:00 +0000 2024",
        "full_text": "The start of Tuesday night's game between the Los Angeles Dodgers and Arizona Diamondbacks was delayed nearly two hours after a bee colony swarmed the top of the protective netting directly behind home plate. https://t.co/FEKodsGKM6",
        "id_str": "1785632761392325026"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 11:10:00 +0000 2024",
        "full_text": "A clash erupted overnight at UCLA between pro-Palestinian protesters and pro-Israel protesters, with fireworks being thrown and melees erupting on the campus. https://t.co/oAhPTvz0Vf",
        "id_str": "1785627726629531827"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 11:00:02 +0000 2024",
        "full_text": "https://t.co/EdAfbRbx7j",
        "id_str": "1785625219496890519"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 10:30:01 +0000 2024",
        "full_text": "Indonesia's Mount Ruang volcano spewed more hot clouds on Wednesday after an eruption the previous day forced the closure of schools and airports, pelted villages with volcanic debris and prompted hundreds of people to flee. https://t.co/q0TPNmwo5B https://t.co/tJVs22bnxR",
        "id_str": "1785617667996471483"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 10:00:00 +0000 2024",
        "full_text": "A man who kicked a bison in the leg was then injured by the bison in Yellowstone National Park, according to park officials, marking the first such time a visitor was injured by one of the iconic animals at the park this year. https://t.co/4rLPs6v6cW",
        "id_str": "1785610113610387914"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 09:00:00 +0000 2024",
        "full_text": "Don't just track your steps. Here are 4 health metrics to monitor on your smartwatch, according to doctors. https://t.co/TOZ1ZbLjLK",
        "id_str": "1785595014208258236"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 08:00:00 +0000 2024",
        "full_text": "Hammerhead flatworm spotted in Ontario after giant toxic worm invades Quebec, U.S. states. https://t.co/9ivIk3Q5qF",
        "id_str": "1785579913463964042"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 07:00:00 +0000 2024",
        "full_text": "The number of searches about Americans conducted by the FBI in a controversial foreign intelligence database fell by almost half in 2023 compared to the previous year, according to a new report released Tuesday by the U.S. intelligence community. https://t.co/4Jr3hXsiYx",
        "id_str": "1785564815722754418"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 06:00:00 +0000 2024",
        "full_text": "Venice becomes first city in the world to charge day trippers a tourist fee to enter. https://t.co/vshRzLMdll",
        "id_str": "1785549716421288144"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 05:00:00 +0000 2024",
        "full_text": "For nearly two weeks, pro-Palestinian protesters have set up encampments at universities across the U.S. Here's what they're demanding, and how institutions are responding. https://t.co/LJsDeuaKHJ https://t.co/1zECXWua1S",
        "id_str": "1785534613688885257"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 04:00:00 +0000 2024",
        "full_text": "Bird flu risk prompts warnings against raw milk, unpasteurized dairy products. https://t.co/79WdjuNOI0",
        "id_str": "1785519514257432809"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 03:40:00 +0000 2024",
        "full_text": "This Disney restaurant is first in theme-park history to win a Michelin star. https://t.co/ylwBI4yGpM",
        "id_str": "1785514482283778225"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 03:19:15 +0000 2024",
        "full_text": "One person died Tuesday and nearly two dozen homes were destroyed when a tornado ripped through the small city of Westmoreland in northeastern Kansas, authorities said. https://t.co/rb61Sd8VHW",
        "id_str": "1785509261323149407"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 03:07:17 +0000 2024",
        "full_text": "Several officers with shields, helmets and zip ties were seen entering a building taken over by protesters at Columbia University in New York on Tuesday night. The NYPD began moving in around 9 p.m. ET at the school's request, amid escalating pro-Palestinian protests, bringing… https://t.co/XWh5UViHoG",
        "id_str": "1785506248017977555"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 03:00:00 +0000 2024",
        "full_text": "San Diego Zoo will receive two new giant pandas from China after nearly all pandas in U.S. were returned. https://t.co/XfNZufBXqq",
        "id_str": "1785504416059076658"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 02:40:01 +0000 2024",
        "full_text": "Taylor Swift's 'The Tortured Poets Department' wasn't just good. According to Billboard, it was \"historic.\" https://t.co/2c0GeKTRiU",
        "id_str": "1785499384949440859"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 02:40:00 +0000 2024",
        "full_text": "Self-driving tractor-trailers heading for U.S. roads. https://t.co/Z3rxi04uxj",
        "id_str": "1785499384865579191"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 02:20:00 +0000 2024",
        "full_text": "Gold pocket watch found on body of Titanic's richest passenger is up for auction. https://t.co/0JqooZZrTA",
        "id_str": "1785494348454347149"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 02:00:00 +0000 2024",
        "full_text": "NASA recently used its James Webb Space Telescope to capture ethereal, detailed images of the Horsehead Nebula.  https://t.co/zdpt5efxOu",
        "id_str": "1785489317126631650"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 01:40:01 +0000 2024",
        "full_text": "A flight from Texas to Japan had to be canceled after the flight's captain became intoxicated and \"engaged in disorderly behavior\" at the hotel where they and other crew members were staying, Japan Airlines said Tuesday.  https://t.co/aTGMB4lThD",
        "id_str": "1785484285455040526"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 01:29:47 +0000 2024",
        "full_text": "WATCH LIVE: NYPD given permission to enter Columbia University campus amid protests https://t.co/Cps2Va3fSl https://t.co/ef4F8ql2hc",
        "id_str": "1785481712614490451"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 01:27:32 +0000 2024",
        "full_text": "BREAKING: NYPD officers have been sent into Columbia University's campus after demonstrators occupied a building overnight. https://t.co/3mZQyGzV91",
        "id_str": "1785481144034615322"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 01:20:00 +0000 2024",
        "full_text": "Donald Trump receives earnout bonus worth $1.8 billion in DJT stock https://t.co/K9xseHx7po",
        "id_str": "1785479249865879872"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 01:00:00 +0000 2024",
        "full_text": "An influencer ran a half marathon without registering. People were not happy.\n https://t.co/HGDNjn1rYx",
        "id_str": "1785474218051686484"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 00:40:01 +0000 2024",
        "full_text": "A man who kicked a bison in the leg was then injured by the bison in Yellowstone National Park, according to park officials, marking the first such time a visitor was injured by one of the iconic animals at the park this year. https://t.co/BSEifVzxmw",
        "id_str": "1785469186455519365"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 00:20:00 +0000 2024",
        "full_text": "A group of major newspaper publishers, including the Chicago Tribune and New York Daily News, are accusing two of the biggest artificial intelligence companies of stealing their content to improve their products.\n\n https://t.co/iJ84FoLxPK",
        "id_str": "1785464151168496000"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Wed May 01 00:00:00 +0000 2024",
        "full_text": "A California company is recalling walnuts sold at Whole Foods and other natural food stores in 19 states amid an E. coli outbreak that has sickened 12 people and hospitalized seven. \n\n https://t.co/EGJmBsY3UI",
        "id_str": "1785459119278715180"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:45:00 +0000 2024",
        "full_text": "One person died and 14 others were injured Tuesday after a sports utility vehicle crashed through the front glass wall of a thrift store in Las Cruces, New Mexico, authorities said. https://t.co/HaNDSMzbt9",
        "id_str": "1785455343792717965"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:40:00 +0000 2024",
        "full_text": "Former UFC champion Francis Ngannou said in a social media post on Monday that his 15-month-old son Kobe died. https://t.co/LGU7pNb1aP",
        "id_str": "1785454084004122836"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:37:26 +0000 2024",
        "full_text": "RT @CBSEveningNews: Billy the Barber is providing haircuts for adults and kids with sensory issues at his New Jersey shop – ensuring that a…",
        "id_str": "1785453437343109482"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:31:10 +0000 2024",
        "full_text": "RT @CBSEveningNews: A day after Columbia University officials began suspending student protesters for not dismantling their encampment, dem…",
        "id_str": "1785451861803180380"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:31:08 +0000 2024",
        "full_text": "RT @CBSEveningNews: The Drug Enforcement Administration is seeking to reclassify marijuana as a \"Schedule 3\" substance, sources tell CBS Ne…",
        "id_str": "1785451853527822575"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:31:06 +0000 2024",
        "full_text": "RT @CBSEveningNews: Internal documents obtained by CBS News show senior Biden administration officials have discussed several options for r…",
        "id_str": "1785451846129135915"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:31:04 +0000 2024",
        "full_text": "RT @CBSEveningNews: The Biden administration is urging Hamas to accept a deal to release some hostages in return for a temporary cease-fire…",
        "id_str": "1785451834989072684"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:31:01 +0000 2024",
        "full_text": "RT @CBSEveningNews: A 14-year-old boy was killed and four others were injured after police say a man drove into a house in London and began…",
        "id_str": "1785451822632567262"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:30:59 +0000 2024",
        "full_text": "RT @CBSEveningNews: Residents in the central U.S. are preparing for another round of severe weather that is expected to bring large hail, h…",
        "id_str": "1785451814302695893"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:30:55 +0000 2024",
        "full_text": "RT @CBSEveningNews: In Donald Trump's New York criminal trial, the judge held the former president in contempt of court and fined him $9,00…",
        "id_str": "1785451799131947040"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:30:53 +0000 2024",
        "full_text": "RT @CBSEveningNews: A 2-year-old boy was killed in a bounce house after a powerful wind gust sent it crashing into a neighboring yard in so…",
        "id_str": "1785451789359161790"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:30:48 +0000 2024",
        "full_text": "RT @CBSEveningNews: Victims of elder fraud lost nearly $3.4 billion last year, with over 100,000 complaints filed, according to a newly rel…",
        "id_str": "1785451770535129237"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:30:46 +0000 2024",
        "full_text": "RT @CBSEveningNews: Women should begin getting a mammogram every other year beginning at age 40, according to new guidance on breast cancer…",
        "id_str": "1785451759210577994"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:20:00 +0000 2024",
        "full_text": "Ex-NFL player Emmanuel Acho and actor Noa Tishby team up for \"Uncomfortable Conversations with a Jew\" to tackle antisemitism https://t.co/NE0b1NT0d3",
        "id_str": "1785449052902957297"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 23:00:00 +0000 2024",
        "full_text": "There's a new way to enroll in the Transportation Security Administration's PreCheck program to help get through airport security lines faster. \n\n https://t.co/J13hpeiCab",
        "id_str": "1785444017456493009"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 22:40:00 +0000 2024",
        "full_text": "More than half of cats around the first Texas dairy farm to test positive for bird flu this spring died after drinking raw milk from the infected cows, scientists reported this week. https://t.co/akSWqY0W7P",
        "id_str": "1785438985982025758"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 22:21:09 +0000 2024",
        "full_text": "President Biden and former President Trump are neck and neck in three key swing states, a new CBS News poll found.\n\n@aaronlarnavarro got reaction from voters in one of those states: Michigan. https://t.co/FZFr2qmlei",
        "id_str": "1785434242534502636"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 22:20:00 +0000 2024",
        "full_text": "A motion in the Minnesota Senate to call for the resignation of bemired DFL Sen. Nicole Mitchell failed Tuesday, and Mitchell herself was among those voting it down after a GOP-led effort to strip her of voting powers failed. https://t.co/SdwDpZta9k",
        "id_str": "1785433950216663447"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 22:19:38 +0000 2024",
        "full_text": "A Mexican man won a case against Cartier after buying $13,000 earrings online that were incorrectly listed for about $13. https://t.co/JQ7DhorEIV https://t.co/x4a23PuVGW",
        "id_str": "1785433857631658107"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 22:15:21 +0000 2024",
        "full_text": "Pro-Palestinian protesters smashed windows on the doors of Hamilton Hall at New York’s Columbia University early Tuesday, hours after the university began suspending students who had failed to leave an encampment on campus. The school has now said protesters who broke into the… https://t.co/ja9qcACNFR",
        "id_str": "1785432780987642278"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 22:10:06 +0000 2024",
        "full_text": "New CBS News polling shows voters in several battleground states say they are not satisfied with the current state of the economy. OMB Director Shalanda Young discusses it with @nancycordes, along with the latest foreign aid package and funding to rebuild Baltimore's Key Bridge. https://t.co/plGuzkWIv6",
        "id_str": "1785431459580228064"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 22:02:51 +0000 2024",
        "full_text": "Rep. Marjorie Taylor Greene is threatening to move ahead with a floor vote to remove Speaker Johnson, after House Democratic leaders announced they'd block those efforts.\n\n\"She is a legislative arsonist...We don't need to be a part of that,\" Democratic Caucus Chair Pete Aguilar… https://t.co/4uY53i5ubC",
        "id_str": "1785429633892245736"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 22:00:12 +0000 2024",
        "full_text": "WATCH LIVE: The Daily Report with John Dickerson spotlights reporting and interviews on the day's events https://t.co/65NDumzX6j https://t.co/mZ24EWvNK4",
        "id_str": "1785428969740710018"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 22:00:00 +0000 2024",
        "full_text": "Dave &amp; Buster's will allow guests to place wagers on its games, like Skee-Ball, through its app. https://t.co/SLJ1jk2RUd",
        "id_str": "1785428918905790751"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 21:40:00 +0000 2024",
        "full_text": "Farming, forestry, and fishing and hunting top the list of America's deadliest jobs, a recent analysis shows. https://t.co/APfiM0wMO6",
        "id_str": "1785423886915420203"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 21:25:39 +0000 2024",
        "full_text": "Pro-Palestinian protesters are still occupying Columbia University's Hamilton Hall, who university officials say now face expulsion.\n\nCBS News' @thomasrhanson reports on the latest from Columbia University: https://t.co/H6cIT0DtI1",
        "id_str": "1785420276114579817"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 21:20:00 +0000 2024",
        "full_text": "\"Showered at the factory and slept in the parking lot.\"\n\nTesla is known as a demanding workplace, but a recent LinkedIn post from a worker who lost his job is sparking a debate about whether workers should make such sacrifices for their employers. https://t.co/hHXVE6tWlp",
        "id_str": "1785418851192013260"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 21:18:53 +0000 2024",
        "full_text": "South Dakota Gov. Kristi Noem has dropped down on the list of Donald Trump's potential running mates after she wrote in a new book about killing a 14-month-old dog, reports CBS News Political Director @finnygo.\n\nIt's a story Noem was warned against sharing — but she and her inner… https://t.co/YC2FcXsGct",
        "id_str": "1785418570945437797"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 21:01:29 +0000 2024",
        "full_text": "The Biden administration is considering bringing certain Palestinians to the U.S. as refugees, a move that would offer a permanent safe haven to some of those fleeing war-torn Gaza, according to internal federal government documents obtained by CBS News. https://t.co/JKlEq2uxrx",
        "id_str": "1785414192687645064"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 21:00:52 +0000 2024",
        "full_text": "WATCH LIVE: \"America Decides\" has the latest political news, analysis and original reporting  https://t.co/N5oZfxvFs3\n\n https://t.co/0kaPgwqCzI",
        "id_str": "1785414036873425372"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 20:20:00 +0000 2024",
        "full_text": "Pasteurization is working to kill off bird flu in milk, according to tests run by the Food and Drug Administration — but what about unpasteurized dairy products like raw milk? https://t.co/oeFfBTL98Q",
        "id_str": "1785403753106993504"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 20:00:02 +0000 2024",
        "full_text": "Walmart is shutting down all of its health care clinics and virtual medical services, the nation's biggest retailer said on Tuesday, citing an inability to make the businesses profitable. https://t.co/6juTF7G8Sv",
        "id_str": "1785398726200107109"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 19:40:00 +0000 2024",
        "full_text": "A man who recently confessed to murdering two women in central Florida has been identified as \"a potential serial killer,\" authorities said. https://t.co/yAhYQkek2g",
        "id_str": "1785393687863628103"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 19:38:40 +0000 2024",
        "full_text": "Rep. Marjorie Taylor Greene has major leverage in Capitol Hill right now with her looming threat to oust House Speaker Mike Johnson, a fellow Republican. But what's she going to do with it?\n\n@MacFarlaneNews reports: https://t.co/gYboj0HZMo",
        "id_str": "1785393351291773127"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 19:20:00 +0000 2024",
        "full_text": "The Environmental Protection Agency is banning most uses of a toxic chemical often used to refinish furniture and bathtubs that has been linked to dozens of deaths since 1980. https://t.co/q5mFiWqVVH",
        "id_str": "1785388652018713014"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 18:37:09 +0000 2024",
        "full_text": "Donald Trump has been fined $9,000 and held in contempt of court after repeatedly violating a gag order in his New York criminal trial. CBS News' @errolbarnett  reports on the judge's ruling and what led up to it. https://t.co/ziapgSzi7C https://t.co/or07WtS1pG",
        "id_str": "1785377871575314878"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 18:31:58 +0000 2024",
        "full_text": "Columbia says protesters occupied Hamilton Hall overnight. See the videos from campus. https://t.co/4IXcWjbYop",
        "id_str": "1785376564827344979"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 18:02:52 +0000 2024",
        "full_text": "The DEA will move to reclassify marijuana as a less dangerous drug, The Associated Press has learned, a historic shift to generations of American drug policy that could have wide ripple effects across the country.\n\n https://t.co/tbszcqFUuj",
        "id_str": "1785369242226868332"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 18:00:00 +0000 2024",
        "full_text": "Experts advise starting breast cancer screenings at a younger age. We've gathered answers to the most common mammogram questions. https://t.co/KXXXxRNcj2",
        "id_str": "1785368521922220290"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 17:45:00 +0000 2024",
        "full_text": "Congressional Black Caucus chairman discusses President Biden campaign's efforts to appeal to Black voters. https://t.co/AKOWopqSP6",
        "id_str": "1785364745022800116"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 17:35:44 +0000 2024",
        "full_text": "U.S. officials are bracing for another summer of dangerous heat. These maps show where it's most likely to happen. https://t.co/3ynO9LugH7",
        "id_str": "1785362413425926170"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 17:34:26 +0000 2024",
        "full_text": "A flight from Texas to Japan had to be canceled after the flight's captain became intoxicated and \"engaged in disorderly behavior\" at the hotel where they and other crew members were staying. https://t.co/DxFK0aUxUD",
        "id_str": "1785362087234953558"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 17:30:52 +0000 2024",
        "full_text": "New details emerge after 4 law enforcement officers killed in shooting in Charlotte, North Carolina https://t.co/ZW29MAawai https://t.co/jXwrkMQx0Y",
        "id_str": "1785361189448372400"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 17:29:17 +0000 2024",
        "full_text": "An influencer ran a half marathon, but her accomplishment was not met with many congratulations – because she also admitted she didn't register for the race, a practice called \"banditing.\" https://t.co/jvq4jxW7An",
        "id_str": "1785360789429231668"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 16:50:15 +0000 2024",
        "full_text": "RT @CBSEveningNews: Here's a look at what's coming up on the CBS Evening News with @NorahODonnell at 6:30 p.m. ET. https://t.co/hrReMWbZ7a",
        "id_str": "1785350965563904493"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 16:48:36 +0000 2024",
        "full_text": "Who are Trump's potential VP picks? Here are some candidates who are still in the running. https://t.co/edKonBcAIY",
        "id_str": "1785350552815030438"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 16:45:00 +0000 2024",
        "full_text": "A 2-year-old boy died while playing in a bounce house that was swept up by a powerful wind gust in southwestern Arizona, authorities said.  \n https://t.co/6sKGHRN7nt",
        "id_str": "1785349647529103655"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 16:30:00 +0000 2024",
        "full_text": "Hawaii's 2021 Red Hill jet fuel leak sickened thousands — but it wasn't the first: \"The system has failed us\"  https://t.co/FVlGHbDlvq",
        "id_str": "1785345871447535774"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 16:19:17 +0000 2024",
        "full_text": "RT @cbssaturday: Comedian @natebargatze was once dubbed the nicest man in comedy, filling arenas thanks to his Tennessee twang, everyman fe…",
        "id_str": "1785343173243347088"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 16:15:00 +0000 2024",
        "full_text": "NASA recently used its James Webb Space Telescope to capture ethereal, detailed images of the Horsehead Nebula.  \n\n https://t.co/WUPMgxj4PP",
        "id_str": "1785342095437312196"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 16:00:00 +0000 2024",
        "full_text": "A mom has gone viral on TikTok after sharing her toddler was hearing a \"monster\" in her bedroom walls. Turns out, the noise was actually a colony of more than 50,000 bees. \n https://t.co/4La9TdVozD",
        "id_str": "1785338321956155850"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 15:49:49 +0000 2024",
        "full_text": "An American pilot who disappeared during a Vietnam War-era spy mission has been accounted for almost 60 years later, officials said.  https://t.co/rTjl7ZWTds",
        "id_str": "1785335760855429477"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 15:45:00 +0000 2024",
        "full_text": "House Democratic leaders announced they will vote to thwart any effort from Republican Rep. Marjorie Taylor Greene to oust House Speaker Mike Johnson from his post.  https://t.co/jj3wK6KoAu",
        "id_str": "1785334548747719054"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 15:30:00 +0000 2024",
        "full_text": "Four zebras escaped a trailer and were running amok on the roads of Washington state this weekend – and it took the state patrol and a former rodeo bullfighter to wrangle them back to safety.  https://t.co/1S6eZQ0rj7",
        "id_str": "1785330771957321975"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 15:15:00 +0000 2024",
        "full_text": "Americans over 60 years of age fell victim to so-called elder fraud crimes more frequently last year than in any other year and accounted for an estimated $3.4 billion in total reported losses, according to a newly released FBI report.  https://t.co/7bM3IJa7Vu",
        "id_str": "1785326996395884707"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 15:09:11 +0000 2024",
        "full_text": "WATCH LIVE: Officials give update on four officers shot and killed while serving arrest warrant in North Carolina  https://t.co/XiC90ZfZZi",
        "id_str": "1785325534274060362"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 15:00:02 +0000 2024",
        "full_text": "Kenyan President William Ruto convened a special cabinet meeting to discuss measures to tackle deadly floods that have killed nearly 170 people and displaced 185,000 others since March, his office said.  https://t.co/TN71YxrMCu",
        "id_str": "1785323229063577936"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 14:48:38 +0000 2024",
        "full_text": "RT @CBSMornings: 49-year-old Suzanna Morphew’s death is now being officially declared a homicide, according to a newly released autopsy rep…",
        "id_str": "1785320361908744674"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 14:48:35 +0000 2024",
        "full_text": "RT @CBSMornings: .@FrankBruni is out with a new book about one of the biggest issues he sees in the U.S. today: grievance.\n\nBruni says the…",
        "id_str": "1785320348864418229"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 14:48:32 +0000 2024",
        "full_text": "RT @CBSMornings: Genevieve Ko is sharing a recipe for a salmon dish inspired by the Canary Islands — and it only takes 20 minutes.\n\nThe dis…",
        "id_str": "1785320334930989539"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 14:45:00 +0000 2024",
        "full_text": "A man who kicked a bison in the leg was then injured by the bison in Yellowstone National Park, according to park officials, marking the first such time a visitor was injured by one of the iconic animals at the park this year. \n https://t.co/37C4VsMoGs",
        "id_str": "1785319448993296680"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 14:30:00 +0000 2024",
        "full_text": "16,000 people with disabilities are in state-operated institutions. This is how experts say health care should change. \n  https://t.co/aztlg6i21h",
        "id_str": "1785315671749894320"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 14:15:01 +0000 2024",
        "full_text": "Jack, who had Down syndrome, cannot contain his excitement when his older sister is coming to visit. \"These happy moments leave me grinning from ear to ear,\" his mom said. https://t.co/RMHPd1mYZE",
        "id_str": "1785311899850043511"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 14:00:01 +0000 2024",
        "full_text": "Rep. Elise Stefanik is calling on the Justice Department to open an investigation into special counsel Jack Smith, alleging he violated department standards and ethical duties related to his prosecution of former President Trump.  https://t.co/tKEOFbEQR7",
        "id_str": "1785308126310207912"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 13:52:44 +0000 2024",
        "full_text": "BREAKING: Former Pres. Donald Trump is held in contempt of court for violating a gag order in his New York criminal trial that limits what he can say about those involved in the case.  https://t.co/0zjerZWzPO",
        "id_str": "1785306293810450675"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 13:45:00 +0000 2024",
        "full_text": "A Walt Disney World restaurant is the first theme-park eatery to earn a Michelin star. \n\n https://t.co/OeSxK03t0C",
        "id_str": "1785304347754008779"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 13:30:01 +0000 2024",
        "full_text": "An American tourist who's facing over a decade behind bars in the Turks and Caicos islands after ammunition was found in his luggage told CBS News he's trying to FaceTime with his children back home as much as possible in case he ultimately goes to prison. https://t.co/SogbSifIHF",
        "id_str": "1785300576038736000"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 13:16:21 +0000 2024",
        "full_text": "RT @CBSMornings: The U.S. is jumpstarting its microchip production to compete with China — by using some American tax dollars.\n\n@jolingkent…",
        "id_str": "1785297136948486600"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 13:16:15 +0000 2024",
        "full_text": "RT @CBSMornings: .@jillonmoney shares what to expect from the Federal Reserve Board as they decide whether to lower interest rates — and wh…",
        "id_str": "1785297110541156709"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 13:16:12 +0000 2024",
        "full_text": "RT @CBSMornings: First on CBS Mornings, we’re announcing the nominees in six major categories for @TheTonyAwards with Broadway stars @jesse…",
        "id_str": "1785297099950584045"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 13:15:00 +0000 2024",
        "full_text": "Walmart is rolling out a new store label designed to appeal to younger customers who are not brand loyal and want gourmet foods that are more affordably priced.  https://t.co/CvvNkUlhyf",
        "id_str": "1785296798677925901"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 13:00:00 +0000 2024",
        "full_text": "2024 Tony Awards nominations have been announced to honor the best of Broadway. See the list of nominees.\n https://t.co/cFjSZUzH6Y",
        "id_str": "1785293024320258226"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 12:54:25 +0000 2024",
        "full_text": "RT @CBSMornings: There were mass demonstrations in Israel Monday night, as thousands of protesters blocked a highway in Tel Aviv to demand…",
        "id_str": "1785291619278725176"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 12:54:23 +0000 2024",
        "full_text": "RT @CBSMornings: Four law enforcement officers were killed in an ambush in Charlotte, North Carolina, while trying to serve a warrant on Mo…",
        "id_str": "1785291607706579288"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 12:54:19 +0000 2024",
        "full_text": "RT @CBSMornings: It’s day two of the trial of Karen Read, who is accused of murdering her Massachusetts police officer boyfriend in 2022.…",
        "id_str": "1785291591709503905"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 12:54:16 +0000 2024",
        "full_text": "RT @CBSMornings: Former Pres. Donald Trump will be back in a Manhattan court today as testimony resumes in his New York criminal trial.\n\n@c…",
        "id_str": "1785291581760688248"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 12:54:15 +0000 2024",
        "full_text": "RT @CBSMornings: More than 100 tornadoes touched down from Thursday to Monday in the central U.S., @NWS confirms.\n\n@weatherchannel’s @steph…",
        "id_str": "1785291574248673730"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 12:54:13 +0000 2024",
        "full_text": "RT @CBSMornings: William “Alden” Elliott, Samuel Poloche and Joshua Eyer have been identified as three of the four officers killed in a Nor…",
        "id_str": "1785291565696455112"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 12:30:05 +0000 2024",
        "full_text": "For the first time since starting cancer treatment in February, Britain’s King Charles III has returned to his official public duties – with a visit to patients and doctors at a hospital and a specialist cancer treatment center. https://t.co/YUMIzYk7EP\n\n📸: REUTERS/Hollie Adams https://t.co/XXE2JuoI7b",
        "id_str": "1785285492931510679"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 12:00:00 +0000 2024",
        "full_text": "A 36-year-old man has been arrested in London after attacking members of the public and two police officers with a sword, police said.  https://t.co/nPISjAMNXq",
        "id_str": "1785277922447708364"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 11:30:00 +0000 2024",
        "full_text": "Pro-Palestinian protests are continuing to spread across U.S. college campuses as universities grapple with how to clear encampments while supporting free speech, and consider their financial ties to Israel. https://t.co/5kDCDgo7qV",
        "id_str": "1785270372968861709"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 11:00:00 +0000 2024",
        "full_text": "The third week of fmr. Pres. Trump's New York criminal trial kicks off today with continued testimony from bank executive Gary Farro, who testified last Friday that Michael Cohen was his client when Cohen wired $130,000 to Stormy Daniels' lawyer. https://t.co/Rr1K5WCvy5",
        "id_str": "1785262822823272900"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 10:30:00 +0000 2024",
        "full_text": "A group of pro-Palestinian protestors at New York's Columbia University stormed Hamilton Hall overnight, reportedly barricading themselves with desks and vending machines. It's a building demonstrators occupied during the 1968 anti-Vietnam War protests. https://t.co/Xt53DdXKRA",
        "id_str": "1785255273487032821"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 10:00:00 +0000 2024",
        "full_text": "An invasive and harmful worm capable of growing to three feet long has been discovered in Ontario, Canada. The hammerhead land planarian is toxic and, experts warn, can pose a threat to pets, small children and small animals. https://t.co/ooY4WsoHln https://t.co/ud8ZVFPu2f",
        "id_str": "1785247724956205504"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 09:00:00 +0000 2024",
        "full_text": "U.S.\nThe Justice Department admitted a Navy jet fuel leak in Hawaii caused thousands to suffer injuries. https://t.co/SjoTSA1JFB",
        "id_str": "1785232626246205536"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 08:00:00 +0000 2024",
        "full_text": "A typo on Cartier's website that incorrectly priced a pair of gold-and-diamond earrings ended up being a costly mistake for the luxury jewelry retailer. https://t.co/lJrJvDkc5G https://t.co/HqbbzXnCdv",
        "id_str": "1785217524809806112"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 07:00:00 +0000 2024",
        "full_text": "4 law enforcement officers killed in shooting in Charlotte, North Carolina https://t.co/U8TotTrhuB",
        "id_str": "1785202427282477560"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 06:00:00 +0000 2024",
        "full_text": "Messi is the longest-serving passenger-screening explosives-detection canine in Washington, D.C., so when he retired TSA agents celebrated with a bunch of his favorite toys. https://t.co/gzLgci2jRl",
        "id_str": "1785187325393199582"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 05:00:00 +0000 2024",
        "full_text": "Prosecutors say they will not retry George Alan Kelly, Arizona rancher accused of murder near the US-Mexico border https://t.co/onHvwCChoi",
        "id_str": "1785172226263708135"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 03:59:00 +0000 2024",
        "full_text": "The winner of the $1.3 billion Powerball jackpot in Oregon last month is 46-year-old Cheng Saephan, a Laos-born immigrant living in Portland who had been battling cancer for eight years. https://t.co/M5fxwSN3LL https://t.co/O0hqrgZhkf",
        "id_str": "1785156877740806325"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 03:05:00 +0000 2024",
        "full_text": "Self-driving trucks are poised to become the first computer-controlled vehicles deployed in widespread numbers on public roads. https://t.co/cM7zQIRavd",
        "id_str": "1785143286346211524"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 02:40:00 +0000 2024",
        "full_text": "\"The Tortured Poets Department\" is Taylor Swift's 14th chart-topping album, tying her with Jay-Z. They are only surpassed for most No. 1s by The Beatles, who have 19. https://t.co/DfPJpIqlZQ https://t.co/GAL68NmHcA",
        "id_str": "1785136995255099629"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 02:20:00 +0000 2024",
        "full_text": "An orphaned killer whale calf that had been trapped for weeks in a tidal lagoon on Vancouver island  swam out on her own Friday, a local Indigenous tribe said. https://t.co/OQBSVYaDHP https://t.co/BbV3FuurIK",
        "id_str": "1785131963457610192"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 02:00:00 +0000 2024",
        "full_text": "Grizzly bears to be restored to Washington's North Cascades, where \"direct killing by humans\" largely wiped out population https://t.co/wX5DVaCu7C",
        "id_str": "1785126928065687781"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 01:41:00 +0000 2024",
        "full_text": "24 years ago, an officer was dispatched to an abandoned baby. Decades later, he finally learned that baby's surprising identity. https://t.co/xZiQpsut7w",
        "id_str": "1785122148832395555"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 01:20:01 +0000 2024",
        "full_text": "Here's how much income it takes to be considered rich in your state: https://t.co/iirEB3yyCJ",
        "id_str": "1785116864865079767"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 01:00:00 +0000 2024",
        "full_text": "\"We're not the sex police\": Here's what intimacy coordinators actually do on film and TV sets. https://t.co/Hpb5YzZyDK",
        "id_str": "1785111828072136977"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 00:45:55 +0000 2024",
        "full_text": "RT @CBSEveningNews: President Biden and former President Trump are neck-and-neck in the key swing states of Michigan, Wisconsin and Pennsyl…",
        "id_str": "1785108285122588866"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 00:40:00 +0000 2024",
        "full_text": "Poisoned cheesecake used as a weapon in an attempted murder a first for NY investigators. https://t.co/NLwEULdLhx",
        "id_str": "1785106797574967527"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 00:20:00 +0000 2024",
        "full_text": "Military families in Hawaii still have health concerns after jet fuel spill into Pearl Harbor water system. https://t.co/NndjRgyCJ7",
        "id_str": "1785101761335742678"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Tue Apr 30 00:00:00 +0000 2024",
        "full_text": "The government is now testing samples of ground beef sold in retail stores in the nine states where outbreaks of highly virulent bird flu have occurred in dairy cows, while offering assurances that U.S. meat is safe, the USDA said on Monday. https://t.co/wtRKSnA5Cc",
        "id_str": "1785096728238022966"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:40:00 +0000 2024",
        "full_text": "Mexican man wins case against Cartier after buying $13,000 earrings that were incorrectly priced online for $13.  https://t.co/CTsbHkmqVG",
        "id_str": "1785091696071528463"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:37:40 +0000 2024",
        "full_text": "RT @CBSEveningNews: Three-time WNBA Champion, two-time league MVP and two-time Olympic gold medalist Candace Parker announced she is retiri…",
        "id_str": "1785091109732995353"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:33:48 +0000 2024",
        "full_text": "RT @CBSEveningNews: Working parents nationwide are grappling with covering expenses for child care as providers say that last year's federa…",
        "id_str": "1785090135823987029"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:33:44 +0000 2024",
        "full_text": "RT @CBSEveningNews: Four zebras escaped near Seattle on Sunday after a driver halted to secure the trailer transporting the animals on a hi…",
        "id_str": "1785090121181589691"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:30:00 +0000 2024",
        "full_text": "Protests over the Israel-Hamas war continue at college campuses across the U.S. as graduation dates approach. https://t.co/ExlGC37XXC",
        "id_str": "1785089179811983683"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:23:52 +0000 2024",
        "full_text": "RT @CBSEveningNews: Paramount Global said Monday that CEO Bob Bakish is stepping down from his role, a major management shift at the media…",
        "id_str": "1785087636165582881"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:22:12 +0000 2024",
        "full_text": "RT @CBSEveningNews: The winner of the $1.3 billion Powerball jackpot in Oregon last month has been identified as 46-year-old Cheng “Charlie…",
        "id_str": "1785087216546410710"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:20:00 +0000 2024",
        "full_text": "Delta Air Lines appears to have recovered the emergency slide that fell from a plane minutes after takeoff at John. F. Kennedy International Airport late last week. Here's where it ended up. https://t.co/L3u77qUFdP",
        "id_str": "1785086664060137598"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:13:54 +0000 2024",
        "full_text": "RT @CBSEveningNews: A double-decker bridge in Portland, Oregon, has been temporarily closed following the derailment of a Union Pacific fre…",
        "id_str": "1785085129305526506"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:12:07 +0000 2024",
        "full_text": "RT @CBSEveningNews: Israeli Prime Minister Benjamin Netanyahu is facing mounting pressure from all sides over his country's ongoing war aga…",
        "id_str": "1785084679344803967"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:07:29 +0000 2024",
        "full_text": "RT @CBSEveningNews: At least five people were killed from severe weather over the weekend as more than 60 tornadoes ripped through communit…",
        "id_str": "1785083511528988713"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:03:58 +0000 2024",
        "full_text": "RT @CBSEveningNews: Columbia University officials have started suspending pro-Palestinian student demonstrators who have been camping out i…",
        "id_str": "1785082628783116459"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:01:45 +0000 2024",
        "full_text": "A group of Black male voters in Georgia sat down with @taureansmall to explain why they've decided to back Republicans in the 2024 elections. But they also say the GOP could do \"a better job\" of outreach to Black communities — something the Biden campaign is hoping to seize on. https://t.co/9nx52wI1bQ",
        "id_str": "1785082068960969050"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 23:00:00 +0000 2024",
        "full_text": "Democrats start out ahead in Pennsylvania, Wisconsin 2024 Senate races — CBS News Battleground Tracker poll https://t.co/TbBeGleXJH",
        "id_str": "1785081628642943137"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 22:56:05 +0000 2024",
        "full_text": "RT @CBSEveningNews: Three law enforcement officers were killed and at least five other officers were injured during a shootout at a home in…",
        "id_str": "1785080642574618844"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 22:40:00 +0000 2024",
        "full_text": "The Oxford High School shooter has been moved to another prison after he turned 18 over the weekend. https://t.co/fKaHDs5YIp",
        "id_str": "1785076597373927667"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 22:20:01 +0000 2024",
        "full_text": "The winner of the $1.3 billion Powerball jackpot in Oregon last month is an immigrant from Laos who had been battling cancer for eight years. https://t.co/uKCt0YniES",
        "id_str": "1785071566172094866"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 22:18:22 +0000 2024",
        "full_text": "With a handful of states that could decide Senate control, @SalvantoCBS shows new CBS News polling from two of them, Wisconsin and  Pennsylvania, where Democrats are starting out ahead: https://t.co/TSGGE14Qla https://t.co/cW00uw1ar8",
        "id_str": "1785071151347028306"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 22:14:55 +0000 2024",
        "full_text": "Florida Gov. Ron DeSantis met privately with former President Trump for several hours on Sunday and discussed, in part, fundraising ahead of the 2024 general election. It also comes as DeSantis eyes another potential White House bid in 2028, @finnygo reports. https://t.co/HFCG8H0F62",
        "id_str": "1785070283906322878"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 22:08:59 +0000 2024",
        "full_text": "WATCH LIVE: The Daily Report with John Dickerson spotlights reporting and interviews on the day's events https://t.co/0MGCIhM13t https://t.co/JnD6HGb87g",
        "id_str": "1785068792478834702"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 22:00:00 +0000 2024",
        "full_text": "An invasive and harmful worm capable of growing to three feet long has been discovered in Ontario, Canada. The hammerhead land planarian is toxic and, experts warn, can pose a threat to pets, small children and small animals. https://t.co/s0cbDvBoEm",
        "id_str": "1785066530507489583"
    }, {
        "posted_by": "CBSNews",
        "created_at": "Mon Apr 29 21:45:32 +0000 2024",
        "full_text": "RT @kabir_here: NEW Senate polling\n\nAs Dems play defense in '24, they start out ahead in Pennsylvania &amp; Wisconsin\n\nWhy races may tighten:\nD…",
        "id_str": "1785062890216550812"
    }]
}